Repository: censorship-no/ceno-docs
Catalog: user-manual/*/client/front-end.po
Languages: ar, de, el, es, fa, fr, my, pt, pt_br, ru, tr, uk, ur

source: Annex: The Ouinet client front-end
ar: ملحق: الواجهة الأمامية لعميل Ouinet
de: Anhang: Das Ouinet-Client-Frontend
el: Παράρτημα: Η εφαρμογή πελάτη Ouinet
es: Anexo: El front-end del cliente Ouinet
fa: پیوست: فرانت‌اند سرویس‌گیرنده‌ی وینت
fr: Annexe : L'interface du client Ouinet
my: နောက်ဆက်တွဲ - Ouinet သုံးစွဲသူအတွက် စာမျက်နှာ
pt: Anexo: o front-end do cliente Ouinet
pt_br: Anexo: O cliente front-end Ouinet
ru: Приложение: Внешний интерфейс клиента Ouinet
tr: Ek: Ouinet istemci ön yüzü
uk: Додаток: Зовнішній інтерфейс клієнта Ouinet
ur: ملحقہ: Ouinet کلائنٹ فرنٹ اینڈ

source: The Ouinet client (as run by e.g. Ceno Browser) offers a front-end page with some information and actions which may be useful for debugging the client. Many of them are also offered by the Ceno Extension via the [*Ceno Settings* page](../browser/settings.md), though others are only available here.
ar: يقدم عميل Ouinet (كما يتم تشغيله بواسطة متصفح Ceno على سبيل المثال) صفحة أمامية تحتوي على بعض المعلومات والإجراءات التي قد تكون مفيدة لتصحيح أخطاء العميل. يتم تقديم العديد منها أيضا بواسطة امتداد Ceno عبر صفحة [*إعدادات Ceno*](.. /browser/settings.md)، على الرغم من أن بعضها متاح هنا فقط.
el: Η εφαρμογή πελάτη Ouinet (όπως εκτελείται π.χ. από το Ceno) προσφέρει έναν ιστότοπο με πληροφορίες και ενέργειες που μπορεί να είναι χρήσιμες στον εντοπισμό σφαλμάτων. Πολλές από αυτές προσφέρονται επίσης από το πρόσθετο του Ceno μέσω της [σελίδας *Ρυθμίσεις Ceno*](../browser/settings.md).
es: El cliente Ouinet (como es ejecutado, por ejemplo, por Ceno Browser) ofrece una página de front-end con alguna información y acciones que podrían ser útiles para depurar al cliente. Muchas de ellas también son ofrecidas por la Extensión Ceno a través de la [página *Configuración de Ceno*](../browser/settings.md), aunque otras solamente están disponibles aquí.
ru: У клиента Ouinet (запускаемого, например, Браузером Ceno) есть служебный интерфейс со справочной информацией и действиями, которые могут быть полезны для отладки клиента. Многие из них также предлагаются расширением Ceno через страницу [*Настройки Ceno*](../browser/settings.md), однако некоторые доступны только здесь.

source: The front-end is accessible using any plain Web browser running on the same device (you can use Ceno too). Its default address is <http://127.0.0.1:8078/>. If you open it, you will see something like the figure below.
ar: يمكن الوصول إلى الواجهة الأمامية باستخدام أي متصفح ويب عادي يعمل على نفس الجهاز (يمكنك استخدام Ceno أيضا). عنوانه الافتراضي هو <http://127.0.0.1:8078/>. إذا قمت بفتحه ، فسترى شيئا مثل الشكل أدناه.
de: Auf das Front-End kann mit jedem einfachen Webbrowser zugegriffen werden, der auf demselben Gerät läuft (Sie können auch Ceno verwenden). Seine Standardadresse lautet <http://127.0.0.1:8078/>. Wenn Sie es öffnen, sehen Sie etwas wie in der folgenden Abbildung.
el: Ο ιστότοπος είναι προσβάσιμος χρησιμοποιώντας οποιονδήποτε φυλλομετρητή (μπορείτε να χρησιμοποιήσετε και το Ceno). Η προεπιλεγμένη διεύθυνση είναι <http://127.0.0.1:8078/>. Αν την ανοίξετε, θα δείτε κάτι όπως παρακάτω.
es: El front-end de usuaria(o) es accesible usando cualquier navegador Web común ejecutándose en el mismo dispositivo (también puedes usar Ceno). Su dirección por defecto es <http://127.0.0.1:8078/>. Si la abres, verás algo como la figura de abajo.
ru: Интерфейс доступен с помощью любого веб-браузера, запущенного на том же устройстве (можно использовать и Ceno). Его адрес по умолчанию — <http://127.0.0.1:8078/>. Если вы откроете его, вы увидите нечто похожее на рисунок ниже.

source: ![Figure: The client front-end](images/front-end.png)
ar: ![شكل: الواجهة الأمامية للعميل](images/front-end.png)
de: ![Abbildung: Das Client-Front-End](images/front-end.png)
el: ![Εικόνα: Ιστότοπος εφαρμογής πελάτη](images/front-end.png)
es: ![Figura: La interfaz de usuario del cliente](images/front-end.png)
fa: ![شکل: فرانت‌اند سرویس‌گیرنده](images/front-end.png)
fr: ![Visuel : L'interface du client](images/front-end.png)
my: ![ပုံ - အသုံးပြုသူ၏ ရှေ့စာမျက်နှာ](images/front-end.png)
pt: ![Figura: front-end do cliente] (Imagens/front-end.Forum)
pt_br: ![Figura: O front-end do cliente](images/front-end.png)
ru: ![Рисунок: Внешний интерфейс клиента](images/front-end.png)
tr: ![Görsel: İstemci ara yüzü](images/front-end.png)
uk: ![Малюнок: Зовнішній інтерфейс клієнта](images/front-end.png)
ur: ![تصویر: کلائنٹ فرنٹ اینڈ](images/front-end.png)

source: The items shown in the page include:
ar: تتضمن العناصر المعروضة في الصفحة ما يلي:
de: Auf der Seite werden unter anderem folgende Punkte angezeigt:
el: Τα στοιχεία που εμφανίζονται στη σελίδα περιλαμβάνουν:
es: Los ítems mostrados en la página incluyen:
fa: موارد نشان‌داده‌شده در این صفحه عبارت‌اند از:
fr: Les éléments affichés dans la page incluent :
my: စာမျက်နှာတွင် ပြသထားသော အကြောင်းအရာများတွင် အောက်ပါတို့ ပါဝင်သည် -
pt: Os itens mostrados na página incluem:
pt_br: Os itens mostrados na página incluem:
ru: На странице отображаются следующие элементы:
tr: Sayfada görüntülenen ögeler şunlardır:
uk: На сторінці відображаються такі елементи:
ur: صفحہ میں دکھائے گئے آئٹمز میں شامل ہیں:

source: A link to enable the client as a certificate authority (CA) at your browser, since the client needs to intercept HTTPS traffic.
ar: رابط لتمكين العميل كمرجع مصدق (CA) في متصفحك، حيث يحتاج العميل إلى اعتراض حركة مرور HTTPS.
de: Ein Link zur Aktivierung des Clients als Zertifizierungsstelle (CA) in Ihrem Browser, da der Client HTTPS-Verkehr abfangen muss.
el: Σύνδεσμο για να ενεργοποιήσετε την εφαρμογή πελάτη ως αρχή έκδοσης πιστοποιητικών (CA) στο φυλλομετρητή σας, λόγω του ότι πρέπει να καταγράφει τη δραστηριότητα HTTPS.
es: Un vínculo para habilitar al cliente como autoridad certificadora (CA) en tu navegador, ya que el cliente necesita interceptar tráfico HTTPS.
fa: یک لینک برای فعال‌سازیِ سرویس‌گیرنده به‌عنوان یک مقام رسمی (CA) در مرورگرتان، چون سرویس‌گیرنده نیاز به رهگیریِ ترافیک HTTPS دارد.
fr: Un lien permettant d'activer le client en tant qu'autorité de certification (CA) dans votre navigateur, car le client doit intercepter du trafic HTTPS.
my: သင့်ဘရောက်ဇာတွင် အက်အပလီကေးရှင်းကို HTTPS ဖြင့် ချိတ်ဆက်နိုင်ရန် လိုအပ်သည့် ခွင့်ပြုချက်လက်မှတ် (CA) ရယူရန် လင့်ခ်
pt: Uma ligação para permitir ao cliente como autoridade certificadora (CA) no seu navegador, uma vez que o cliente precisa de interceptar tráfego HTTPS.
pt_br: Um link para habilitar o cliente como uma autoridade de certificação (CA) no seu navegador, já que o cliente precisa interceptar o tráfego HTTPS.
ru: Ссылка для настройки Ouinet в качестве центра сертификации (ЦС) в вашем браузере, поскольку клиенту необходимо перехватывать HTTPS-трафик.
tr: İstemcinin HTTPS trafiğini işlemesi gerektiğinden, istemciyi tarayıcınızda sertifika kuruluşu (CA) olarak etkinleştireceği bir bağlantı.
uk: Посилання для налаштування Ouinet в якості центру сертифікації (ЦС) у вашому браузері, оскільки клієнт повинен перехоплювати HTTPS-трафік.
ur: آپ کے براؤزر پر کلائنٹ کو بطور سرٹیفکیٹ اتھارٹی (CA) فعال کرنے کا ایک لنک، کیونکہ کلائنٹ کو HTTPS ٹریفک کو روکنے کی ضرورت ہے۔

source: You only need this to use a plain browser for testing the Ouinet client, in which case you will also have to configure its HTTP/HTTPS proxies to `127.0.0.1:8077`, and manually enable the [Ceno Extension][Ceno Extension] for injection to work. We very strongly recommend using a *separate, specific browser profile* for this purpose.
ar: ما عليك سوى استخدام هذا لاستخدام متصفح عادي لاختبار عميل Ouinet، في هذه الحالة سيتعين عليك أيضا تهيئة وكلاء HTTP/HTTPS إلى "127.0.0.1:8077"، وتمكين [امتداد Ceno][امتداد Ceno] يدويا لكي يعمل هذا الحقن. نوصي بشدة باستخدام *ملف تعريف متصفح منفصل ومحدد* لهذا الغرض.
de: Sie benötigen dies nur, wenn Sie einen normalen Browser zum Testen des Ouinet-Clients verwenden. In diesem Fall müssen Sie auch dessen HTTP/HTTPS-Proxys auf "127.0.0.1:8077" konfigurieren und die [Ceno-Erweiterung][Ceno Extension] manuell aktivieren, damit die Injektion funktioniert. Wir empfehlen dringend die Verwendung eines *separaten, spezifischen Browserprofils* für diesen Zweck.
el: Το χρειάζεστε μόνο για να χρησιμοποιήσετε ένα φυλλομετρητή για τη δοκιμή του πελάτη Ouinet, οπότε θα πρέπει να ρυθμίσετε τους ενδιάμεσους HTTP/HTTPS σε `127.0.0.1:8077` και να ενεργοποιήσετε χειροκίνητα το [Πρόσθετο Ceno][Ceno Extension] για να λειτουργήσει η συλλογή στοιχείων. Συνιστούμε τη χρήση ενός *ξεχωριστού, ειδικού προφίλ του φυλλομετρητή* για τον σκοπό αυτό.
es: Solamente necesitas esto para usar un navegador común para probar al cliente Ouinet, en cuyo caso también tendrás que configurar sus proxys HTTP/HTTPS a `127.0.0.1:8077`, y habilitar manualmente la [Extensión Ceno][Extensión Ceno] para que funcione la inyección. Recomendamos muy enfáticamente usar un *perfil de navegador específico, separado* para este propósito.
ru: Это нужно только для использования обычного браузера для тестирования клиента Ouinet, в этом случае вам также придется настроить его HTTP/HTTPS прокси на `127.0.0.1:8077`, и вручную включить [Расширение Ceno][Расширение Ceno], чтобы инъекция работала. Мы настоятельно рекомендуем использовать *отдельный профиль браузера* для этой цели.

source: Please note that none of this needs to be done for Ceno Browser, since it is already configured like that.
ar: يرجى ملاحظة أنه لا يلزم القيام بأي من هذا لمتصفح Ceno، بما أنه تم تهيئته مسبقا على هذا النحو.
el: Λάβετε υπόψη, ότι τίποτα από αυτά δε χρειάζεται να γίνει για το Ceno Browser, καθώς είναι ήδη έτσι ρυθμισμένο.
es: Por favor ten en cuenta que nada de esto necesita ser hecho para el Ceno Browser, ya que ya está configurado así.
ru: Обратите внимание, что ничего из этого не нужно делать для Браузера Ceno, поскольку он уже настроен нужным образом.

source: Buttons to enable or disable the different mechanisms used by the client to access content.
ar: أزرار لتمكين أو تعطيل الآليات المختلفة التي يستخدمها العميل للوصول إلى المحتوى.
el: Τα κουμπιά για την (απ)ενεργοποίηση των διαφορετικών μηχανισμών πρόσβασης που χρησιμοποιούνται.
es: Botones para habilitar o deshabilitar los diferentes mecanismos usados por el cliente para acceder al contenido.
fr: Des boutons pour activer ou non les différents mécanismes utilisés par le client pour accéder au contenu.
my: ပါဝင်သည့် အကြောင်းအရာများကို အသုံးပြုရာတွင် လိုအပ်သည့် ထိန်းချုပ်မှုများလုပ်ဆောင်နိုင်ရန် အဖွင့် အပိတ် လုပ်နိုင်သည့် ခလုတ်များ။
pt: Botões para ativar ou desativar os diferentes mecanismos utilizados pelo cliente para aceder aos conteúdos.
pt_br: Botões para habilitar ou desabilitar os diferentes mecanismos usados pelo cliente para acessar conteúdo.
ru: Кнопки для включения или отключения различных механизмов, используемых клиентом для доступа к содержимому.
tr: İstemci tarafından içeriğe erişmek için kullanılacak yöntemlerin açıp kapatma tuşu.
uk: Кнопки для увімкнення або вимкнення різних механізмів, які клієнт використовує для доступу до контенту.
ur: مواد تک رسائی کے لیے کلائنٹ کے استعمال کردہ مختلف طریقہ کار کو فعال یا غیر فعال کرنے کے بٹن۔

source: Selectors to choose different log levels, like the default `INFO` (informational messages, warnings and errors) or `DEBUG` (verbose output useful for reporting errors). The log file can also be enabled and retrieved from here.
ar: محددات لاختيار مستويات السجل المختلفة، مثل `INFO` الافتراضية (الرسائل الإعلامية والتحذيرات والأخطاء) أو `DEBUG` (إخراج مطول مفيد للإبلاغ عن الأخطاء). يمكن أيضا تمكين ملف السجل واسترداده من هنا.
de: Selektoren zur Auswahl verschiedener Log-Ebenen, wie z. B. die Standardeinstellung `INFO` (Informationsmeldungen, Warnungen und Fehler) oder `DEBUG` (ausführliche Ausgabe, die für die Meldung von Fehlern nützlich ist). Die Protokolldatei kann hier auch aktiviert und abgerufen werden.
el: Επιλογές διαφορετικών επιπέδων αρχείων καταγραφής, όπως το προεπιλεγμένο `ΠΛΗΡΟΦΟΡΙΕΣ` (μηνύματα πληροφοριών, προειδοποιήσεις και σφάλματα) ή `ΑΠΟΣΦΑΛΜΑΤΩΣΗ` (λεπτομερής καταγραφή για την αναφορά σφαλμάτων). Το αρχείο καταγραφής μπορεί επίσης να ενεργοποιηθεί και να ανακτηθεί από εδώ.
es: Selectores para elegir diferentes niveles de registro, como el predeterminado `INFO` (mensajes informativos, advertencias y errores) o `DEBUG` (salida detallada útil para informar errores). El archivo de registro también puede ser habilitado y descargado desde aquí.
fr: Une liste déroulante proposant différents niveaux de détail du journal, comme `INFO` (messages d'information, avertissements et erreurs) ou `DEBUG` (sortie verbeuse, utile pour signaler des erreurs). Le fichier journal peut également être activé et récupéré à partir d'ici.
my: လုပ်ဆောင်ချက်များကို အဆင့်အလိုက် ရွေးချယ်နိုင်သည့် သေတ္တာများ။ ဥပမာ - စနစ်က အလိုအလျောက် ရွေးချယ်ထား သော `INFO` (သတင်းအချက်အလက် မက်ဆေ့ချ်များ၊ သတိပြုစရာများနှင့် အမှားများ) သို့မဟုတ် `DEBUG` (အမှားများကို သတင်းပို့ရာတွင် အသုံးဝင်သည့် လုပ်ဆောင်ချက်) စသည်ဖြင့် ရွေးချယ်နိုင်သည်။
pt: Seletores para escolher diferentes níveis de registo, como o `INFO` (mensagens informativas, avisos e erros) ou o `DEBUG` (saída verbosa útil para reportar erros). O ficheiro de registo também pode ser ativado e recuperado a partir daqui.
pt_br: Seletores para escolher diferentes níveis de log, como o padrão `INFO` (mensagens informacionais, avisos e erros) ou `DEBUG` (saída detalhada útil para reportar erros). O arquivo de log pode também ser habilitado e recuperado a partir daqui.
ru: Селекторы для выбора различных уровней журнала (логов), например, по умолчанию `INFO` (информационные сообщения, предупреждения и ошибки) или `DEBUG` (подробный вывод, полезный для сообщения об ошибках). Файл журнала также можно включить и получить с этой страницы.
tr: Günlük ayrıntı seçenekleri, varsayılan `INFO` (bilgi iletileri, uyarılar ve hatalar) veya `DEBUG` (hataları bildirmek için kullanışlı detaylı çıktı) gibi. Günlük dosyası da buradan etkinleştirilip kaydedilebilir.
uk: Селектори для вибору різних рівнів журналу (логів), наприклад, за замовчуванням `INFO` (інформаційні повідомлення, попередження та помилки) або `DEBUG` (докладний висновок корисний для повідомлення про помилки). Звідси також можна увімкнути та отримати файл журналу .
ur: منتخب کنندگان مختلف لاگ لیولز کا انتخاب کریں، جیسے ڈیفالٹ `INFO` (معلوماتی پیغامات، انتباہات اور غلطیاں) یا `DEBUG` (غلطیوں کی اطلاع دینے کے لیے مفید وربوز آؤٹ پٹ)۔ لاگ فائل کو یہاں سے بھی فعال اور بازیافت کیا جا سکتا ہے۔

source: When enabling the log file, the log level is automatically set to `DEBUG` (though you may change it again from here). When disabling the log file, the original log level is restored.
ar: عند تمكين ملف السجل، يتم تعيين مستوى السجل تلقائيا على `DEBUG` (رغم ذلك يمكنك تغييره مرة أخرى من هنا). عند تعطيل ملف السجل، تتم استعادة مستوى السجل الأصلي.
el: Όταν ενεργοποιείτε το αρχείο καταγραφής, το επίπεδο ορίζεται αυτόματα σε `ΑΠΟΣΦΑΛΜΑΤΩΣΗ` (αν και μπορείτε να το αλλάξετε ξανά από εδώ). Όταν το απενεργοποιείτε, επανέρχεται το αρχικό επίπεδο καταγραφής.
es: Al habilitar el archivo de registro, el nivel de registro automáticamente se establece a `DEBUG` (aunque también puedes cambiarlo de nuevo desde aquí). Al deshabilitar el archivo de registro, el nivel de registro original es restablecido.
fa: در هنگام فعالسازی فایل گزارش، سطح گزارش به طور خودکار روی «عیب‌یابی» قرار می‌گیرد (گرچه شما می‌توانید آن را دوباره از اینجا تغییر دهید). در هنگام غیرفعال‌کردن فایل گزارش، سطح گزارش اولیه بازگردانده می‌شود.
fr: Lorsque vous activez le fichier journal, son niveau de détail est automatiquement fixé sur `DEBUG` (mais vous pouvez le modifier selon vos besoins). Et lorsque vous le désactivez, son niveau original est restauré.
my: စာရင်းဖိုင်ကို ဖွင့်လိုက်သောအခါ စာရင်းအဆင့်ကို အလိုအလျောက် `DEBUG` သို့ ပြောင်းလဲသတ်မှတ်လိုက်သည် (ဒီနေရာတွင် သင် ပြန်လည်ပြောင်းလဲနိုင်သော်လည်း)။ စာရင်းဖိုင်ကို ပိတ်လိုက်သောအခါ မူလစာရင်းအဆင့်ကို ပြန်လည် ပြောင်းလဲသွားသည်။
pt: Ao ativar o ficheiro de registo, o nível de registo é automaticamente definido para `DEBUG` (embora possa alterá-lo novamente a partir daqui). Ao desativar o ficheiro de registo, o nível de registo original é restaurado.
pt_br: Ao habilitar o arquivo de log, o nível de log é automaticamente definido para `DEBUG` (embora você possa modificá-lo novamente aqui). Ao desabilitar o arquivo de log, o nível de log original é restaurado.
ru: При включении файла журнала уровень журнала автоматически устанавливается на значение `DEBUG` (хотя вы можете изменить его). При отключении файла журнала будет восстановлен исходный уровень.
tr: Günlük dosyası etkinleştirilirken ayrıntı seviyesi kendiliğinden `DEBUG`olarak ayarlanır, istediğiniz zaman değiştirebilirsiniz. Günlük dosyası kapatılırken varsayılan ayrıntı seviyesi tekrar ayarlanır.
uk: При включенні файлу журналу, рівень журналу автоматично встановлюється на значення `DEBUG` (хоча ви можете змінити його). У разі вимкнення файлу журналу, буде відновлено вихідний рівень.
ur: لاگ فائل کو فعال کرتے وقت، لاگ لیول خود بخود `DEBUG` پر سیٹ ہو جاتا ہے (حالانکہ آپ اسے یہاں سے دوبارہ تبدیل کر سکتے ہیں)۔ لاگ فائل کو غیر فعال کرتے وقت، لاگ کی اصل سطح بحال ہو جاتی ہے۔

source: Global client state and version information. Useful when reporting errors.
ar: حالة العميل الشاملة ومعلومات الإصدار. مفيد عند الإبلاغ عن الأخطاء.
de: Globale Client-Status- und Versionsinformationen. Nützlich bei der Meldung von Fehlern.
el: Γενικές πληροφορίες για κατάστασης και έκδοσης πελάτη. Χρήσιμη για την αναφορά σφαλμάτων.
es: Estado global del cliente e información de versión. Útil al reportar errores.
fa: اطلاعات مربوط به وضعیت و نسخه‌ی سرویس‌گیرنده‌ی جهانی. این اطلاعات در زمان گزارش ایرادها به کار می‌آیند.
fr: Informations sur l'état et la version du client. Utiles pour signaler des erreurs.
my: ကမ္ဘာလုံးဆိုင်ရာ သုံးစွဲသူအခြေအနေနှင့် ဗားရှင်းသတင်းအချက်အလက်များ။ အမှားများကို အစီရင်ခံသည့်အခါ အသုံးဝင်သည်။
pt: Informação global do estado do cliente e da versão. Útil na comunicação de erros.
pt_br: Estado global do cliente e informações de versão. Útil ao reportar erros.
ru: Общая информация о состоянии и версии клиента. Полезно при составлении отчетов об ошибках.
tr: İstemci durumu ve sürüm bilgisi. Hata bildirirken kullanışlıdır.
uk: Загальна інформація про стан та версію клієнта. Корисно при створенні звітів про помилки.
ur: عالمی کلائنٹ کی حالت اور ورژن کی معلومات۔ غلطیوں کی اطلاع دیتے وقت مفید ہے۔

source: Information about client connectivity and injector addressing. The default `bep5` method looks up Internet addresses in a BitTorrent injector swarm, as explained [here](../concepts/how.md).
ar: معلومات حول اتصال العميل وعنونة الحاقن. تبحث طريقة `bep5` الافتراضية عن عناوين الإنترنت في سرب حاقن بت تورنت BitTorrent، كما هو موضح [هنا](../concepts/how.md).
de: Informationen über Client-Konnektivität und Injektor-Adressierung. Die Standardmethode `bep5` sucht nach Internetadressen in einem BitTorrent-Injektor-Schwarm, wie [hier](../concepts/how.md) erklärt.
el: Πληροφορίες σχετικά με τη συνδεσιμότητα της εφαρμογής πελάτη και τη διευθυνσιοδότηση του καταγραφέα. Η προεπιλεγμένη μέθοδος `bep5` αναζητά διευθύνσεις Διαδικτύου σε ένα σύνολο καταγραφέων BitTorrent, όπως περιγράφεται [εδώ](../concepts/how.md).
es: Información acerca de la conectividad del cliente y el direccionamiento del inyector. El método por defecto `bep5` busca direcciones de Internet en un enjambre de inyectores BitTorrent, como se explica [aquí](../concepts/how.md).
fr: Informations à propos de la connectivité du client et l'adressage des injecteurs. La méthode `bep5` par défaut recherche les adresses Internet dans un essaim d'injecteurs BitTorrent, tel qu'expliqué [ici](../concepts/how.md).
my: အများသုံးသော့ကို ထိုးသွင်းစက်မှ လက်မှတ်များကို စစ်ဆေးရန်အတွက် အသုံးပြုပြီး ၎င်းတို့ကို ရယူရန်အတွက် သီးသန့်စီစဉ်ထားသောနည်းလမ်းဖြစ်သည်။ `bep5` ပုံသေနည်းလမ်းသည် BitTorrent ထိုးသွင်းစက် စာရင်းတွင် အင်တာနက်လိပ်စာများကို ရှာဖွေပါသည်။ ရှင်းပြချက်များကို [ဒီနေရာ](../concepts/how.md)တွင် ကြည့်ပါ။
pt: Informação sobre a conectividade do cliente e o endereçamento do injetor. O método padrão `bep5` procura endereços Internet num enxame de injetores BitTorrent, como explicado [aqui](.../conceitos/como.md).
pt_br: Informações sobre conectividade do cliente e endereçamento do injetor. O método padrão `bep5` procura endereços da Internet em um enxame de injetores BitTorrent, como explicado [aqui](../concepts/how.md).
ru: Информация о подключении клиентов и адресации инъекторов. Метод по умолчанию, `bep5`, ищет интернет-адреса среди «роя» инъекторов BitTorrent, как описано в [этом разделе](../concepts/how.md).
tr: İstemci bağlantıları ve içerik ekleyici adreslemesi hakkında bilgi. Varsayılan `bep5` yöntemi [burada açıklandığı](../concepts/how.md) gibi BitTorrent içerik ekleyici havuzundan internet adreslerini kontrol eder.
uk: Інформація про підключення клієнтів та адресацію ін'єкторів. За замовчуванням, метод`bep5` шукає інтернет-адреси серед «рою» ін'єкторів BitTorrent, як описано в [цьому розділі](../concepts/how.md).
ur: کلائنٹ کنیکٹیویٹی اور انجیکٹر ایڈریسنگ کے بارے میں معلومات۔ پہلے سے طے شدہ `bep5` طریقہ BitTorrent انجیکٹر بھیڑ میں انٹرنیٹ ایڈریس تلاش کرتا ہے، جیسا کہ [یہاں] (../concepts/how.md) کی وضاحت کی گئی ہے۔

source: The public key used to verify signatures from injectors in the distributed cache.
ar: المفتاح العام المستخدم للتحقق من التوقيعات الصادرة من الحاقنات في ذاكرة التخزين المؤقت الموزعة.
de: Der öffentliche Schlüssel, der zur Überprüfung von Signaturen von Injektoren im verteilten Cache verwendet wird.
el: Το δημόσιο κλειδί που χρησιμοποιείται για την επαλήθευση υπογραφών από καταγραφείς στην κατανεμημένη κρυφή μνήμη.
es: La clave pública usada para verificar firmas de inyectores en la caché distribuida.
fa: کلید عمومی به کار رفته برای راستی‌آزمایی امضاها از انژکتورها در انبار توزیع‌شده.
fr: La clé publique, utilisée pour vérifier les signatures des injecteurs dans le cache distribué.
my: ဖြန့်ချိထားသော ယာယီမှတ်ဉာဏ်မှ ထိုးသွင်းစက်များတွင်ရှိနေသည့် လက်မှတ်များကို အတည်ပြုစစ်ဆေးရန်အတွက် အများသုံးသော့များကို အသုံးပြုသည်။
pt: A chave pública utilizada para verificar as assinaturas dos injetores na cache distribuída.
pt_br: A chave pública usada para verificar assinaturas dos injetores no cache distribuído.
ru: Открытый ключ, используемый для проверки подписей от инъекторов в распределенном кэше.
tr: Dağıtılmış ön bellekteki içerik ekleyicilerinin imzaları doğrulanırken herkese açık anahtar kullanılır.
uk: Відкритий ключ, який використовується для перевірки підписів від ін'єкторів у розподіленому кеші.
ur: عوامی کلید تقسیم شدہ کیش میں انجیکٹر سے دستخطوں کی تصدیق کے لیے استعمال ہوتی ہے۔
