Repository: censorship-no/ceno-docs
Catalog: user-manual/*/client/front-end.po
Languages: ar, de, el, es, fa, fr, my, pt, pt_br, ru, tr, uk, ur

source: Information on your local cache like the maximum content age, approximate size of the cache, a button to purge it completely, and a link to the list of announced cache entries.
ar: معلومات عن ذاكرة التخزين المؤقت المحلية، مثل الحد الأقصى لعمر المحتوى، والحجم التقريبي لذاكرة التخزين المؤقت، وزر لمسحها بالكامل، ورابط لقائمة إدخالات ذاكرة التخزين المؤقت المعلنة.
de: Informationen zu Ihrem lokalen Cache wie das maximale Alter des Inhalts, die ungefähre Größe des Cache, eine Schaltfläche zum vollständigen Löschen des Cache und ein Link zur Liste der angekündigten Cache-Einträge.
el: Πληροφορίες σχετικά με την τοπική σας προσωρινή μνήμη, όπως η μέγιστη ηλικία περιεχομένου, το κατά προσέγγιση μέγεθος της προσωρινής μνήμης, ένα κουμπί πλήρης εκκαθάρισής της και ένας σύνδεσμος προς τη λίστα των ανακοινωμένων καταχωρήσεων.
es: Información en tu caché local como la antigüedad máxima del contenido, el tamaño aproximado de la caché, un botón para purgarla completamente, y un vínculo a la lista de entradas de caché anunciadas.
fr: Informations concernant votre cache local, comme l'âge maximal du contenu, la taille approximative du cache, un bouton pour le purger complètement et un lien vers la liste des entrées de cache annoncées.
my: သင့်စက်တွင် ယာယီ သိမ်းဆည်းထားသောမှတ်ဉာဏ် အချက်အလက်များတွင် ယာယီ သိမ်းဆည်းထားသောအကြောင်းအရာ၏ အကြာဆုံးသိမ်းနိုင်သော သက်တမ်း၊ ယာယီသိမ်းဆည်းထားသောမှတ်ဉာဏ်၏ ခန့်မှန်းခြေအရွယ်အစားနှင့် ထိုမှတ်ဉာဏ်အချက်အလက်များအားလုံးကို လုံးဝပိတ်ပစ်နိုင်သော ခလုတ်တစ်ခုတို့ပါဝင်သည်။
pt: Informação sobre a sua cache local como a idade máxima do conteúdo, tamanho aproximado da cache, um botão para a purgar completamente, e um link para a lista de entradas de cache anunciadas.
pt_br: Informações no seu cache local tais como a idade máxima do conteúdo, o tamanho aproximado do cache, um botão para limpar completamente e um link para a lista de entradas do cache anunciadas.
ru: Информация о локальном кэше, такая как максимальный возраст содержимого, приблизительный размер кэша и ссылка на список анонсированных записей, а также кнопка для его полной очистки.
tr: Yerel ön belleğinizdeki içeriğin eskiliği, boyutu, tamamen silme tuşu ve ağ üzerinde duyurulan ön bellek girdilerinin bağlantısı gibi bilgiler.
uk: Інформація про локальний кеш, наприклад, максимальний вік вмісту, приблизний розмір кешу та посилання на список анонсованих записів, а також кнопка для його повного очищення.
ur: آپ کے مقامی کیش پر معلومات جیسے مواد کی زیادہ سے زیادہ عمر، کیش کا تخمینی سائز، اسے مکمل طور پر صاف کرنے کے لیے ایک بٹن، اور اعلان کردہ کیش اندراجات کی فہرست کا لنک۔

source: The directory of the external, static cache if enabled (Ceno does not currently use this).
ar: مجلد ذاكرة التخزين المؤقت الخارجية الثابتة إذا تم تمكينها (لا يستخدم Ceno هذا حاليًا).
de: Das Verzeichnis des externen, statischen Cache, falls aktiviert (Ceno verwendet dies derzeit nicht).
el: Ο κατάλογος της εξωτερικής, στατικής κρυφής μνήμης αν είναι ενεργοποιημένη (το Ceno δε χρησιμοποιεί επί του παρόντος).
es: El directorio de la caché estática externa, si está habilitada (Ceno no usa esto en la actualidad).
ru: Каталог внешнего статического кэша, если он включен (в настоящее время Ceno его не использует).

source: [Ceno Extension]: https://github.com/censorship-no/ceno-ext-settings/
ru: [Расширение Ceno]: https://github.com/censorship-no/ceno-ext-settings/

source: The Ouinet client (as run by e.g. the CENO Browser) offers a front-end page with some information and actions which may be useful for debugging the client. Many of them are also offered by the CENO Extension via the [*CENO Settings* page](../browser/settings.md), though others are only available here.
uk: У клієнта Ouinet (який запускається, наприклад, браузером CENO) є службовий інтерфейс з довідковою інформацією та діями, які можуть бути корисні для налагодження клієнта. Багато хто з них також пропонує розширення CENO через сторінку [*Налаштування CENO*(../browser/settings.md), проте деякі доступні лише тут.

source: The front-end is accessible using any plain Web browser running on the same device (you can use CENO too). Its default address is [http://127.0.0.1:8078/](http://127.0.0.1:8078/). If you open it, you will see something like the figure below.
fa: فرانت‌اند با استفاده از هر مرورگر ساده‌ی وب که روی همان دستگاه اجرا شود دسترس‌پذیر است (می‌توانید از سنو هم استفاده کنید). نشانی دشوارش این است:[http://127.0.0.1:8078/](http://127.0.0.1:8078/). اگر آن را باز کنید، چیزی شبیه به شکل پایین خواهید دید.
my: ထိုရှေ့စာမျက်နှာကို သင့်စက်ရှိ မည်သည့် ဘရောက်ဇာနှင့်မဆို ဖွင့်ကြည့်နိုင်သည် (CENO ဘရောက်ဇာကိုလည်း သုံးနိုင်သည်)။ လိပ်စာမှာ [http://127.0.0.1:8078/](http://127.0.0.1:8078/) ဖြစ်သည်။ ဖွင့်လိုက်လျှင် ဤသို့တွေ့ရမည်။
uk: Інтерфейс доступний за допомогою будь-якого веб-браузера, запущеного на тому ж пристрої (можна використовувати CENO). За замовчуванням, його адреса — [http://127.0.0.1:8078/](http://127.0.0.1:8078/). Якщо ви його відкриєте, то побачите щось схоже на малюнок нижче.

source: You only need this to use a plain browser for testing the Ouinet client, in which case you will also have to configure its HTTP/HTTPS proxies to `127.0.0.1:8077`, and manually enable the [CENO Extension][CENO Extension] for injection to work. We very strongly recommend using a *separate, specific browser profile* for this purpose.
fa: شما فقط به این نیاز دارید تا برای آزمودن سرویس‌گیرنده‌ی وینت از یک مرورگر ساده استفاده کنید، که در آن صورت بایستی پروکسی‌های HTTP/HTTPS آن را هم روی `127.0.0.1:8077` تنظیم کنید، و [افزونه‌ی سنو](https://github.com/censorship-no/ceno-ext-settings) را هم به صورت دستی فعال کنید تا انژکشن به کار بیفتد.
my: ရိုးရိုးဘရောက်ဇာတွင် Ouinet client ကို စမ်းသပ်ရန်အတွက်သာ ဤလင့်ခ်ကို လိုအပ်ပါသည်။ ဤလင့်ခ်ကို အသုံးပြုရန် HTTP/HTTPS ပရောက်စီများကို `127.0.0.1:8077` ဟု ပြောင်းရန်နှင့် အထူးပရောက်စီ ဆာဗာများ အလုပ်လုပ်စေရန် [CENO အဆက်][CENO အဆက်]ကို ဖွင့်ရန် လိုအပ်ပြီး ဖွင့်ရာတွင် *သီးခြား ဘရောက်ဇာ ပရိုဖိုင်ကို* အသုံးပြုရန် အကြံပြုပါသည်။
tr: Bunu yalnızca Ouinet istemcisini farklı bir tarayıcı ile test ederken kullanmanız gerekir. İçerik ekleyicilerin çalışması için HTTP/HTTPS vekil sunucularını `127.0.0.1: 8077` olarak yapılandırmanız ve [CENO Uzantısını] [CENO Extension] el ile etkinleştirmeniz gereklidir. Bu amaç için *ayrı, özel bir tarayıcı profili* kullanmanızı tavsiye ederiz.
uk: Вам це потрібно лише для використання звичайного браузера для тестування клієнта Ouinet, у цьому випадку вам також доведеться налаштувати його HTTP/HTTPS проксі на `127.0.0.1:8077` та вручну включити [Розширення CENO][Розширення CENO], щоб ін'єкція працювала. Ми рекомендуємо використовувати *окремий профіль браузера* для цієї мети.

source: Please note that none of this needs to be done for the CENO Browser, since it is already configured like that.
fa: لطفاً توجه کنید که انجام هیچ‌کدام از این کارها برای مرورگر سنو لازم نیست، چون این مرورگر پیشاپیش به همین صورت تنظیم شده است.
uk: Зверніть увагу, що нічого з цього не потрібно робити для браузера CENO, оскільки він вже налаштований як треба.

source: The directory of the external, static cache if enabled (CENO does not currently use this).
fa: دفتر راهنمای انبار ایستای بیرونی در صورت فعال‌بودن (CENO در حال حاضر از این استفاده نمی‌کند).
my: အကယ်၍ ဖွင့်ထားပါက ပြင်ပ၊ တည်တံ့သော ယာယီမှတ်ဥာဏ်၏ လမ်းကြောင်း (CENO သည် ဒီအရာကို လက်ရှိတွင် အသုံးမပြုပါ)။
tr: Açıksa, harici sabit ön bellek dizini (CENO bunu henüz kullanmamakta)
uk: Каталог зовнішнього статичного кешу, якщо він увімкнений (нині CENO його не використовує).

source: [CENO Extension]: https://github.com/censorship-no/ceno-ext-settings/
my: [CENO အဆက်]: https://github.com/censorship-no/ceno-ext-settings/
uk: [Розширення CENO]: https://github.com/censorship-no/ceno-ext-settings/

source: The Ouinet client (as run by e.g. CENO Browser) offers a front-end page with some information and actions which may be useful for debugging the client. Many of them are also offered by the CENO Extension via the [*CENO Settings* page](../browser/settings.md), though others are only available here.
tr: Ouinet istemcisi (örneğin CENO Browser tarafından çalıştırılan) hata ayıklama gibi durumlarda kullanışlı olan bilgi ve işlemlerin bulunduğu bir ön sayfaya sahiptir. Bu seçeneklerden çoğuna CENO eklentisinin [*CENO Ayarları* sayfasından](../browser/settings.md) erişebilirsiniz, fakat bazı seçenekler sadece buradadır.

source: The front-end is accessible using any plain Web browser running on the same device (you can use CENO too). Its default address is <http://127.0.0.1:8078/>. If you open it, you will see something like the figure below.
tr: Ara yüze, aynı aygıtta çalışan herhangi bir tarayıcı ile erişilebilirsiniz (CENO da kullanabilirsiniz). Varsayılan adres: <http://127.0.0.1:8078 />. Eriştiğinizde aşağıdaki görseldeki gibi bir şey göreceksiniz.

source: Please note that none of this needs to be done for CENO Browser, since it is already configured like that.
tr: CENO Browser kendiliğinden kurulu geldiği için bunların gerekmediğini unutmayın.
