Repository: censorship-no/ceno-docs
Catalog: appstorelisting/playstoretext-*.po
Languages: bn, de, el, es, fa, fr, ko, my, pl, ru, sv, uk

source: CENO (Censorship.No!) is a mobile web browser. It uses peer-to-peer technology to deliver websites to your phone and caches popular content with cooperating peers. CENO can be used to bypass Internet censorship and help others retrieve blocked pages.
bn: CENO (Censorship.No!) মোবাইলের একটি ওয়েব ব্রাউজার। ফোনে ওয়েবসাইট দেখাতে এতে পিয়ার-টু-পিয়ার প্রযুক্তি ব্যবহৃত হয়, আর জনপ্রিয় কন্টেন্ট সহযোগী পিয়ারদের কাছে ক্যাশ করা হয়। CENO-র মাধ্যমে ইন্টারনেটের সেন্সরশিপ এড়ানো যায় ও ব্লক-করা পেইজ দেখতে অন্যদের সাহায্য করা যায়।
de: CENO (Censorship.No!) ist ein mobiler Webbrowser und verwendet Peer-to-Peer-Technologie um Webseiten auf dein Smartphone übertragen. Es hält bekannte Inhalte mit kooperierenden Peers vor. CENO kann dazu verwendet werden um Internet-Zensur auszuweichen und kann anderen helfen blockierte Webseiten zu empfangen.
el: Το CENO (Censorship.No!) είναι ένας φυλλομετρητής φορητών συσκευών. Χρησιμοποιεί την τεχνολογία διαμοιρασμού περιεχομένου των ιστοτόπων μεταξύ συνεργαζόμενων χρηστών. Το CENO μπορεί να χρησιμοποιηθεί για την παράκαμψη της λογοκρισίας και τη βοήθεια πρόσβασης σε αποκλεισμένους ιστότοπους.
es: CENO (Censorship.No!) es un navegador web móvil. Usa tecnología par-a-par para descargar sitios web a tu teléfono, y cachea contenido popular con pares cooperativos. CENO puede ser usado para evitar la censura de Internet y ayudar a otros a descargar páginas bloqueadas.
fa: پروژه CENO (نه به سانسور!) یک مرورگر وب برای تلفن‌های همراه است. از فناوری همتا به همتا (Peer to Peer) برای ارائه محتوای اینترنت استفاده می‌کند و محتوای مورد علاقه‌تان را از طریق همکاری دستگاه‌های همتا، ذخیره می‌کند. از CENO می‌توان برای دور زدن سانسور اینترنت و کمک به دیگران در بازیابی صفحات مسدودشده استفاده کرد.
fr: CENO (Censorship.No!) est un navigateur web pour téléphone mobile. Il utilise la technologie peer-to-peer pour afficher les contenus de sites web sur votre téléphone, tout en mettant en mémoire-cache des contenus populaires avec ses pairs coopérants. CENO peut ainsi être utilisé pour contourner la censure sur Internet et aider les autres à accéder à des pages bloquées.
ko: CENO(Censorship.No!)는 모바일 웹 브라우저입니다. P2P 기술을 사용하여 웹 사이트를 전화기로 전달하고 협력하는 동료와 인기 있는 콘텐츠를 캐시합니다. CENO는 인터넷 검열을 우회하고 다른 사람들이 차단된 페이지를 검색하는 데 사용할 수 있습니다.
my: CENO (Censorship.No!) သည် မိုဘိုင်းဖုန်း ဝဘ်ဘရောက်ဇာ ဖြစ်ပါသည်။ CENO သည် သင့်ဖုန်းသို့ ဝဘ်ဆိုက်များကို ပို့ပေးရန်နှင့် ပါဝင်သူများအချင်းချင်း လူကြိုက်များသော အကြောင်းအရာများကို ယာယီသိမ်းဆည်းထားသော မှတ်ဉာဏ်ဖြင့် သိမ်းထားရန် အသုံးပြုသူမှ အသုံးပြုသူ နည်းပညာကို အသုံးပြုထားသည်။ အင်တာနက်ဆင်ဆာဖြတ်ခြင်းကို ရှောင်လွှဲခြင်းနှင့် ပိတ်ဆို့ထားသော စာမျက်နှာများကို ရယူရန်ကြိုးပမ်းခြင်းဖြင့် အခြားသူများအား ကူညီခြင်းတို့တွင် CENO ကို အသုံးပြုနိုင်သည်။
pl: CENO (Censorship.No!) jest mobilną przeglądarką internetową. Używa ona technologii peer-to-peer, aby dostarczyć strony internetowe na twój telefon i przechowywać popularne treści z innymi użytkownikami. CENO może zostać użyty do obejścia cenzury internetu i do pomagania innym przeglądania zablokowanych stron.
ru: CENO (Censorship.No!) — это мобильный веб-браузер. Он использует технологию пиринговых (p2p) сетей, чтобы запрашивать веб-страницы, и кэширует популярный контент внутри сети. CENO можно использовать для обхода интернет-цензуры и помощи другим пользователям в получении доступа к заблокированным страницам.
sv: CENO (Censorship.No!) är en webbläsare för mobiltelefon. Den använder peer-to-peer-teknologi för att leverera hemsidor till din telefon och cachar populärt innehåll med samarbetande peers. CENO kan användas för att gå förbi censurering på Internet och hjälpa andra att hämta blockerade sidor.
uk: CENO (Censorship.No!) — це мобільний веб-браузер. Він використовує технологію пірінгових (peer-to-peer) мереж аби завантажувати веб-сторінки на вашому смартфоні і кешує популярний контент усередині мережі. CENO можна використовувати для обходу інтернет-цензури й аби допомогти іншим користувачам отримати доступ до заблокованих сторінок.

source: Say NO to censorship! Install CENO Browser today and be prepared for the next time you get 🔌 unplugged.
bn: সেন্সরশিপকে "না" বলুন! আজই CENO ব্রাউজার ইন্সটল করুন। যখন ইন্টারনেট বিচ্ছিন্ন 🔌 করে দেওয়া হবে তখনকার জন্য তৈরি থাকুন।
de: Sagt NEIN zur Zensur! Installiert den CENO Browser noch heute und seid darauf vorbereitet, wenn euch der 🔌 Stecker gezogen wird.
el: Πείτε ΟΧΙ στη λογοκρισία! Εγκαταστήστε τον φυλλομετρητή CENO σήμερα και προετοιμαστείτε για την επόμενη φορά που θα σας αποσυνδέσουν 🔌.
es: ¡Dile NO a la censura! Instala el Navegador CENO hoy para estar preparado para la próxima vez que te 🔌 desconecten.
fa: به سانسور نه بگویید! مرورگر CENO را همین حالا نصب کنید و برای دفعه بعد که اینترنت قطع شد، آماده باشید.
fr: Dites NON à la censure ! Installez le navigateur CENO dès aujourd'hui pour être prêt la prochaine fois que vous serez 🔌 débranché.
ko: 검열을 거부하십시오! 지금 CENO 브라우저를 설치하고 다음에 🔌 플러그를 뽑을 때를 대비하십시오.
my: ဆင်ဆာဖြတ်ခြင်းကို ငြင်းဆိုလိုက်ပါ။ ဒီနေ့ပဲ CENO ဘရောက်ဇာကို တပ်ဆင်ပြီး နောက်တစ်ကြိမ်တွင် ဆက်သွယ်မှု မပြတ်တောက်စေရန် 🔌 ပြင်ဆင်ထားလိုက်ပါ။
pl: Powiedz NIE cenzurze! Zainstaluj Przeglądarkę CENO już dziś i bądź gotowym gdy następnego razu zostaniesz 🔌 odłączony.
ru: Скажите НЕТ цензуре! Установите Браузер CENO сегодня и будьте готовы к следующему отключению 🔌.
sv: Säg NEJ till censurering! Installera webbläsaren CENO idag och var beredd på nästa gång du blir 🔌 urkopplad.
uk: Скажіть НІ цензурі! Встановіть браузер CENO сьогодні та будьте напоготові у випадку відключення від мережі 🔌.

source: 🚫🌴 Offline-first. CENO is designed with internet shutdown scenarios in mind. Websites are shared by a global network of peers, and stored in a distributed cache for availability when traditional networks are blocked or go down.
bn: 🚫🌴 অফলাইনভিত্তিক। ইন্টারনেট বন্ধ রাখা হয়েছে এমন পরিস্থিতির কথা ভেবে CENO তৈরি। বিশ্বব্যাপী পিয়ারদের কাছে ওয়েবসাইটের কন্টেন্ট শেয়ার করা হয়, আর বন্টিত (ডিস্ট্রিবিউটেড) ক্যাশে তা রক্ষিত থাকে যেন প্রচলিত নেটওয়ার্ক বন্ধ হয়ে গেলে বা বন্ধ করে দেওয়া হলেও সেসব পাওয়া যায়।
de: 🚫🌴 Offline-zuerst. CENO wurde unter Berücksichtigung von Szenarien für die Abschaltung des Internets entwickelt. Websites werden von einem globalen Netzwerk von Peers gemeinsam genutzt und zur Verfügbarkeit in einem verteilten Cache gespeichert, wenn herkömmliche Netzwerke blockiert werden oder ausfallen.
el: 🚫🌴 Αρχικά εκτός σύνδεσης. Το CENO σχεδιάστηκε για το σενάριο επιβολής διακοπής του διαδικτύου. Οι ιστότοποι διαμοιράζονται από ένα παγκόσμιο δίκτυο χρηστών και αποθηκεύεται σε μια κατανεμημένη κρυφή μνήμη για διαθεσιμότητα, όταν τα παραδοσιακά δίκτυα αποκλειστούν ή βγουν εκτός λειτουργίας.
es: 🚫🌴 Primero fuera de línea. CENO está diseñado con escenarios de apagones de internet en mente. Los sitios web son compartidos por una red global de pares, y almacenados en una caché distribuída para su disponibilidad cuando las redes tradicionales están bloqueadas o caídas.
fa: 🚫🌴اول - به‌طور آفلاین مرورگر CENO با در نظر گرفتن سناریوهای مختلفِ قطع اینترنت طراحی شده است. یک شبکه جهانی از همتایان، وب‌سایت‌ها را به اشتراک می‌گذارند و در صورتی که شبکه‌های سنتی مسدود شوند یا از بین بروند، در دسترس قرار می‌گیرند.
fr: 🚫🌴 Solution hors connexion. CENO est conçu pour s'adapter aux coupures Internet. Les contenus web sont partagés à travers un réseau mondial de pairs, puis stockés dans la mémoire-cache pour être alors diffusés dès que les réseaux traditionnels sont bloqués ou tombent en panne.
ko: 🚫🌴 오프라인 우선입니다. CENO는 인터넷 종료 시나리오를 염두에 두고 설계되었습니다. 웹사이트는 글로벌 피어 네트워크에서 공유되며 기존 네트워크가 차단되거나 다운될 때 가용성을 위해 분산 캐시에 저장됩니다.
my: 🚫🌴 အင်တာနက်ချိတ်ဆက်မှုများကို အရင်ပိတ်လိုက်ပါ။ အင်တာနက် ပိတ်ဆို့မှု ဖြစ်နိုင်ခြေများကို တွက်ချက်ပြီး CENO ကို ဖန်တီးထားခြင်းဖြစ်ပါသည်။ ဝဘ်ဆိုက်များသည် အသုံးပြုသူများ၏ ကမ္ဘာလုံးဆိုင်ရာ ချိတ်ဆက်မှုများဖြင့် မျှဝေထားခြင်းဖြစ်ပြီး ပုံမှန်သုံးသော ကွန်ရက်များ ပိတ်ဆို့ခံရခြင်း သို့မဟုတ် ချိတ်ဆက်မှု ကျဆင်းသွားသောအခါ ထိုဝဘ်ဆိုက်ကို ရရှိရန် ဖြန့်ချိထားသော ယာယီမှတ်ဉာဏ်တွင် သိမ်းဆည်းထားပါသည်။
pl: 🚫🌴 Offline-first. CENO zostało zaprojektowane z myślą o scenariuszach wyłączenia Internetu. Strony internetowe są współdzielone przez globalną sieć użytkowników i przechowywane w rozproszonej pamięci podręcznej w celu zapewnienia dostępności, gdy tradycyjne sieci są zablokowane lub ulegają awarii.
ru: 🚫🌴 Готов к оффлайну. CENO разработан с учетом сценариев отключения Интернета. Веб-сайты распространяются среди пользователей глобальной сети и хранятся в распределенном кэше, чтобы оставаться доступными, когда традиционные сети блокируются или выходят из строя.
sv: 🚫🌴Ej uppkopplad-först. CENO är designat för avstängningsscenarier av internet i åtanke. Webbplatser delas av ett globalt nätverk av jämlikar och lagras i en distribuerad cache för tillgänglighet när traditionella nätverk blockeras eller går ner.
uk: 🚫🌴 Готовий до офлайну. CENO створений з урахуванням сценаріїв відключення інтернету. Веб-сайти поширюються серед користувачів глобальної мережі та зберігаються в розподіленому кеші, щоб залишатися доступними у той час, коли традиційні мережі блокуються або виходять із ладу.

source: 🔓👀 Unlock the web. Access any website. Frequently requested content is cached on the network and cannot be forcibly removed.
bn: 🔓👀 ওয়েব থাকবে উন্মুক্ত। দেখতে পারবেন যেকোন ওয়েবসাইটই। বেশি দেখা হয় এমন কন্টেন্ট নেটওয়ার্কে ক্যাশ করা থাকে এবং তা জোর করে মুছে ফেলা সম্ভব নয়।
de: 🔓👀 Entsperren Sie das Web. Greifen Sie auf jede Website zu. Häufig angeforderte Inhalte werden im Netzwerk zwischengespeichert und können nicht zwangsweise entfernt werden.
el: 🔓👀 Ελευθερώστε το Διαδίκτυο. Αποκτήστε πρόσβαση σε ιστότοπους. Το περιεχόμενο που ζητείται συχνά, αποθηκεύεται προσωρινά στο δίκτυο και δεν μπορεί να αφαιρεθεί εξ αναγκασμού.
es: 🔓👀 Destraba la web. Accede a cualquier sitio web. El contenido solicitado frecuentemente es cacheado en la red y no puede ser removido a la fuerza.
fa: 🔓👀 قفل وب را باز کنید! به هر وب‌سایتی دسترسی پیدا کنید. محتوایی که به‌طور مکرر درخواست شده باشد، در شبکه ذخیره می‌شود و نمی توان آن را به زور حذف کرد.
fr: 🔓👀 Débloquez le web. Accédez à n'importe quel site web. Le contenu fréquemment demandé sera alors mis en cache sur le réseau et ne pourra être supprimé.
ko: 🔓👀 웹을 잠금 해제합니다. 웹 사이트에 액세스합니다. 자주 요청하는 내용은 네트워크에 캐시되므로 강제로 제거할 수 없습니다.
my: 🔓👀 ဝဘ်စာမျက်နှာကို ပြန်လည် ဖွင့်လိုက်ပါ။ မည်သည့် ဝဘ်ဆိုက်ကိုမဆို ရယူပါ။ မကြာခဏ တောင်းဆိုသော အကြောင်းအရာသည် ကွန်ရက်ပေါ်တွင် ယာယီသိမ်းဆည်းထားနိုင်ပြီး အတင်းအဓမ္မ ဖယ်ရှားမရနိုင်ပါ။
pl: 🔓👀 Odblokuj sieć. Uzyskaj dostęp do dowolnej strony internetowej. Często odwiedzane treści są buforowane w sieci i nie można ich siłą usunąć.
ru: 🔓👀 Разблокируйте Интернет. Получите доступ к любому сайту. Часто запрашиваемый контент кэшируется в сети и не может быть удален принудительно.
sv: 🔓👀 Lås upp nätet. Kom åt vilken hemsida som helst. Innehåll som begärs ofta cachelagras på nätverket och kan inte tas bort med tvång.
uk: 🔓👀 Розблокуйте інтернет. Отримайте доступ до будь-якого сайту. Контент, що часто запитується, кешується в мережі і не може бути видалений примусово.

source: 💲🌐 Reduce Data Costs. By routing user traffic through peer-to-peer networks, CENO Browser incurs less data costs while still providing users with circumvention capability.
bn: 💲🌐 কমবে ডাটার খরচ। পিয়ার-টু-পিয়ার নেটওয়ার্ক দিয়ে ইউজারের ট্রাফিক ঘুরিয়ে নেবার মাধ্যমে CENO ব্রাউজার ডাটা খরচ কমায়, আবার একইসাথে ইউজারকে সেন্সরশিপ এড়ানোর ক্ষমতাও দেয়।
de: 💲🌐 Senken Sie die Datenkosten. Durch die Weiterleitung des Benutzerdatenverkehrs über Peer-to-Peer-Netzwerke verursacht der CENO-Browser weniger Datenkosten und bietet den Benutzern dennoch Umgehungsmöglichkeiten.
el: 💲🌐 Μείωση Κόστους Δεδομένων. Με τη δρομολόγηση της κυκλοφορίας μεταξύ των χρηστών, ο φυλλομετρητής CENO επιβαρύνει λιγότερο το κόστος δεδομένων, ενώ εξακολουθεί να παρέχει τη δυνατότητα παράκαμψης.
es: 💲🌐 Reduce el costo de datos. Al enrutar el tráfico de usuario a través de redes par-a-par, el Navegador CENO incurre en menores costos de datos, mientras que aún les da a sus usuarios la capacidad de evasión.
fa: 💲🌐 کاهش هزینه‌های انتقال داده در اینترنت با هدایت ترافیک اینترنتی کاربر از طریق شبکه‌های همتا به همتا، مرورگر CENO هزینه‌های داده را برای شما کاهش می‌دهد، آن هم در شرایطی که هنوز قابلیت دور زدن (سانسور) را در اختیار کاربران قرار می‌دهد.
fr: 💲🌐 Réduisez le coût des données. En acheminant le trafic des utilisateurs à travers les réseaux peer-to-peer, le navigateur CENO génère une diminution du coût des données, tout en offrant aux utilisateurs une possibilité de contournement.
ko: 💲🌐 데이터 비용을 절감합니다. P2P 네트워크를 통해 사용자 트래픽을 라우팅함으로써, CENO 브라우저는 사용자에게 우회 기능을 계속 제공하면서 데이터 비용을 절감합니다.
my: 💲🌐 အင်တာနက် အချက်အလက်များရယူရန် ကျသင့်ငွေကို လျှော့ချပါ။ အသုံးပြုသူမှ အသုံးပြုသူ ကွန်ရက်မှတဆင့် အသုံးပြုသူအသွားအလာများကို ပြောင်းလဲခြင်းဖြင့် CENO ဘရောက်ဇာသည် အသုံးပြုသူများကို ပိတ်ဆို့ခြင်းများအား ရှောင်ရှားနိုင်စွမ်းဖြင့် ထောက်ပံ့ပေးနေစဉ် အင်တာနက် အချက်အလက်များအတွက် ကျသင့်ငွေကိုလည်း လျှော့ချပေးပါသည်။
pl: 💲🌐 Obniżenie kosztów transmisji danych. Dzięki kierowaniu ruchu użytkownika przez sieci peer-to-peer, CENO Browser ponosi mniejsze koszty transmisji danych, jednocześnie zapewniając użytkownikom możliwość obejścia.
ru: 💲🌐 Экономьте трафик. Благодаря маршрутизации пользовательского трафика через пиринговые сети, Браузер CENO несет меньше затрат на передачу данных, но при этом предоставляет пользователям возможность обхода цензуры.
uk: 💲🌐 Заощаджуйте трафік. Завдяки маршрутизації трафіку через пірингові мережі, браузер CENO витрачає менше трафіку для передавання даних, але при цьому надає користувачам можливість обійти цензуру.

source: 📖👐 Free and open source. CENO Browser is powered by Ouinet, an open source library enabling third party developers to incorporate the CENO network into their apps for peer-to-peer connectivity.
bn: 📖👐 বিনামূল্যে এবং ওপেন সোর্স। CENO Browserটি Ouinet দ্বারা চালিত, একটি ওপেন সোর্স লাইব্রেরি যা তৃতীয় পক্ষের বিকাশকারীদের পিয়ার-টু-পিয়ার সংযোগের জন্য তাদের অ্যাপে CENO নেটওয়ার্ককে অন্তর্ভুক্ত করতে সক্ষম করে।
de: 📖👐 Kostenlos und Open Source. CENO Browser basiert auf Ouinet, einer Open-Source-Bibliothek, die es Drittanbietern ermöglicht, das CENO-Netzwerk für Peer-to-Peer-Konnektivität in ihre Apps zu integrieren.
el: 📖👐 Ελεύθερο και ανοιχτό λογισμικό. Ο φυλλομετρητής CENO υποστηρίζεται από την Ouinet, μια βιβλιοθήκη ανοιχτού λογισμικού που επιτρέπει σε προγραμματιστές τρίτων να ενσωματώσουν το δίκτυο CENO στις εφαρμογές τους για συνδεσιμότητα μεταξύ χρηστών.
es: 📖👐 Código libre y abierto. El Navegador CENO está potenciado por Ouinet, una biblioteca de código abierto que habilita a desarrolladores externos a incorporar la red CENO dentro de sus aplicaciones para conectividad par-a-par.
fa: 📖👐 رایگان و متن‌باز. مرورگر CENO را Ouinet پشتیبانی می‌کند، یک کتابخانه که به‌طور متن‌باز طراحی شده که به توسعه‌دهندگان ثالث این توانایی را می‌دهد تا شبکه CENO را برای اتصال همتا به همتا به اپلیکیشن‌های خود اضافه کنند.
fr: 📖👐 Gratuit et open source. Le navigateur CENO fonctionne grâce à Ouinet, une bibliothèque open source permettant aux développeurs tiers d'intégrer le réseau CENO dans leurs applications pour une connectivité peer-to-peer.
ko: 📖👐 개방된 오픈 소스입니다. CENO 브라우저는 타사 개발자가 P2P 연결을 위해 CENO 네트워크를 앱에 통합할 수 있도록 하는 오픈 소스 라이브러리인 Ouinet에 의해 구동됩니다.
my: 📖👐 လွတ်လပ်၍ ပွင်းလင်းသော အရင်းအမြစ် ပြင်ပအဖွဲ့အစည်း ဆော့ဖ်ဝဲရေးသားသူများက အသုံးပြုသူမှ အသုံးပြုသူ ချိတ်ဆက်ခြင်းအတွက် အက်ပလီကေးရှင်းတွင် CENO ကွန်ရက်နှင့် ပူးပေါင်းဆောင်ရွက်သော ပွင့်လင်းရင်းမြစ် စာကြည့်တိုက်တစ်ခုဖြစ်သည့် Ouinet ကို CENO ဘရောက်ဇာတွင် အသုံးပြုထားသည်။
pl: 📖👐 Wolne i otwarte oprogramowanie. CENO Browser jest zasilana przez Ouinet, bibliotekę open source umożliwiającą innym programistom włączenie sieci CENO do swoich aplikacji w celu uzyskania łączności peer-to-peer.
ru: 📖👐 Свободный и с открытым исходным кодом. Браузер CENO работает на базе Ouinet — библиотеки с открытым исходным кодом, позволяющей сторонним разработчикам включать сеть CENO в свои приложения для обеспечения пиринговой связи.
uk: 📖👐 Вільний та з відкритим вихідним кодом. Браузер CENO працює на базі Ouinet — бібліотеки з відкритим вихідним кодом, що дозволяє стороннім розробникам включати мережу CENO у свої програми для забезпечення пірингового зв'язку.

source: Please note: CENO browser is experimental software. We offer it with the best intention that it is useful to you, but due to its highly innovative nature and stage of development, you may expect some issues while using it.
bn: বিঃ দ্রঃ CENO ব্রাউজার একটি পরীক্ষামূলক সফটওয়্যার। আপনার কাজে আসবে এই উদ্দেশ্য নিয়েই আমরা এটা উপস্থাপন করছি, তবে একদমই নতুন ধারার হবার কারণে আর সব দিককার সম্পূর্ণ উন্নতিসাধন এখনও শেষ না হবার কারণে ব্যবহার করার সময় কিছু সমস্যার মুখোমুখি হতে পারেন।
de: Bitte beachten Sie: CENO Browser ist experimentelle Software. Wir bieten es mit der besten Absicht an, dass es für Sie nützlich ist, aber aufgrund ihrer sehr innovativen Natur und Entwicklungsphase können Sie bei der Nutzung dieser erwarten.
el: Παρακαλούμε λάβετε υπόψη: ο φυλλομετρητής CENO είναι πειραματικό λογισμικό. Το προσφέρουμε με την καλύτερη πρόθεση να σας φανεί χρήσιμο, αλλά λόγω του ιδιαίτερα καινοτόμου χαρακτήρα του και του σταδίου ανάπτυξής του, μπορεί να παρουσιάσει ορισμένα ζητήματα κατά τη χρήση του.
es: Por favor ten en cuenta: el Navegador CENO es software experimental. Lo ofrecemos con la mejor intención de que te sea útil, pero debido a su naturaleza altamente innovativa y estado de desarrollo, deberías esperar algunas dificultades mientras lo usas.
fa: لطفا توجه کنید: مرورگر CENO نرم‌افزاری آزمایشی است. نیت ما این است که برای شما مفید و کارساز باشد، اما به دلیل ماهیت بسیار نوآورانه و این‌که در مرحله توسعه است، شاید هنگام استفاده از آن برخی مشکلات در انتظار شما باشد.
fr: Veuillez noter que le navigateur CENO est un logiciel expérimental, guidé par les meilleures intentions. Mais en raison de sa nature hautement innovante et de son développement en cours, vous pouvez rencontrer des problèmes lors de son utilisation.
ko: 참고: CENO 브라우저는 실험용 소프트웨어입니다. 사용자에게 유용하게 쓰일 수 있도록 최선을 다해 제공하지만, 매우 혁신적인 특성과 개발 단계로 인해 사용하는 동안 약간의 문제가 예상될 수 있습니다.
my: ကျေးဇူးပြုပြီး သတိပြုပါ - CENO ဘရောက်ဇာသည် စမ်းသပ်နေဆဲ ဆော့ဖ်ဝဲတစ်ခုဖြစ်ပါသည်။ သင့်အတွက် အသုံးဝင်နိုင်မည် ဆိုသော အကောင်းဆုံးရည်ရွယ်ချက်ဖြင့် ကျွန်ုပ်တို့ကမ်းလှမ်းထားပါသည်။ သို့သော် ဘရောက်ဇာ၏ အလွန်ဆန်းသစ်တီထွင်ထားသော သဘာဝနှင့် ဖွံ့ဖြိုးတိုးတက်မှု အခြေအနေတို့ကြောင့် ဘရောက်ဇာကို အသုံးပြုနေစဉ် တချို့သော ပြဿနာများကို သင်ကြုံတွေ့နိုင်ပါသည်။
pl: Uwaga: Przeglądarka CENO jest oprogramowaniem eksperymentalnym. Oferujemy ją z najlepszą intencją, aby była dla Ciebie użyteczna, ale ze względu na jej wysoce innowacyjny charakter i etap rozwoju, możesz spodziewać się pewnych problemów podczas korzystania z niej.
ru: Обратите внимание: Браузер CENO является экспериментальным программным обеспечением. Мы предлагаем его в надежде, что он будет полезным для вас, но из-за его инновационного характера и ранней стадии разработки могут возникать некоторые проблемы при использовании.
uk: Зауважте: браузер CENO є експериментальним програмним забезпеченням. Ми сподіваємося, що він буде корисним для вас, однак через інноваційність браузера та ранню стадію його розробки можуть виникати деякі проблеми під час використання.
