Repository: censorship-no/ceno-docs
Catalog: appstorelisting/playstoretext-*.po
Languages: bn, de, el, es, fa, fr, ko, my, pl, ru, sv, uk

source: CENO is not an anonymity tool: information about your browsing might be leaked to other CENO users, as well as the fact that your application is providing particular web content to others. Content accessed with the application may stay in storage in clear text for some time. Other security or privacy-affecting issues might exist.
bn: পরিচয় গোপন করা CENO-র কাজ নয়: আপনার ব্রাউজিং বিষয়ক তথ্য অন্যান্য CENO ইউজারদের জেনে ফেলার ঝুঁকি রয়েছে; আপনার অ্যাপ দিয়ে অন্যদের কাছে ওয়েবের নির্দিষ্ট যে কিছু কন্টেন্ট পৌঁছাচ্ছে তাও তারা জেনে যেতে পারে। এই অ্যাপ দিয়ে পাওয়া কন্টেন্ট পাঠযোগ্য ক্লিয়ার টেক্সট আকারে কিছু দিন ডিভাইসে জমা থাকতে পারে। নিরাপত্তা- ও গোপনীয়তা-সংক্রান্ত অন্যান্য সমস্যাও থাকতে পারে।
de: CENO ist kein Anonymitätstool: Informationen über Ihr Browsen können an andere CENO-Benutzer weitergegeben werden, ebenso wie die Tatsache, dass Ihre Anwendung bestimmte Webinhalte für andere bereitstellt. Inhalte, auf die mit der Anwendung zugegriffen wird, können für einige Zeit im Klartext gespeichert bleiben. Möglicherweise gibt es andere Sicherheits- oder Datenschutzprobleme.
el: Το CENO δεν είναι εργαλείο που παρέχει ανωνυμία: οι πληροφορίες σχετικά με την περιήγησή σας ενδέχεται να διαρρεύσουν σε άλλους χρήστες του CENO, καθώς η δική σας εφαρμογή παρέχει συγκεκριμένο διαδικτυακό περιεχόμενο σε άλλους. Το περιεχόμενο στο οποίο αποκτάτε πρόσβαση μέσω της εφαρμογής μπορεί να παραμείνει αποθηκευμένο σε ελεύθερο κείμενο για κάποιο χρονικό διάστημα. Ενδέχεται να υπάρχουν και άλλα ζητήματα που επηρεάζουν την ασφάλεια ή την ιδιωτικότητα.
es: CENO no es una herramienta de anonimato: la información acerca de tu navegación podría ser filtrada a otros usuarios de CENO, como así también el hecho de que tu aplicación está proveyendo contenido web particular a otros. El contenido accedido con la aplicación puede permanecer almacenado en forma descifrada por algún tiempo. Otras cuestiones de seguridad o que afecten a la privacidad podrían existir.
fa: مرورگر CENO یک ابزار ناشناس‌ماندن در اینترنت نیست: اطلاعات مربوط به مرورگری شما ممکن است در دسترس سایر کاربران CENO قرار گیرد، همچنین این نکته که اپلیکیشن شما محتوای وب خاصی را در اختیار دیگران قرار می‌دهد. محتوایی که از طریق اپلیکیشن دسترسی به آن امکان‌پذیر شده، برای مدتی در متن ذخیره می‌شود. احتمال وجود سایر مسائل امنیتی یا حریم خصوصی نیز هست.
fr: CENO n'est pas un outil d'anonymat : les informations de votre navigation peuvent être divulguées aux autres utilisateurs du CENO, étant donné que votre application fournit du contenu web aux autres utilisateurs. Le contenu accessible grâce à l'application peut rester stocké sous forme de texte brut pendant un certain temps. D'autres soucis de sécurité ou d'atteinte à la vie privée peuvent également exister.
ko: CENO는 익명 도구가 아닙니다. 귀하의 검색 정보가 다른 CENO 사용자에게 누출될 수 있을 뿐만 아니라 사용자의 응용프로그램이 특정 웹 콘텐츠를 다른 사용자에게 제공한다는 사실도 알 수 있습니다. 응용프로그램으로 액세스한 콘텐츠는 한동안 일반 텍스트로 저장소에 남아 있을 수 있습니다. 다른 보안 또는 개인 정보에 영향을 미치는 문제가 있을 수 있습니다.
my: CENO သည် မထင်မရှား သိုသိပ်နေသော ကိရိယာတစ်ခုမဟုတ်ပါ၊ သင်ရှာဖွေထားသော အချက်အလက်များသည် အခြားသော CENO အသုံးပြုသူများထံသို့ ပေါက်ကြားနိုင်ပါသည်။ ထို့ပြင် သင့်အက်ပလီကေးရှင်းသည် အခြားသူများအား တချို့သော ဝဘ်အကြောင်းအရာများကို ထောက်ပံ့နေပါသည်။ အက်ပလီကေးရှင်းဖြင့် ရယူကြည့်ရှုထားသော အကြောင်းအရာများသည် ရှင်းလင်းသော စာသားများအဖြစ် သိုလှောင်ခန်းတွင် အချိန်တစ်ခုအထိ ရှိနိုင်ပါသည်။ အခြားသော လုံခြုံရေး သို့မဟုတ် ကိုယ်ရေးလုံခြုံမှုကို ထိခိုက်နိုင်သော ပြဿနာများ ရှိနိုင်ပါသည်။
pl: CENO nie jest narzędziem zapewniającym anonimowość: informacje o przeglądanych przez ciebie stronach mogą wyciec do innych użytkowników CENO, podobnie jak fakt, że Twoja aplikacja udostępnia innym określone treści internetowe. Treści, do których uzyskujesz dostęp za pomocą aplikacji, mogą przez pewien czas pozostać w pamięci w postaci jawnego tekstu. Mogą wystąpić inne problemy związane z bezpieczeństwem lub prywatnością.
ru: CENO не является инструментом анонимности: информация о вашем просмотре может быть передана другим пользователям CENO, равно как и тот факт, что ваше приложение предоставляет определенный веб-контент другим пользователям. Контент, доступ к которому осуществляется с помощью приложения, может некоторое время храниться в открытом виде. Могут возникать и другие нюансы, влияющие на безопасность или конфиденциальность.
sv: CENO är inte ett anonymitetsverktyg: information om din surfning kan läcka ut till andra CENO-användare, såväl som det faktum att din applikation tillhandahåller särskilt webbinnehåll till andra. Innehåll som nås med appen kan lagras i klartext under en tid. Andra säkerhets- eller integritetspåverkande problem kan finnas.
uk: CENO НЕ є інструментом анонімності: інформація про ваш перегляд може бути передана іншим користувачам CENO, так само як і те, що ваша програма надає певний веб-контент іншим користувачам. Контент, доступ до якого здійснюється за допомогою програми, може деякий час зберігатися у відкритому вигляді. Можливі також інші нюанси, що мають значення для безпеки або конфіденційності.

source: We recommend that you use this tool in controlled environments and only assume reasonable risks. eQualitie and its associates decline any legal responsibility derived from the use of this software.
bn: আমরা সুপারিশ করি যে আপনি নিয়ন্ত্রিত পরিবেশে এই টুলটি ব্যবহার করুন এবং শুধুমাত্র যুক্তিসঙ্গত ঝুঁকি অনুমান করুন। eQualitie এবং এর সহযোগীরা এই সফ্টওয়্যার ব্যবহার থেকে প্রাপ্ত কোনো আইনি দায়িত্ব প্রত্যাখ্যান করে।
de: Wir empfehlen Ihnen, dieses Tool in kontrollierten Umgebungen zu verwenden und nur angemessene Risiken einzugehen. eQualitie und seine Mitarbeiter lehnen jegliche rechtliche Verantwortung ab, die sich aus der Verwendung dieser Software ergibt.
el: Σας συνιστούμε να χρησιμοποιείτε αυτό το εργαλείο σε ελεγχόμενο περιβάλλον και να αναλαμβάνετε μόνο κινδύνους που χρειάζεται. Η eQualitie και οι συνεργάτες της αρνούνται οποιαδήποτε νομική ευθύνη που απορρέει από τη χρήση αυτού του λογισμικού.
es: Recomendamos que uses esta herramienta en entornos controlados, y asumas solamente riesgos razonables. eQualitie y sus asociados declinan cualquier responsabilidad legal derivada del uso de este software.
fa: توصیه ما استفاده از این ابزار در محیط‌های کنترل شده است و البته در نظر گرفتن خطراتی که به‌طور منطقی ممکن است وجود داشته باشد. eQualitie و همکارانش هرگونه مسئولیت قانونی ناشی از استفاده از این ابزار را رد می‌کنند.
fr: Nous vous recommandons d'utiliser cet outil dans des environnements contrôlés et ne pas prendre de risques déraisonnables. eQualitie et ses partenaires déclinent toute responsabilité légale découlant de l'utilisation de ce logiciel.
ko: 통제된 환경에서 이 도구를 사용하고 합리적인 위험을 감수하는 것이 좋습니다. eQuality와 그 제휴사는 이 소프트웨어의 사용으로 인해 발생하는 모든 법적 책임을 거부합니다.
my: သင်သည် ဤကိရိယာကို ထိန်းချုပ်ခံရသော ပတ်ဝန်းကျင်တွင်အသုံးပြုသင့်ပြီး ဖြစ်လာနိုင်သော အန္တရာယ်များကို ကြိုတင်တွက်ဆထားသင့်ကြောင်း ကျွန်ုပ်တို့အကြံပြုပါတယ်။ eQualitie နှင့် ၎င်း၏လုပ်ဖော်ကိုင်ဖက်များသည် ယခုဆော့ဖ်ဝဲကို အသုံးပြုခြင်းမှ ဖြစ်ပေါ်လာသော မည်သည့် တရားဥပဒေအရ တာဝန်ယူမှုမျိုးကိုမဆို ငြင်းပယ်ပါသည်။
pl: Zalecamy używanie tego narzędzia w kontrolowanych środowiskach i podejmowanie jedynie rozsądnego ryzyka. eQualitie i jego współpracownicy zrzekają się wszelkiej odpowiedzialności prawnej wynikającej z używania tego oprogramowania.
ru: Мы рекомендуем использовать этот инструмент в контролируемой среде и принимать на себя только разумные риски. eQualitie и её партнеры отказываются от любой юридической ответственности, связанной с использованием этого программного обеспечения.
sv: Vi rekommenderar att du använder detta verktyg i kontrollerade miljöer och endast tar rimliga risker. eQualitie och dess medarbetare avsäger sig allt juridiskt ansvar som härrör från användningen av denna programvara.
uk: Ми рекомендуємо використовувати цей інструмент у країнах з підконтрольним інтернетом та брати на себе лише виправдані ризики. eQualitie та її партнери не беруть на себе будь-яку юридичну відповідальність, що пов'язана з використанням цього програмного забезпечення.

source: About eQualit.ie eQualit.ie develops open and reusable systems with a focus on privacy, online security, and information management. Our goal is to create accessible technology and improve the skill-set needed for defending human rights and freedoms in the digital age.
bn: eQualit.ie সম্পর্কে eQualit.ie গোপনীয়তা, অনলাইন নিরাপত্তা, এবং তথ্য ব্যবস্থাপনার উপর ফোকাস রেখে উন্মুক্ত এবং পুনরায় ব্যবহারযোগ্য সিস্টেম বিকাশ করে। আমাদের লক্ষ্য হল অ্যাক্সেসযোগ্য প্রযুক্তি তৈরি করা এবং ডিজিটাল যুগে মানবাধিকার ও স্বাধীনতা রক্ষার জন্য প্রয়োজনীয় দক্ষতা-সেট উন্নত করা।
de: Über eQualit.ie eQualit.ie entwickelt offene und wiederverwendbare Systeme mit Fokus auf Datenschutz, Online-Sicherheit und Informationsmanagement. Unser Ziel ist es, zugängliche Technologien zu schaffen und die Fähigkeiten zu verbessern, die für die Verteidigung der Menschenrechte und Freiheiten im digitalen Zeitalter erforderlich sind.
el: Σχετικά με την eQualit.ie Η eQualit.ie αναπτύσσει ανοικτά και επαναχρησιμοποιήσιμα συστήματα με έμφαση στην προστασία της ιδιωτικής ζωής, την ασφάλεια στο διαδίκτυο και τη διαχείριση πληροφοριών. Στόχος μας είναι η δημιουργία προσβάσιμης τεχνολογίας και η βελτίωση των δεξιοτήτων που απαιτούνται για την υπεράσπιση των ανθρωπίνων δικαιωμάτων και ελευθεριών στην ψηφιακή εποχή.
es: Acerca de eQualit.ie eQualit.ie desarrolla sistemas abiertos y reutilizables con foco en la privacidad, seguridad en línea, y gestión de la información. Nuestro objetivo es crear tecnología accesible y mejorar el conjunto de habilidades necesario para defender los derechos y libertades humanas en la era digital.
fa: درباره eQualit.ie eQualit.ie سیستم‌های باز و قابل استفاده مجدد را با تمرکز بر حریم خصوصی، امنیت آنلاین و مدیریت اطلاعات توسعه می‌دهد. هدف ما ایجاد فناوری‌های قابل دسترس است و بهبود سطح مهارت‌های مورد نیاز برای دفاع از حقوق بشر و آزادی در عصر دیجیتال است.
fr: À propos d'eQualit.ie eQualit.ie développe des systèmes ouverts et réutilisables axés sur la vie privée, la sécurité en ligne et la gestion de l'information. Notre objectif est de créer une technologie accessible et d'améliorer les savoir-faire nécessaires à la défense des droits de l'homme et des libertés à l'ère du numérique.
ko: eQualit.ie 정보 eQualit.ie는 개인 정보 보호, 온라인 보안 및 정보 관리에 중점을 두고 재사용 가능한 개방형 시스템을 개발합니다. 우리의 목표는 접근 가능한 기술을 만들고 디지털 시대의 인권과 자유를 수호하는 데 필요한 기술을 향상시키는 것입니다.
my: eQualit.ie အကြောင်း eQualit.ie သည် ပွင့်လင်းပြီး ပြန်လည်အသုံးပြုနိုင်သော နည်းစနစ်များဖြင့် ကိုယ်ရေးအချက်အလက်များ လုံခြုံမှု၊ အွန်လိုင်း လုံခြုံမှုနှင့် အချက်အလက်များကို စီမံထိန်းသိမ်းခြင်းတို့ကို ဦးစားပေးသောစနစ်ကို ပြုလုပ်ထားပါသည်။ ကျွန်ုပ်တို့၏ ပန်းတိုင်မှာ ဝင်ရောက်ကြည့်ရှုနိုင်သော နည်းပညာကို ဖန်တီးရန်နှင့် ဒီဂျစ်တယ်ခေတ်တွင် လူ့အခွင့်အရေးနှင့် လွတ်လပ်ခွင့်များကို ကာကွယ်ရန်အတွက် လိုအပ်သော အရည်အသွေးများကို မြှင့်တင်ရန်တို့ ဖြစ်သည်။
pl: O eQualit.pl eQualit.ie rozwija otwarte i wielokrotnego użytku systemy z naciskiem na prywatność, bezpieczeństwo online i zarządzanie informacjami. Naszym celem jest stworzenie dostępnej technologii i poprawa umiejętności potrzebnych do obrony praw i wolności człowieka w erze cyfrowej.
ru: О компании eQualit.ie eQualit.ie разрабатывает открытые и многократно используемые системы с упором на конфиденциальность, онлайн-безопасность и управление информацией. Наша цель – создание доступных технологий и повышение квалификации, необходимой для защиты прав и свобод человека в цифровую эпоху.
sv: Om eQualit.ie eQualit.ie utvecklar öppna och återanvändbara system med fokus på integritet, onlinesäkerhet och informationshantering. Vårt mål är att skapa tillgänglig teknik och förbättra den kompetens som behövs för att försvara mänskliga rättigheter och friheter i den digitala tidsåldern.
uk: Про компанію eQualit.ie eQualit.ie розробляє відкриті та багатофункціональні системи з акцентом на конфіденційності, онлайн-безпеці та управлінні інформацією. Наша мета — створення доступних технологій та підвищення навичок, що необхідні для захисту прав та свобод людини у цифрову епоху.

source: To learn more about CENO browser and its distributed library, Ouinet, please visit https://censorship.no
bn: CENO browser এবং এর বিতরণকৃত লাইব্রেরি, Ouinet সম্পর্কে আরও জানতে, দয়া করে https://censorship.no দেখুন
de: Um mehr über den CENO-Browser und seine verteilte Bibliothek Ouinet zu erfahren, besuchen Sie bitte https://censorship.no
el: Για να μάθετε περισσότερα για τον φυλλομετρητή CENO και τη διανεμημένη βιβλιοθήκη του, Ouinet, επισκεφθείτε τη διεύθυνση https://censorship.no
es: Para aprender más acerca del Navegador CENO y su biblioteca distribuída, Ouinet, por favor visita https://censorship.no
fa: برای آشنایی بیشتر با مرورگر CENO و کتابخانه توزیع‌شده‌ی Ouinet از وب‌سایت https://censorship.no بازدید کنید.
fr: Pour en savoir plus sur le navigateur CENO et sa bibliothèque décentralisée, Ouinet, veuillez consulter le site https://censorship.no
ko: CENO 브라우저와 해당 분산 라이브러리인 Ouinet에 대해 자세히 알아보려면 https://censorship.no를 방문하십시오
my: CENO ဘရောက်ဇာနှင့် ၎င်း၏ ဝေငှဖြန့်ဖြူးထားသောစာကြည့်တိုက် Ouinet အကြောင်း ပိုမိုသိရှိရန် ကျေးဇူးပြုပြီး https://censorship.no တွင် လေ့လာပါ။
pl: Aby dowiedzieć się więcej o przeglądarce CENO i jej rozproszonej bibliotece Ouinet, odwiedź stronę https://censorship.no
ru: Более подробную информацию о Браузере CENO и его распределенной библиотеке Ouinet можно найти на сайте https://censorship.no
sv: För att lära dig mer om webbläsaren CENO och dess distribuerade bibliotek, Ouinet, besök https://censorship.no
uk: Більш детальну інформацію про браузер CENO та його розподілену бібліотеку Ouinet можна знайти на сайті https://censorship.no

source: Questions / Need support? Read more in the CENO User Manual, or contact us at cenoers@equalit.ie. We love receiving feedback and are continuously improving CENO for its users!
bn: প্রশ্ন / সমর্থন প্রয়োজন? CENO ব্যবহারকারী ম্যানুয়াল এ আরও পড়ুন, অথবা cenoers@equalit.ieএ আমাদের সাথে যোগাযোগ করুন। আমরা প্রতিক্রিয়া পেতে পছন্দ করি এবং এর ব্যবহারকারীদের জন্য ক্রমাগত CENOকে উন্নত করছি!
de: Fragen / Benötigen Sie Unterstützung? Lesen Sie mehr im CENO-Benutzerhandbuch oder kontaktieren Sie uns unter cenoers@equalit.ie. Wir freuen uns über Feedback und verbessern CENO kontinuierlich für seine Benutzer!
el: Ερωτήσεις / Χρειάζεστε υποστήριξη; Διαβάστε περισσότερα στο Εγχειρίδιο χρήσης του CENO ή επικοινωνήστε μαζί μας στο cenoers@equalit.ie. Θα θέλαμε να λάβουμε τα σχόλια σας και να βελτιώνουμε συνεχώς το CENO για τους χρήστες του!
es: Preguntas / ¿Neceitas ayuda? Lee más en el Manual de usuario de CENO, o contáctanos a cenoers@equalit.ie. ¡Nos encanta recibir comentarios, y estamos mejorando continuamente a CENO para sus usuarios!
fa: پرسش‌ها/پشتیبانی نیاز دارید؟ اطلاعات تکمیلی را در دفترچه راهنمای CENO بخوانید یا از طریق ایمیل cenoers@equalit.ie با ما تماس بگیرید. ما از دریافت بازخوردهای شما استقبال می‌کنیم و به‌طور مداوم در حال کار در جهت بهبود عملکرد CENO برای کاربران آن هستیم!
fr: Questions / Besoin d'aide ? Pour en savoir plus, consultez le manuel d'utilisation de CENO, ou contactez-nous à l'adresse cenoers@equalit.ie. Nous sommes ravis de recevoir des commentaires d'utilisateurs pour continuer à améliorer CENO !
ko: 질문 / 지원이 필요하십니까? CENO 사용자 매뉴얼에서 자세한 내용을 읽거나 cenoers@equalit.ie로 문의하십시오. 우리는 피드백을 받는 것을 좋아하며 사용자를 위해 CENO를 지속적으로 개선하고 있습니다!
my: မေးခွန်းများ/ အကူညီလိုအပ်ပါသလား။ CENO သုံးစွဲသူလက်စွဲတွင် ပိုမိုဖတ်ရှုပါ သို့မဟုတ် cenoers@equalit.ie မှတဆင့် ကျွန်ုပ်တို့ကို ဆက်သွယ်ပါ။ အကြံပြုစာများရရှိခြင်းသည် အသုံးပြုသူများအတွက် CENO ကို ဆက်လက်တိုးတက်စေသောကြောင့် ကျွန်ုပ်တို့နှစ်သက်ပါသည်။
pl: Pytania / Potrzebujesz wsparcia? Przeczytaj więcej w instrukcji obsługi CENO lub skontaktuj się z nami na cenoers@equalit.ie. Uwielbiamy otrzymywać opinie i stale rozwijamy CENO dla naszych użytkowników!
ru: Есть вопросы или нужна поддержка? Вы можете найти более подробную информацию в Руководстве CENO или связаться с нами по адресу cenoers@equalit.ie. Мы любим получать обратную связь и постоянно совершенствуем CENO для его пользователей!
sv: Frågor / Behöver du hjälp? Läs mer i CENO's användarmanual eller kontakta oss på cenoers@equalit.ie. Vi älskar att ta emot återgivning och vi förbättrar ständigt CENO för dess användare!
uk: Є питання / потрібна підтримка? Ви можете знайти докладнішу інформацію в посібнику CENO або ж зв'язатися з нами через cenoers@equalit.ie. Ми раді чути зворотний зв'язок та постійно удосконалюємо CENO для його користувачів!

source: Stay connected, and help keep the web open and accessible to all!
bn: সংযুক্ত থাকুন, এবং ওয়েবকে সবার জন্য উন্মুক্ত এবং অ্যাক্সেসযোগ্য রাখতে সাহায্য করুন!
el: Μείνετε συνδεδεμένοι και βοηθήστε να διατηρηθεί το Διαδίκτυο ανοιχτό και προσβάσιμο σε όλους!
es: ¡Permanece conectado, y ayuda a mantener la web abierta y accesible para todos!
fa: متصل بمانید و کمک کنید تا محتوای وب به‌طور آزاد و باز در دسترس همگان باشد!
fr: Restez connecté, et contribuez à maintenir le web ouvert et accessible à tous !
ko: 연결 상태를 유지하고 모든 사람이 웹을 열고 액세스할 수 있도록 지원합니다!
my: ဆက်လက် ချိတ်ဆက်ထားပါ။ ဝဘ်ကိုဆက်လက်ဖွင့်ထားပြီး လူတိုင်းလက်လှမ်းမီအောင် ကူညီပေးပါ။
pl: Bądź połączony i pomóż zachować sieć wolna i dostępną dla wszystkich!
ru: Оставайтесь на связи и помогите сохранить Интернет открытым и доступным для всех!
sv: Håll kontakten och hjälp till att hålla webben öppen och tillgänglig för alla!
uk: Залишайтеся на зв'язку та допомагайте зберегти інтернет відкритим та доступним для всіх!
