Repository: censorship-no/ceno-docs
Catalog: user-manual/*/intro/ceno.po
Languages: ar, de, es, fa, fr, id, my, pt, pt_br, ru, tr, uk, ur, zh_hans

source: Ceno is meant for everyone but is particularly convenient for people interested in Web content that is censored on their network, and those those living in countries where connectivity to the global Internet is spotty, unreliable or expensive. It encourages and enables the sharing of web content among users, creating a decentralized network of peers helping each other.
ar: Ceno موجه للجميع ولكنه مناسب بشكل خاص للأشخاص المهتمين بمحتوى الويب الخاضع للرقابة والحجب على شبكتهم، وأولئك الذين يعيشون في بلدان يكون فيها الاتصال بالإنترنت العالمي متقطعا أو غير موثوق أو عالي الكلفة. يشجع Ceno ويمكٌن من مشاركة محتوى الويب بين المستخدمين، مما يخلق شبكة لامركزية من النظراء الذين يساعدون بعضهم البعض.
de: Ceno ist für jeden, aber speziell nützlich für jene welche unter Internet-Zensur in ihrem Netzwerk leiden und jene welche nur partiellen, unzuverlässigen oder teuren Internet-Zugang erhalten. Es animiert und befähigt die Nutzer Webinhalte untereinander zu teilen, dezentrale Netzwerke helfen einander.
es: Ceno es para toda(o)s, pero es particularmante conveniente para personas interesadas en contenido Web que es censurado en sus redes, y aquellos viviendo en paíes donde la conectividad a la Internet global es de calidad inconsistente, no confiable o cara. Fomenta y posibilita compartir contenido web entre usuaria(o)s, creando una red descentralizada de pares ayudándose entre sí.
fr: Ceno s’adresse à tous. Il est toutefois particulièrement utile pour les personnes qui s’intéressent à des contenus Web censurés sur leur réseau, et pour celles qui vivent dans des pays où la connectivité à l’internet mondial est irrégulière, peu fiable ou coûteuse. Il encourage et permet le partage de contenus Web entre utilisateurs, créant ainsi un réseau décentralisé de pairs qui s’entraident.
id: Ceno ditujukan untuk semua orang, tetapi aplikasi ini sangat nyaman dipakai oleh mereka yang tertarik dengan konten web yang disensor di jaringan mereka dan mereka yang tinggal di negara-negara di mana konektivitas ke internet global sangat buruk, tidak dapat diandalkan, atau mahal. Ceno mendorong dan memungkinkan berbagi konten web di antara para pengguna, menciptakan jaringan yang terdesentralisasi dari rekan-rekan yang saling membantu satu sama lain.
my: Ceno သည် လူတိုင်းအတွက် ဖြစ်သည်။ အထူးသဖြင့် အင်တာနက်ဆင်ဆာ ပိတ်ပင်ခြင်းခံရသည့် အကြောင်းအရာများကို ကြည့်ရှု အသုံးပြုလိုသူများ၊ ကမ္ဘာ့အင်တာနက်နှင့် ချိတ်ဆက်ရန် ဈေးကြီးပေးရသည့် (သို့) ကွန်နက်ရှင် မကောင်းသည့် နိုင်ငံများတွင် နေထိုင်သူများအတွက် ရည်ရွယ်ပါသည်။ Ceno က အသုံးပြုသူများအကြား အကြောင်းအရာများ မျှဝေခြင်းကို အားပေးပြီး အချင်းချင်းအကြား ချိတ်ဆက်ပံ့ပိုးသည့် ပုံစံဖြင့် ဗဟိုထိန်းချုပ်မှု မရှိသော နက်ဝေါ့ခ်ကို ဖန်တီးနိုင်ပါသည်။
pt: Ceno destina-se a todos, mas é particularmente conveniente para as pessoas interessadas em conteúdos Web que são censurados na sua rede, e para aqueles que vivem em países onde a conectividade à Internet global é manchada, não fiável ou dispendiosa. Encoraja e permite a partilha de conteúdos web entre utilizadores, criando uma rede descentralizada de pares que se ajudam uns aos outros.
pt_br: Ceno é feito para todas as pessoas, mas é particularmente conveniente para as interessadas em conteúdo Web que está censurado na sua rede e para aquelas habitando países onde a conectividade com a Internet global é errática, não confiável ou cara. Ele incentiva e permite o compartilhamento de conteúdo Web entre os usuários, criando uma rede descentralizada de pares que se ajudam mutuamente.
tr: Ceno herkes içindir ama özellikle kendi ağlarında sansürlenen internet içeriğine ilgi duyan ve küresel internet ile bağlantıları kesik, dengesiz veya pahalı olan ülkelerde yaşayanlar için oldukça uygun bir seçenektir. İnternet içeriğinin kullanıcılar arasında paylaşılmasını destekler ve sağlar. Böylece birbirine yardımcı olan eşlerin katkıları ile merkezi olmayan bir ağ oluşur.
uk: Ceno призначений для всіх, але особливо зручний для тих людей, чий мережевий вміст підпадає під цензуру в мережі, а також для тих, хто живе в країнах, де підключення до глобального Інтернету є нестабільним, ненадійним або дорогим. Браузер Ceno дозволяє користувачам ділитися мережевим вмістом між собою, створюючи децентралізовану мережу вузлів, що допомагають один одному.
ur: Ceno ہر ایک کے لیے ہے لیکن خاص طور پر ان لوگوں کے لیے آسان ہے جو ویب مواد میں دلچسپی رکھتے ہیں جو ان کے نیٹ ورک پر سنسر ہیں، اور وہ لوگ جو ان ممالک میں رہتے ہیں جہاں عالمی انٹرنیٹ سے رابطہ داغدار، ناقابل بھروسہ یا مہنگا ہے۔ یہ صارفین کے درمیان ویب مواد کے اشتراک کی حوصلہ افزائی اور قابل بناتا ہے، ایک دوسرے کی مدد کرنے والے ساتھیوں کا ایک غیر مرکزی نیٹ ورک بناتا ہے۔
zh_hans: 任何人都可使用Ceno，但它对下列人群来说尤为便利：有些人对在网络上遭审查的内容感兴趣；有些人所在的国家网络不稳定、不可靠或费用高昂。

source: You do not need to be an advanced computer user or even understand how peer-to-peer networks operate to use Ceno. The user experience is akin to operating a standard Web browser (Ceno-specific functionality is largely hidden under the hood).
ar: لا تحتاج إلى أن تكون مستخدما متقدما أو خبيرا بتقنيات المعلومات ولا أن تعرف كيفية عمل شبكات نظير لنظير لاستخدام Ceno. تشبه تجربة المستخدم تشغيل متصفح ويب عادي (إذ أن والآليات الخاصة بـ Ceno مخبأة بعيداً عن الأضواء).
de: Sie müssen keine besonderen Computer-Fähigkeiten besitzen oder wissen wie Peer-to-Peer-Netzwerke funktionieren um Ceno zu nutzen. Der benötigte Wissensstand gleicht dem welcher zur Nutzung eines Webbrowsers benötigt wird (Die Ceno spezifischen Funktionen sind zum Großteil versteckt).
es: No necesitas ser usuaria(o) avanzada(o) de computadoras, ni aún entender cómo las redes par a par operan para usar Ceno. La experiencia de usuaria(o) es similar a operar un navegador Web estándar (La funcionalidad específica de Ceno está bien escondida bajo el capó).
fr: Pas besoin d’être un utilisateur expert ou une utilisatrice experte en informatique ni même de comprendre le fonctionnement des réseaux pair à pair pour utiliser Ceno. L’expérience utilisateur ressemble à l’utilisation d’un navigateur Web habituel (la fonctionnalité propre à Ceno est en grande partie invisible).
id: Anda tidak perlu menjadi pengguna komputer tingkat lanjut atau bahkan memahami cara kerja jaringan klien ke klien untuk menggunakan Ceno. Pengalaman pengguna mirip dengan mengoperasikan peramban web standar (fungsionalitas khusus Ceno sebagian besar tersembunyi di balik layar).
my: Ceno ကို အသုံးပြုရန်အတွက် ကွန်ပျူတာ ကျွမ်းကျင်သူ ဖြစ်ရန်မလိုသကဲ့သို့ အသုံးပြုသူမှအသုံးပြုသူ အချင်းချင်းကြား ချိတ်ဆက်ပေး သည့် ကွန်ရက်များက Ceno ကို မည်သို့အသုံးပြုသည်ကို နားလည်ရန်လည်း မလိုအပ်ပါ။ Ceno ကို သာမန်ဝက်ဘ်ဘရောက်ဇာများ အသုံးပြုသကဲ့သို့ပင် သုံးနိုင်ပါသည် (Ceno တွင်သာရရှိနိုင်သည့် လုပ်ဆောင်ချက်များကို မသိမသာ ထည့်သွင်းထားပြီး ဖြစ်သည်)။
pt: Não é necessário ser um utilizador de computador avançado ou mesmo compreender como funcionam as redes peer-to-peer para utilizar o Ceno. A experiência do utilizador é semelhante à de operar um navegador da Web padrão (a funcionalidade específica do Ceno está largamente escondida debaixo da capota).
pt_br: Você não precisa ser um usuário de computador avançado ou mesmo entender como redes P2P operam para usar o Ceno. A experiência do usuário é similar a operar um navegador Web comum (funcionalidades específicas do Ceno são em grande parte invisíveis).
tr: Ceno kullanmak için bir uzman bilgisayar kullanıcısı olmanız ya da eşler arası ağların nasıl çalıştığını anlamanız gerekmez. Kullanımı normal bir internet tarayıcısını kullanmaya benzer (Özel Ceno işlevleri genellikle arka planda gizlidir).
uk: Щоб використовувати Ceno, Вам не потрібно бути досвідченим користувачем чи розуміти принципи роботи однорангових мереж. З погляду користувача все працює практично так само, як і функціонування звичайного веб-браузера (специфічна для Ceno функціональність значною мірою прихована «під капотом»).
ur: آپ کو ایک جدید کمپیوٹر صارف بننے کی ضرورت نہیں ہے یا یہ بھی سمجھنے کی ضرورت نہیں ہے کہ Ceno کو استعمال کرنے کے لیے پیئر ٹو پیئر نیٹ ورک کس طرح کام کرتے ہیں۔ صارف کا تجربہ ایک معیاری ویب براؤزر چلانے کے مترادف ہے (Ceno مخصوص فعالیت زیادہ تر ہڈ کے نیچے چھپی ہوئی ہے)۔
zh_hans: 使用Ceno不必非得是高级的计算机用户，甚至不需要理解点对点网络如何运行。用户体验类似于使用标准的网络浏览器（Ceno独有的功能大部分已隐藏）。

source: Ceno can, however, generate more Internet traffic than your usual Web browser – since it needs to let other users know what Web content it is sharing to the network, and possibly deliver this content to those who request it. Ceno thus relies on moderately good in-country connectivity. We recommend using Ceno when connected to Wi-Fi not just to avoid exhausting mobile data limits (should you have them), but also to increase the chances of being able to deliver Web content to other users.
ar: لكن، يمكن ل Ceno أن يولد حركة مرور للبيانات على الإنترنت أكبر من متصفح الويب العادي - لأنه يحتاج إلى السماح للمستخدمين الآخرين بمعرفة محتوى الويب الذي يشاركه على الشبكة، وكذلك سيقوم بتسليم هذا المحتوى إلى من يطلبه. يعتمد Ceno بالتالي على جودة الاتصال داخل البلد. نوصي باستخدام Ceno عند الاتصال بشبكة Wi-Fi لتجنب استنفاد بيانات الهاتف المحمول (إذا توفّرت)، وأيضًا لزيادة فرص إيصال محتوى الويب إلى مستخدمين آخرين.
de: Ceno wird vorraussichtlich mehr Internet-Verkehr als ihr gewöhnlicher Browser produzieren – da es die anderen Clienten darüber informiert welche Webinhalte es teilt, und diese Informationen bei Bedarf den anfordernden Clients zustellt. Daher Bedarf Ceno einer moderaten Inlandsverbindung. Wir empfehlen Ceno zu verwenden wenn sie mit WLAN-Netzwerken verbunden sind, nicht nur um eine Auslastung ihrer mobilen Datenlimits zu vermeiden (sollten welche haben), sondern auch um die Chancen zu erhöhen Webinhalte an andere Nutzer zu liefern.
es: Sin embargo, Ceno puede generar más tráfico de Internet que tu navegador Web usual – ya que necesita hacer conocer a otra(o)s usuaria(o)s qué contenido Web está compartiendo con la red, y posiblemente entregar este contenido a quienes lo soliciten. Por lo tanto Ceno confía en una conectividad dentro del país moderadamente buena. Recomendamos usar Ceno cuando te conectes a Wi-Fi, no solo para evitar agotar los límites de datos móviles (si los tuvieras), sino también para aumentar las chances de ser capaz de entregar contenido Web a otra(o)s usuaria(o)s.
fr: Ceno peut toutefois générer plus de trafic Internet que votre navigateur Web habituel, puisqu’il doit informer les autres utilisateurs du contenu Web qu’il partage sur le réseau, et éventuellement fournir ce contenu à ceux et celles qui le demandent. Ceno dépend donc d’une assez bonne connectivité à l’intérieur du pays. Nous vous recommandons d’utiliser Ceno connecté au Wi-Fi, non seulement pour éviter d’épuiser les limites de données mobiles (si vous en avez), mais aussi pour augmenter les chances de fournir du contenu Web à d’autres utilisateurs.
my: သို့ရာတွင် Ceno သည် နက်ဝေါ့ခ် တွင် မျှဝေထားသည့် ဝက်ဘ်အကြောင်းအရာများကို အခြားအသုံးပြုသူများအား အသိပေးခြင်း နှင့် အသုံးပြုသူထံသို့ အကြောင်းအရာများ ပေးပို့ရသည့် အတွက် အခြား သာမန် ဝက်ဘ်ဘရောက်ဇာများထက် အင်တာနက် လမ်းကြောင်း ပိတ်ဆို့မှုကို ပိုမိုဖြစ်စေတတ်ပါသည်။ ထို့ကြောင့် အင်တာနက် ချိတ်ဆက်မှု အနေအထား အတော်အသင့် ကောင်းရန် လိုအပ်သည်။ မိုဘိုင်း ဒေတာဖြင့် သုံးခြင်းထက် ဝိုင်ဖိုင်ချိတ်၍ သုံးရန် အကြံပြုပါသည်။ သို့မှသာ အင်တာနက် ဒေတာ အကုန်သက်သာပြီး မိမိ ချိတ်ဆက်ထားသော ဝက်ဘ် အကြောင်းအရာများကို အခြားသူများကို မျှဝေနိုင်မည် ဖြစ်သည်။
pt: Ceno pode, no entanto, gerar mais tráfego na Internet do que o seu navegador habitual - uma vez que precisa de informar os outros utilizadores do conteúdo da Web que está a partilhar na rede, e possivelmente entregar este conteúdo a quem o solicitar. Ceno depende assim de uma conectividade moderadamente boa no país. Recomendamos a utilização de Ceno quando ligado a Wi-Fi não só para evitar esgotar os limites de dados móveis (caso os tenha), mas também para aumentar as hipóteses de poder fornecer conteúdo Web a outros utilizadores.
pt_br: Ceno pode, contudo, gerar mais tráfego na Internet que o seu navegador Web usual - pois ele precisa deixar outros usuários saberem qual conteúdo Web está compartilhando com a rede e possivelmente entregar esse conteúdo para aqueles que o solicitam. Desse modo, o Ceno depende de conectividade moderadamente boa dentro do país. Recomendamos usar o Ceno quando houver conexão WiFi, não só para evitar atingir os limites de uso de dados móveis (caso os tenha), como para aumentar as chances de conseguir entregar conteúdo Web para outros usuários.
tr: Ancak Ceno, diğer kullanıcılara ağda paylaştığı internet içeriğini bildirmek ve bu içeriğe erişmek isteyenlere iletme gereksinimi duyduğundan normal internet tarayıcınızdan daha fazla internet trafiği oluşturabilir. Bu nedenle Ceno ortalama bir ülke içi internet bağlantısı kalitesine gerek duyar. Mobil veri sınırlarınızı aşmamak ve diğer kullanıcılara internet içerikleri sunabilme şansını artırmak için Ceno uygulamasını kablosuz ağa bağlıyken kullanmanızı öneririz.
uk: Однак, Ceno може споживати більше Інтернет-трафіку, ніж звичайний веб-браузер, оскільки він повинен повідомляти іншим користувачам, який мережевий вміст розповсюджує, і, можливо, доставляти цей вміст тим, хто запитує. Таким чином, Ceno покладається на доволі стабільне зʼєднання всередині країни. Ми радимо використовувати Ceno через Wi-Fi не лише для того, щоб уникнути витрати мобільного трафіку (якщо Ваш трафік обмежений), але й для збільшення шансів доставити мережевий вміст іншим користувачам.
ur: تاہم، Ceno آپ کے معمول کے ویب براؤزر سے زیادہ انٹرنیٹ ٹریفک پیدا کر سکتا ہے – کیونکہ اسے دوسرے صارفین کو یہ بتانے کی ضرورت ہے کہ وہ نیٹ ورک پر کون سا ویب مواد شیئر کر رہا ہے، اور ممکنہ طور پر یہ مواد ان لوگوں تک پہنچا سکتا ہے جو اس کی درخواست کرتے ہیں۔ Ceno اس طرح ملک کے اندر اعتدال پسند اچھے رابطے پر انحصار کرتا ہے۔ ہم وائی فائی سے منسلک ہونے پر Ceno استعمال کرنے کی تجویز کرتے ہیں نہ صرف موبائل ڈیٹا کی حد کو ختم کرنے سے بچنے کے لیے (اگر آپ کے پاس ہونا چاہیے)، بلکہ دوسرے صارفین تک ویب مواد فراہم کرنے کے امکانات کو بڑھانے کے لیے۔
zh_hans: 然而，Ceno将会比你的普通网络浏览器产生更多的互联网流量——因为它需要让其他用户知道它正在向网络分享哪些网络内容，并可能将这些内容传递给那些请求它的人。因此，Ceno依靠的是适度良好的国内连接。我们建议在连接到Wi-Fi时使用Ceno，这不仅是为了避免耗尽移动数据限制（如果你的移动数据有限制），也是为了增加能够向其他用户提供网络内容的机会。

source: **Warning:** *Ceno is not an anonymity tool.* In fact, using Ceno may allow others to know whether you have accessed or are sharing certain Web content. Please take careful consideration of which risks you can assume by using this tool. See the sections on [public vs. private browsing](../concepts/public-private.md) and [risks](../concepts/risks.md) for further information.
de: ** Warnung:** *Ceno ist kein Programm das der Anonymisierung dient.* In Wahrheit ist es sogar so, das Ceno anderen die Möglichkeit geben könnte herauszufinden, ob sie eine oder welche Webseite sie besucht oder geteilt haben. Bitte überlegen sie sich daher genau ob und welche Risiken sie bereit sind auf sich zu nehmen. Sehen sie hierzu die Sektionen [Öffentlich vs. Private Browsing] (../concepts/public-private.md) und [Risiken] (../concepts/risks.md) für weitere Informationen.
es: **Advertencia:** *Ceno no es una herramienta de anonimato.* De hecho, usar Ceno podría permitirle a otra(o)s conocer si has accedido o estás compartiendo cierto contenido Web. Por favor toma una cuidadosa consideración de los riesgos que puedes asumir al usar esta herramienta. Mira las secciones sobre [navegación pública vs. privada](../concepts/public-private.md) y [riesgos](../concepts/risks.md) para mayor información.
fr: **Avertissement:** *Ceno n’est pas un outil d’anonymisation.* En fait, utiliser Ceno peut permettre à d’autres personnes de savoir si vous avez accédé à certains contenus Web ou si vous les partagez. Évaluez soigneusement les risques que vous pouvez accepter en utilisant cet outil. Consultez les sections sur [la navigation publique comparée à la navigation privée](../concepts/public-privé.md) et les [risques](../concepts/risques.md) pour plus de précisions.
id: **Peringatan:** *Ceno bukanlah alat anonimitas.* Bahkan, menggunakan Ceno memungkinkan orang lain untuk mengetahui apakah Anda telah mengakses atau membagikan konten web tertentu. Mohon pertimbangkan dengan cermat risiko apa yang dapat Anda tanggung dengan menggunakan alat ini. Lihat bagian [penjelajahan publik vs. privat](../konsep/publik-privat.md) dan [risiko](../konsep/risks.md) untuk informasi lebih lanjut.
my: **သတိပြုရန်-** *Ceno သည် ကိုယ်ရေးလျှို့ဝှက်ပေးသည့် နည်းပညာ မဟုတ်ပါ။* ထိုမျှမက Ceno အသုံးပြုခြင်းက သင်ဝင်ရောက်ထားထားသော (သို့မဟုတ်) မျှဝေထားသည့် ဝက်ဘ်အကြောင်းအရာများကို အခြားသူများကိုပါ သိရှိစေနိုင်သည်။ ဤအချက်ကို သတိပြုပြီး မှ အသုံးပြုရန် သင့်/မသင့် ကို ဆုံးဖြတ်ပါ။ ပိုမိုသိရှိလိုလျှင် [အများသုံး နှင့် ပုဂ္ဂလိက အင်တာနက် ဘရောက်ဇင်း](../concepts/public-private.md) များအကြောင်း နှင့် [အန္တရာယ်များ](../concepts/risks.md) နှိုင်းယှဉ် ရေးသားထားသည့် အပိုင်းတွင် ဖတ်ရှုပါ။
pt: **Aviso:** *Ceno não é uma ferramenta de anonimato.* De facto, a utilização do Ceno pode permitir que outros saibam se você acedeu ou está a partilhar certos conteúdos da Web. Por favor, tenha cuidadosamente em consideração quais os riscos que pode assumir utilizando esta ferramenta. Ver as secções sobre [navegação pública vs. privada](.../conceitos/público-privado.md) e [riscos](.../conceitos/riscos.md) para mais informações.
pt_br: **Aviso:** *Ceno não é uma ferramenta de anonimato.* Na verdade, usar o Ceno pode permitir que outras pessoas saibam se você acessou ou está compartilhando determinado conteúdo Web. Por favor, tenha bastante cautela ao considerar os riscos que você pode assumir ao usar essa ferramenta. Veja as seções sobre [navegação pública versus navegação privativa](../concepts/public-private.md) e [riscos](../concepts/risks.md) para mais informações.
tr: **Uyarı:** Ceno bir anonimlik aracı değildir. Ceno kullandığınızda, başkaları belirli internet içeriklerine erişip erişmediğinizi veya paylaşıp paylaşmadığınızı öğrenebilir. Bu aracı kullanarak üstlenebileceğiniz tehlikeleri dikkatli bir şekilde değerlendirin. Ayrıntılı bilgi almak için [herkese açık ve gizli gezinme karşılaştırması](../concepts/public-private.md) ile [tehlikeler](../concepts/risks.md) bölümlerine bakabilirsiniz.
uk: **Увага:** *Ceno не є засобом анонімності.* Фактично, використання Ceno може дозволити іншим дізнатися, чи Ви переглядали певний мережевий вміст, чи поширюєте його. Будь ласка, уважно вивчіть, які ризики Ви берете на себе, використовуючи цей інструмент. Для отримання додаткової інформації – ознайомтеся з розділами [публічний та приватний перегляд сторінок](../concepts/public-private.md) і [ризики](../concepts/risks.md).
ur: **انتباہ:** *Ceno گمنامی کا ٹول نہیں ہے۔* درحقیقت، Ceno کا استعمال دوسروں کو یہ جاننے کی اجازت دے سکتا ہے کہ آیا آپ نے کچھ ویب مواد تک رسائی حاصل کی ہے یا شیئر کر رہے ہیں۔ براہ کرم احتیاط سے غور کریں کہ آپ اس ٹول کو استعمال کرتے ہوئے کن خطرات کو لے سکتے ہیں۔ مزید معلومات کے لیے [عوامی بمقابلہ نجی براؤزنگ](../concepts/public-private.md) اور [خطرات](../concepts/risks.md) پر سیکشن دیکھیں۔
zh_hans: **警告：** *Ceno并非匿名工具。* 事实上，使用Ceno会让他人了解你是否获取或正在分享某些网络内容。请谨慎考虑使用本工具您会承担何种风险。更多信息，请参见[public vs. private browsing][公开浏览 vs. 私密浏览](../concepts/public-private.md) and [risks][风险](../concepts/risks.md)。

source: [P2P]: https://en.wikipedia.org/wiki/Peer-to-peer
ar: [نظير لنظير P2P]: https://ar.wikipedia.org/wiki/%D9%86%D8%AF_%D9%84%D9%86%D8%AF
de: [P2P]: https://de.wikipedia.org/wiki/Peer-to-peer
es: [P2P]: https://es.wikipedia.org/wiki/Peer-to-peer
fr: [Pair à pair] : https://fr.wikipedia.org/wiki/Pair-%C3%A0-pair
id: [P2P]: https://id.wikipedia.org/wiki/Peer-to-peer
pt_br: [P2P]: https://pt.wikipedia.org/wiki/Peer-to-peer
ru: [P2P]: https://ru.wikipedia.org/wiki/%D0%9E%D0%B4%D0%BD%D0%BE%D1%80%D0%B0%D0%BD%D0%B3%D0%BE%D0%B2%D0%B0%D1%8F_%D1%81%D0%B5%D1%82%D1%8C
tr: [P2P]: https://tr.wikipedia.org/wiki/Peer-to-peer
uk: [P2P]: https://uk.wikipedia.org/wiki/Peer-to-peer

source: [national intranets]: https://en.wikipedia.org/wiki/National_intranet
ar: [إنترانت وطني]: https://ar.wikipedia.org/wiki/%D8%A7%D9%84%D8%A5%D9%86%D8%AA%D8%B1%D9%86%D8%AA_%D8%A7%D9%84%D9%82%D9%88%D9%85%D9%8A
es: [intranets nacionales]: https://es.wikipedia.org/wiki/Intranet_nacional
fr: [intranets nationaux] : https://en.wikipedia.org/wiki/National_intranet
id: [intranet nasional]: https://id.wikipedia.org/wiki/Intranet_nasional
my: [နိုင်ငံတွင်းသုံး အင်ထရာနက်]: https://en.wikipedia.org/wiki/National_intranet
pt_br: [intranets nacionais]: https://pt.wikipedia.org/wiki/Intranet_nacional
tr: [Ulusal intranetler]: https://en.wikipedia.org/wiki/National_intranet
ur: [قومی انٹرانیٹ]: https://en.wikipedia.org/wiki/National_intranet

source: [Firefox for Android]: https://www.mozilla.org/firefox/android/
ar: [فايرفوكس لأندرويد]: https://www.mozilla.org/firefox/android/
de: [Firefox für Android]: https://www.mozilla.org/firefox/android/
es: [Firefox para Android]: https://www.mozilla.org/es-ES/firefox/mobile/
fr: [Firefox pour Android] : https://www.mozilla.org/fr/firefox/browsers/mobile/android/
id: [Firefox untuk Android]: https://www.mozilla.org/firefox/android/
my: [Android အတွက် Firefox]: https://www.mozilla.org/firefox/android/
pt: [Firefox para Android]: https://www.mozilla.org/firefox/android/
pt_br: [Firefox para Android]: https://www.mozilla.org/firefox/android/
ru: [Firefox для Android]: https://www.mozilla.org/firefox/android/
tr: [Android için Firefox]: https://www.mozilla.org/tr/firefox/android/
uk: [Firefox для Android]: https://www.mozilla.org/firefox/android/

source: [Universal Declaration of Human Rights]: https://www.un.org/en/universal-declaration-human-rights/
ar: [الإعلان العالمي لحقوق الإنسان]: https://www.un.org/ar/about-us/universal-declaration-of-human-rights
de: [Allgemeine Erklärung der Menschenrechte]: https://www.un.org/en/universal-declaration-human-rights/
es: [Declaración Universal de Derechos Humanos]: https://www.un.org/es/about-us/universal-declaration-of-human-rights
fr: [Déclaration universelle de droits de la personne] : https://www.un.org/fr/about-us/universal-declaration-of-human-rights
id: [Deklarasi Universal Hak Asasi Manusia]: https://www.un.org/en/universal-declaration-human-rights/
my: [အပြည်ပြည်ဆိုင်ရာ လူ့အခွင့်အရေး ကြေညာစာတမ်း]: https://www.un.org/en/universal-declaration-human-rights/
pt: [Declaração Universal dos Direitos do Homem]: https://www.un.org/en/universal-declaration-human-rights/
pt_br: [Declaração Universal dos Direitos Humanos]: https://www.un.org/en/universal-declaration-human-rights/
ru: [Universal Declaration of Human Rights]: https://www.un.org/ru/about-us/universal-declaration-of-human-rights
tr: [İnsan hakları evrensel bildirgesi]: https://www.un.org/en/universal-declaration-human-rights/
ur: [انسانی حقوق کا عالمی اعلامیہ]: https://www.un.org/en/universal-declaration-human-rights/

source: [Ceno-repos]: https://github.com/censorship-no/
es: [ceno-repos]: https://gitlab.com/censorship-no/
tr: [ceno depoları]: https://gitlab.com/censorship-no/
uk: [ceno-repos]: https://gitlab.com/censorship-no/
