Repository: censorship-no/ceno-docs
Catalog: user-manual/*/intro/ceno.po
Languages: ar, de, es, fa, fr, id, my, pt, pt_br, ru, tr, uk, ur, zh_hans

source: The *Censorship.no!* project is run by [eQualitie][eQualitie] in support of Articles 18, 19 and 20 of the [Universal Declaration of Human Rights][Universal Declaration of Human Rights]. Ceno and related technologies are developed as Free/Libre/Open Source software ([project source](https://gitlab.com/censorship-no/ "Ceno source code repositories")), allowing anyone to use, study, share and enhance it. Please contact [cenoers@equalitie.org](mailto:cenoers@equalitie.org) in case of doubt or for further information.
ar: يتم إدارة مشروع *Censorship.no!* بواسطة [eQualitie][eQualitie] دعما للمواد 18 و 19 و 20 من [الإعلان العالمي لحقوق الإنسان] [الإعلان العالمي لحقوق الإنسان]. تم تطوير Ceno والتقنيات ذات الصلة كبرنامج مجاني و حر و مفتوح المصدر ([مصدر المشروع](https://gitlab.com/censorship-no/ "Ceno source code repositories"))، مما يسمح لأي شخص باستخدامه ودراسته ومشاركته وتحسينه. يرجى الاتصال بـ [cenoers@equalitie.org](mailto:cenoers@equalitie.org) في حالة الشك أو لمزيد من المعلومات.
de: Das *Censorship.no!* Projekt wird betrieben von [eQualitie] zur Unterstützung der Artikel 18,19 und 20 der [Allgemeinen Erklärung der Menschenrechte]. Ceno und damit zusammenhängende Technologien sind Freie/Libre/Open Source Software ([project source](https://gitlab.com/censorship-no/ "Ceno source code repositories")), welche es jedem erlauben sie zu nutzen, erlernen, teilen oder erweiteren. Bitte um Kontaktaufnahme [cenoers@equalitie.org](mailto:cenoers@equalitie.org) bei Zweifeln oder bei Bedarf an mehr Informationen.
fr: Le projet *Censorship.no!* est géré par [eQualitie][eQualitie] pour soutenir les articles 18, 19 et 20 de la [Déclaration universelle des droits de la personne][Déclaration universelle des droits la personne]. Ceno et les technologies connexes sont développés en tant que logiciels libres et à code source ouvert ([source du projet](https://gitlab.com/censorship-no/ "Dépôts du code source de Ceno source")), ce qui permet à quiconque de les utiliser, les examiner, les partager et les améliorer. En cas de doute ou pour de plus amples renseignements, contactez par courriel [cenoers@equalitie.org](mailto:cenoers@equalitie.org).
id: Proyek *Censorship.no!* dijalankan oleh [eQualitie][eQualitie] untuk mendukung Pasal 18, 19, dan 20 dari [Deklarasi Universal Hak Asasi Manusia][Deklarasi Universal Hak Asasi Manusia]. Ceno dan teknologi terkait dikembangkan sebagai perangkat lunak Bebas/Gratis/Sumber Terbuka ([sumber proyek](https://gitlab.com/censorship-no/ "Repositori kode sumber Ceno")), yang memungkinkan siapa pun untuk menggunakan, mempelajari, berbagi, dan meningkatkannya. Silakan hubungi [cenoers@equalitie.org](mailto:cenoers@equalitie.org) jika ada keraguan atau untuk informasi lebih lanjut.
my: *Censorship.no!* ပရောဂျက်ကို အပြည်ပြည်ဆိုင်ရာ လူ့အခွင့်အရေး ကြေညာစာတမ်း [အပြည်ပြည်ဆိုင်ရာ လူ့အခွင့်အရေး ကြေညာစာတမ်း][အပြည်ပြည်ဆိုင်ရာ လူ့အခွင့်အရေး ကြေညာစာတမ်း]၊ အပိုဒ် ၁၈၊ ၁၉ နှင့် ၂၀ တို့နှင့်အညီ [eQualitie][eQualitie] မှ တာဝန်ယူ လည်ပတ်ပါသည်။ Ceno နှင့် ဆက်စပ် နည်းပညာများကို အခမဲ့ ပွင့်လင်းအရင်းအမြစ် ဆော့ဖ်ဝဲအဖြစ် တည်ဆောက် ရေးသားထားပြီး ([စီမံကိန်း အရင်းအမြစ်](https://gitlab.com/censorship-no/ "Ceno အရင်းအမြစ်ကုဒ် သိုလှောင်ရုံများ")) မည်သူမဆို လေ့လာခြင်း၊ အသုံးပြုခြင်း၊ ပိုကောင်းအောင် ပြင်ဆင်ခြင်းနှင့် မျှဝေခြင်းတို့ လုပ်ဆောင်နိုင်ပါသည်။ တစ်စုံတစ်ရာ သံသယရှိပါက သို့မဟုတ် အချက်အလက်များကို ပိုမိုသိရှိလိုပါက [cenoers@equalitie.org](mailto:cenoers@equalitie.org) သို့ ဆက်သွယ်ပါ။
uk: Проєкт *Censorship.no!* керується компанією [eQualitie][eQualitie] на підтримку статей 18, 19 та 20 [Загальної декларації прав людини][Universal Declaration of Human Rights]. Ceno та повʼязані з ним технології розроблені як безкоштовне програмне забезпечення з відкритим вихідним кодом ([вихідний код проєкту](https://gitlab.com/censorship-no/ "Ceno source code repositories")), що дозволяє будь-кому використовувати, вивчати, поширювати та покращувати цей код. Звʼяжіться з нами за адресою [cenoers@equalitie.org](mailto:cenoers@equalitie.org), якщо у Вас є сумніви чи потрібна додаткова інформація.
zh_hans: Censorship.no!项目由eQualitie运营，捍卫《世界人权宣言》第十八条、第十九条和第二十条。Ceno及其相关技术均作为源代码软件开发 ([项目源](https://gitlab.com/censorship-no/ "Ceno source code repositories"))，允许任何人使用、学习、分享和改进。如有疑问或想了解更多，请联系cenoers@equalitie.org。

source: [eQualitie]: https://equalit.ie/
fr: [eQualitie]: https://equalit.ie/fr/

source: [ceno-repos]: https://gitlab.com/censorship-no/
de: [ceno-repos]: https://github.com/censorship-no/
my: [ceno-repos]: https://github.com/censorship-no/

source: Ceno can, however, generate more Internet traffic than your usual Web browser â€“ since it needs to let other users know what Web content it is sharing to the network, and possibly deliver this content to those who request it. Ceno thus relies on moderately good in-country connectivity. We recommend using Ceno when connected to Wi-Fi not just to avoid exhausting mobile data limits (should you have them), but also to increase the chances of being able to deliver Web content to other users.
id: Namun, Ceno dapat menghasilkan lebih banyak lalu lintas internet daripada peramban web biasa - karena Ceno perlu memberitahukan kepada pengguna lain tentang konten web yang dibagikannya ke jaringan dan mungkin mengirimkan konten ini kepada mereka yang memintanya. Oleh karena itu, Ceno mengandalkan konektivitas dalam negeri yang cukup baik. Kami menyarankan untuk menggunakan Ceno ketika terhubung ke Wi-Fi. Tidak hanya untuk menghindari kuota data seluler yang melelahkan (jika Anda memilikinya), tetapi juga untuk meningkatkan peluang untuk mengirimkan konten web ke pengguna lainnya.

source: [Censorship.no!]: https://censorship.no/
pt: [Censura.não!]: https://censorship.no/

source: What is the CENO Browser?
fa: مرورگر سنو چیست؟
ru: Что такое Браузер CENO?

source: CENO (short for [Censorship.no!][Censorship.no!]) is a Web browser for mobile Android devices (such as smartphones and tablets) that uses a novel approach to circumvent Internet censorship and share retrieved content among all users in a [peer-to-peer][P2P] (P2P) fashion. This reduces overall reliance on international network exchanges, and allows frequently requested Web content to persist in the network even during heavy filtering and throttling events.
fa: سنو (مخفف [Censorship.no!](https://censorship.no) یا «سانسور نه!») یک مرورگر وب برای دستگاه‌های همراه اندروید (همچون تلفن‌های همراه هوشمند و تبلت‌ها) است که رویکردی نو را برای دورزدن سانسور اینترنت به کار می‌گیرد و محتوای بازیابی‌شده را در میان تمام کاربران به سیاقی [همتا-به-همتا یا P2P](https://en.wikipedia.org/wiki/Peer-to-peer) به اشتراک می‌گذارد. این روش روی‌هم‌رفته از وابستگی به مبادلات بین‌المللی شبکه‌ای می‌کاهد، و اجازه می‌دهد محتوای پرطرفدار و مورد درخواست مکرر افراد حتی در صورت فیلترینگ شدید و رویدادهای سرکوب‌گرانه در شبکه باقی بماند.
ru: CENO (сокращенно от [Censorship.no!][Censorship.no!]) — это веб-браузер для мобильных устройств Android (таких, как смартфоны и планшеты), который использует новый способ обхода интернет-цензуры и обмена загружаемым контентом среди всех пользователей в [пиринговой][P2P] (P2P) сети. Это снижает общую зависимость от международных централизованных серверов и позволяет часто запрашиваемому веб-контенту сохраняться в сети даже во время жесткой фильтрации и регулирования.

source: What sets CENO apart from most other circumvention initiatives is that users can continue to share Web content even when no (or extremely limited) connectivity exists across national borders. CENO is thus built in anticipation of aggressive Internet filtering and the establishment of [national intranets][national intranets] to fence off nations from the Web.
fa: آنچه CENO را از اغلب روش‌های دیگر دور زدن سانسور جدا می‌کند این است که کاربران می‌توانند به‌اشتراک‌گذاری محتوای وب را ادامه دهند، حتی وقتی دیگر هیچ اتصالی داخل مرزهای ملی وجود ندارد (یا اتصال بسیار محدود است). بنابراین، سنو برای مقابله با فیلترینگ شدید اینترنت و برقراری [اینترانت‌های ملی][national intranets] به‌منظور محدودکردن دسترسی ملت‌ها به وب ساخته شده است.
ru: CENO отличается от большинства других решений по обходу цензуры тем, что пользователи могут продолжать обмениваться веб-контентом даже при отсутствии (или крайне ограниченном наличии) подключения через национальные границы. Таким образом, CENO разработан с расчетом на жесткую фильтрацию интернета и развернутые [национальные внутренние сети][national intranets], ограждающие внешний интернет.

source: The CENO Browser is built on an adapted version of [Firefox for Android][Firefox for Android], a popular, modern, feature-rich and secure Free/Libre/Open Source browser. CENO extends Firefox with **Ouinet**, the underlying technology allowing it to share content between devices (described in later sections).
fa: مرورگر CENO بر اساس نسخه‌ای برگرفته از [فایرفاکس برای اندروید](https://www.mozilla.org/firefox/android) ساخته شده است، که یک مرورگر رایگان/آزاد/متن‌باز پرطرفدار، مدرن، سرشار از امکانات و امن است. سنو فایرفاکس را با **Ouinet** گسترش می‌دهد، فناوری زیربنایی که به آن اجازه می‌دهد تا بین دستگاه‌ها محتوا به اشتراک بگذارد (در بخش‌های بعدی این فرایند را توضیح می‌دهیم).
ru: Браузер CENO основан на адаптированной версии [Firefox для Android][Firefox для Android], популярного, современного, многофункционального и безопасного браузера с открытым исходным кодом. CENO расширяет Firefox с помощью **Ouinet**, базовой технологии, позволяющей обмениваться контентом между устройствами (описано в следующих разделах).

source: Who develops CENO?
fa: چه‌کسی CENO را توسعه می‌دهد؟
ru: Кем разрабатывается CENO?

source: The *Censorship.no!* project is run by [eQualitie][eQualitie] in support of Articles 18, 19 and 20 of the [Universal Declaration of Human Rights][Universal Declaration of Human Rights]. CENO and related technologies are developed as Free/Libre/Open Source software ([project source](https://github.com/censorship-no/ "CENO source code repositories")), allowing anyone to use, study, share and enhance it. Please contact [cenoers@equalit.ie](mailto:cenoers@equalit.ie) in case of doubt or for further information.
fa: پروژه‌ی *Censorship.no!* توسط [eQualitie][eQualitie] در پشتیبانی از بندهای ۱۸، ۱۹ و ۲۰ از [اعلامیه‌ی جهانی حقوق بشر][Universal Declaration of Human Rights] اداره می‌شود. CENO و فناوری‌های مرتبط با آن به‌عنوان نرم‌افزار رایگان/آزاد/متن‌باز توسعه یافته‌اند ([منبع پروژه](https://github.com/censorship-no/ "CENO source code repositories"))، و به هر کسی اجازه می‌دهد تا از آن استفاده کند، آن را مطالعه کند، به اشتراک گذارد و تقویت‌اش کند. اگر تردیدی دارید یا به اطلاعات بیشتری نیاز دارید لطفاً با نشانی [cenoers@equalit.ie](mailto:cenoers@equalit.ie) تماس بگیرید.
ru: Проект *Censorship.no!* управляется компанией [eQualitie][eQualitie] в поддержку статей 18, 19 и 20 [Всеобщей декларации прав человека][Universal Declaration of Human Rights]. CENO и связанные с ним технологии разработаны как бесплатное программное обеспечение с открытым исходным кодом ([исходный код проекта](https://github.com/censorship-no/ "CENO source code repositories")), что позволяет кому угодно использовать, изучать, распространять и улучшать его. Свяжитесь с нами по адресу [cenoers@equalit.ie](mailto: cenoers@equalit.ie), если у вас есть сомнения или нужна дополнительная информация.

source: CENO is meant for everyone but is particularly convenient for people interested in Web content that is censored on their network, and those those living in countries where connectivity to the global Internet is spotty, unreliable or expensive. It encourages and enables the sharing of web content among users, creating a decentralized network of peers helping each other.
fa: مرورگر CENO برای همه است اما به‌خصوص برای کسانی مناسب است که به محتوایی در وب علاقه دارند که روی شبکه‌شان سانسور شده است، و کسانی که در کشورهایی زندگی می‌کنند که اتصال به اینترنت جهانی ناهموار، نامطمئن یا گران‌قیمت است. این نرم‌افزار به‌اشتراک‌گذاری محتوای وب بین کاربران را تشویق و امکان‌پذیر می‌کند، و شبکه‌ای مرکززدوده از همتایانی می‌آفریند که به یکدیگر کمک می‌کنند.
ru: CENO предназначен для всех, но особенно удобен людям, интересующимся веб-контентом, который подвергается цензуре в их сети, а также для тех, кто живет в странах, где подключение к глобальному интернету является нестабильным, ненадежным или дорогим. Он позволяет делиться веб-контентом между пользователями, создавая децентрализованную сеть узлов, помогающих друг другу.

source: **Warning:** *CENO is not an anonymity tool.* In fact, using CENO may allow others to know whether you have accessed or are sharing certain Web content. Please take careful consideration of which risks you can assume by using this tool. See the sections on [public vs. private browsing](../concepts/public-private.md) and [risks](../concepts/risks.md) for further information.
fa: **هشدار:** *CENO یک ابزار گمنامی نیست.* در واقع، استفاده از CENO می‌تواند به دیگران اجازه دهد به این پی برند که آیا شما به محتوای خاصی در وب دسترسی داشته‌اید یا آن را به اشتراک می‌گذارید. لطفاً به خطرات احتمالی استفاده از این ابزار دقت کنید و در این مورد مراقب باشید. برای اطلاعات بیشتر بخش‌های مربوط به [مقایسه‌ی مرور عمومی و خصوصی](../concepts/public-private.md) و [خطرات](../concepts/risks.md) را ببینید.
ru: **Внимание:** *CENO не является анонимайзером.* Фактически, использование CENO может позволить другим узнать, запрашивали ли вы (и распространяете ли вы) определенный веб-контент. Пожалуйста, внимательно изучите, какие риски вы принимаете на себя, используя этот инструмент. Для получения дополнительной информации ознакомьтесь с разделами [публичный и приватный просмотр страниц](../concepts/public-private.md) и [риски](../concepts/risks.md).

source: You do not need to be an advanced computer user or even understand how peer-to-peer networks operate to use CENO. The user experience is akin to operating a standard Web browser (CENO-specific functionality is largely hidden under the hood).
fa: برای استفاده از CENO نیازی نیست حتماً یک کاربر پیشرفته‌ی رایانه باشید یا حتی چگونگی کارکرد شبکه‌های همتا-به-همتا را بفهمید. تجربه‌ی کاربر همانند کاربرد یک مرورگر وب استاندارد است (کارکردهای ويژه‌ی سنو عمدتاً پنهان‌اند).

source: CENO can, however, generate more Internet traffic than your usual Web browser – since it needs to let other users know what Web content it is sharing to the network, and possibly deliver this content to those who request it. CENO thus relies on moderately good in-country connectivity. We recommend using CENO when connected to Wi-Fi not just to avoid exhausting mobile data limits (should you have them), but also to increase the chances of being able to deliver Web content to other users.
fa: مرورگر CENO می‌تواند، با این حال، ترافیک اینترنتی بیشتری از مرورگر وب معمول‌تان تولید کند - چون لازم است کاربران دیگر را مطلع کند که چه محتوایی در وب را روی شبکه به اشتراک می‌گذارد، و در صورت امکان این محتوا را در دسترس کسانی قرار دهد که آن را درخواست می‌کنند. از این جهت، CENO به اتصال به‌نسبت خوب داخل کشور وابسته است. ما استفاده از سنو را در هنگام اتصال به وای‌فای توصیه می‌کنیم، نه تنها برای جلوگیری از تمام‌شدن محدودیت داده‌ی موبایل (در صورتی که چنین محدودیتی داشته باشید)، بلکه همچنین برای افزایش شانس و توان رساندن محتوای وب به کاربران دیگر.
