Repository: censorship-no/ceno-docs
Catalog: user-manual/*/intro/ceno.po
Languages: ar, de, es, fa, fr, id, my, pt, pt_br, ru, tr, uk, ur, zh_hans

source: What is Ceno Browser?
ar: ما هو متصفح Ceno؟
de: Was ist Ceno Browser?
es: ¿Qué es el Navegador Ceno?
fr: Qu’est-ce que le Navigateur Ceno ?
id: Apa itu Browser Ceno?
my: Ceno ဘရောက်ဇာ ဆိုတာဘာလဲ။
pt: O que é o Ceno Browser?
pt_br: O que é o Navegador Ceno?
tr: Ceno Browser nedir?
uk: Що таке браузер Ceno?
ur: Ceno براؤزر کیا ہے؟
zh_hans: Ceno浏览器是什么？

source: Ceno (short for [Censorship.no!][Censorship.no!]) is a Web browser for mobile Android devices (such as smartphones and tablets) that uses a novel approach to circumvent Internet censorship and share retrieved content among all users in a [peer-to-peer][P2P] (P2P) fashion. This reduces overall reliance on international network exchanges, and allows frequently requested Web content to persist in the network even during heavy filtering and throttling events.
ar: Ceno (اختصار لـ [Censorship.no!][Censorship.no!]) هو متصفح ويب لأجهزة أندرويد Android المحمولة (مثل الهواتف الذكية والأجهزة اللوحية) يستخدم أسلوبًا جديدًا للتحايل والالتفاف على رقابة الإنترنت وحجب محتوى الويب عبر مشاركة المحتوى المسترد بين جميع المستخدمين باستخدام طريقة [نظير لنظير][P2P] (P2P). تقلل هذه التقنية من الاعتماد الكلي على مبدلات الشبكة الدولية، ويسمح لمحتوى الويب المطلوب بشكل متكرر أن يكون متوفرا في الشبكة حتى في حالات استخدام التصفية وخنق عرض الحزمة.
de: Ceno (kurz für [Censorship][.no]!) ist ein Web Browser für Android-Geräte (wie Smartphones und Tablets) der eine neuartige Methode verwendet um Internet-Zensur zu umgehen und erhaltene Inhalte mit allen anderen Nutzern auf dem [peer-to-peer][P2P] (P2P) Wege zu teilen. Dies reduziert die allgemeine Abhängigkeit von internationalen Netzwerk-Verteilern und ermöglicht es Webinhalte selbst beim Aufkommen starker Filterung oder Drosselung aufrechtzuerhalten.
es: Ceno (abreviatura de [Censorship.no!][Censorship.no!]) es un navegador Web para dispositivos Android móviles (tales como teléfonos inteligentes y tablets) que usa un enfoque novedoso para eludir la censura en Internet y compartir contenido descargado entre toda(o)s la(o)s usuaria(o)s de manera [par a par][P2P] (P2P). Esto reduce la dependencia general en intercambios de red internacionales, y permite que el contenido Web frecuentemente solicitado persista en la red aún durante eventos de filtrado masivo y reducción forzada de ancho de banda.
fr: Ceno (abréviation de [Censorship.no !][Censorship.no !]) est un navigateur Web pour les appareils mobiles Android (tels que les téléphones intelligents et les tablettes) qui utilise une approche novatrice pour contourner la censure sur Internet et partager le contenu récupéré de [pair à pair][Pair à pair] entre tous les utilisateurs. Cela réduit la dépendance globale aux services internationaux d’échange Internet et permet au contenu Web très demandé de persister dans le réseau, même en cas de filtrage et d’étranglement importants.
id: Ceno (kependekan dari [Censorship.no!][Censorship.no!]) adalah peramban web untuk perangkat seluler Android (seperti ponsel cerdas dan tablet) yang menggunakan pendekatan baru untuk menghindari sensor internet dan berbagi konten yang diambil di antara semua pengguna dalam mode [klien ke klien][P2P] (P2P). Hal ini dapat mengurangi ketergantungan keseluruhan pada pertukaran jaringan internasional dan memungkinkan konten web yang sering diminta dapat tersedia di jaringan bahkan selama adanya penyaringan dan pelambatan yang berat.
my: Ceno ( [Censorship.no!][Censorship.no!] ၏ အတိုကောက် အခေါ်အဝေါ် ) ဆိုသည်မှာ (စမတ်ဖုန်း နှင့် တက်ဘလက် တို့ကဲ့သို့) မိုဘိုင်း Android နည်းပညာသုံး စက်ပစ္စည်းများတွင် အသုံးပြု နိုင်သည့် ဝက်ဘ်ဘရောက်ဇာဖြစ်သည်။ ၎င်းကို အင်တာနက်ဆင်ဆာပိတ်ဆို့မှုကို ကျော်လွှားရန်နှင့် ဆင်ဆာဖြတ်ထားသည့် အကြောင်းအရာများကို အသုံးပြုသူများအကြား အချင်းချင်းဖြန့်ဝေနိုင်ရန်အတွက် ဆန်းသစ်သောနည်းလမ်း [အသုံးပြုသူထံမှ အသုံးပြုသူ][P2P] (P2P) ဖြင့် ဖန်တီးထားပါသည်။ ဤဘရောက်ဇာက နိုင်ငံတကာ နက်ဝေါ့ခ်များ အပေါ် မှီခိုအသုံးပြုရခြင်းကို လျော့ချပေးပြီးပိတ်ဆို့မှုများရှိနေသည့်တိုင် လူကြည့်များသည့် အကြောင်းအရာများကို နက်ဝေါ့ခ်အတွင်း ကြာရှည်စွာ တည်ရှိနေစေရန် လုပ်ဆောင်ပေးသည်။
pt: Ceno (abreviatura de [Censorship.no!][Censorship.no!]) é um navegador Web para dispositivos Android móveis (tais como smartphones e tablets) que utiliza uma nova abordagem para contornar a censura da Internet e partilhar conteúdos recuperados entre todos os utilizadores de uma forma [peer-to-peer][P2P] (P2P). Isto reduz a dependência geral nas trocas de redes internacionais, e permite que o conteúdo da Web frequentemente solicitado persista na rede, mesmo durante eventos pesados de filtragem e estrangulamento.
pt_br: Ceno (abreviação para [Censorship.no!][Censorship.no!]) é um navegador Web para dispositivos Android (tais como smartphones e tablets) que usa uma nova abordagem para contornar a censura na Internet e compartilhar conteúdo recuperado entre todos os usuários em estilo [par-a-par][P2P] (P2P). Isso reduz a dependência generalizada nas trocas da rede internacional e permite que conteúdo Web frequentemente requisitado persista na rede mesmo durante eventos massivos de filtragem e limitação.
tr: Ceno ([Censhorship.no!][Censhorship.no!]'nun kısaltması) Android için internet sansürünü aşmak ve diğer kullanıcılarla [eşler arası][P2P] (P2P) bağlantıyla erişilen içeriği paylaşmak için yeni bir yaklaşım sunan bir internet tarayıcısıdır. Böylece uluslararası bağlantılara duyulan gereksinim azalır, yoğun kısıtlama ve hız sınırlaması durumlarında bile sıkça erişilen internet içeriği ağ üzerinde tutulur.
uk: Ceno (скорочено від [Censorship.no!][Censorship.no!]) – це веб-браузер для мобільних пристроїв Android (як-от смартфонів і планшетів), який використовує новий спосіб обходу Інтернет-цензури та обміну завантаженим вмістом серед усіх користувачів в [одноранговій][P2P] (P2P) мережі. Це знижує загальну залежність від міжнародних централізованих серверів і дозволяє часто запитуваному мережевому вмісту, зберігатися в мережі навіть під час жорсткої фільтрації та регулювання.
ur: Ceno (مختصر برائے [Censorship.no!][Censorship.no!]) موبائل اینڈرائیڈ ڈیوائسز (جیسے اسمارٹ فونز اور ٹیبلٹس) کے لیے ایک ویب براؤزر ہے جو انٹرنیٹ سنسرشپ کو روکنے اور بازیافت شدہ مواد کو تمام صارفین کے درمیان شیئر کرنے کے لیے ایک نیا طریقہ [پیئر ٹو پیئر][P2P] (P2P) فیشن استعمال کرتا ہے۔ یہ بین الاقوامی نیٹ ورک کے تبادلے پر انحصار کو کم کرتا ہے، اور اکثر درخواست کردہ ویب مواد کو بھاری فلٹرنگ اور تھروٹلنگ واقعات کے دوران بھی نیٹ ورک میں برقرار رہنے کی اجازت دیتا ہے۔
zh_hans: Ceno（[Censorship.no!][Censorship.no!]的简称）是一个用于移动安卓设备（如智能手机和平板电脑）的网络浏览器，它使用一种新颖的方法来规避互联网审查制度，并以[点对点][P2P]（P2P）的方式在所有用户中分享获取的内容。这减少了对国际网络交换的总体依赖，并允许经常请求的网络内容在网络中持续存在，即使在严重的过滤和限流事件中也是如此。

source: What sets Ceno apart from most other circumvention initiatives is that users can continue to share Web content even when no (or extremely limited) connectivity exists across national borders. Ceno is thus built in anticipation of aggressive Internet filtering and the establishment of [national intranets][national intranets] to fence off nations from the Web.
ar: ما يميز Ceno عن معظم مبادرات التحايل على الرقابة والحجب الأخرى هو أنه يمكّن المستخدمين من الاستمرار في مشاركة محتوى الويب حتى في حالة عدم وجود اتصال (أو اتصال محدود للغاية) عبر الحدود الوطنية. تم بناء Ceno تحسبًا لحالات تصفية الإنترنت العدوانية وحالات إنشاء [أنترانت وطني ][إنترانت وطني] لاستبعاد محتوى الويب القادم من دول أخرى عن الشبكة الوطنية.
de: Was Ceno von den meisten anderen Initiativen zur Umgehung von Zensur im Internet unterscheidet ist, dass Nutzer selbst dann noch dazu in der Lage sind Inhalte zu teilen wenn keine (oder sehr eingeschränkte) Verbindung über Landesgrenzen hinaus besteht. Ceno wurde erstellt um der aggressiven Internet-Filterung und dem Aufbauen von Nationalen-Intranets entgegen zu halten, welche dazu dienen Nationen von dem Internet auszuschließen.
es: Lo que diferencia a Ceno de la mayoría de las otras iniciativas de elusión es que la(o)s usuaria(o)s pueden continuar compartiendo contenido Web aún cuando no exista conectividad (o esté extremadamente limitada) a través de las fronteras nacionales. Por lo tanto, Ceno está construido en anticipación al filtrado agresivo de Internet y el establecimiento de [intranets nacionales][intranets nacionales] para excluir a naciones de la Web.
fr: Ce qui distingue Ceno de la plupart des autres initiatives de contournement, c’est que les utilisateurs peuvent continuer à partager du contenu Web même si la connectivité est inexistante (ou extrêmement limitée) par-delà les frontières nationales. Ceno est donc conçu en prévision du filtrage agressif d’internet et de la mise en place d’[intranets nationaux][intranets nationaux] pour isoler les nations du Web.
id: Apa yang membedakan Ceno dari kebanyakan inisiatif pengelabuan lainnya adalah pengguna dapat terus berbagi konten web bahkan ketika tidak ada (atau sangat terbatas) konektivitas yang tersedia melintasi batas-batas negara. Dengan demikian, Ceno dibangun untuk mengantisipasi penyaringan internet yang agresif dan pembentukan [intranet nasional] [intranet nasional] untuk memagari negara-negara dari web.
my: Ceno နှင့် အခြား အင်တာနက် ဆင်ဆာပိတ်ဆို့မှုကို ကျော်လွှားသည့်နည်းလမ်းများ အကြား မတူညီသည့် အချက်တစ်ခုမှာ Ceno ကို အသုံးပြုသူများသည် နိုင်ငံတကာဖြတ်ကျော် ချိတ်ဆက်မှုများ လုံးဝမရှိသည့်တိုင် (အလွန်အမင်း ကန့်သတ်မှုများ ရှိသည့်တိုင်) ဝက်ဘ်ပေါ် မှ အကြောင်းအရာများကို အချင်းချင်းကြား မျှဝေနိုင်ခြင်း ဖြစ်သည်။ အင်တာနက် ဆင်ဆာပိတ်ဆို့မှုကို ပြင်းပြင်းထန်ထန် လုပ်သည့်နိုင်ငံများ၊ အင်တာနက်အသုံးပြုမှုကို [နိုင်ငံတွင်းသုံး အင်ထရာနက်][နိုင်ငံတွင်းသုံး အင်ထရာနက်] ကန့်သတ်ထားသည့် နိုင်ငံများတွင်ပင် Ceno ကို အသုံးပြုနိုင်ရန် ပုံစံချ တည်ဆောက် ထားပါသည်။
pt: O que distingue o Ceno da maioria das outras iniciativas de evasão é que os utilizadores podem continuar a partilhar conteúdos Web mesmo quando não existe (ou existe uma conectividade extremamente limitada) através das fronteiras nacionais. O Ceno é assim construído em antecipação à filtragem agressiva da Internet e ao estabelecimento de [intranets nacionais][intranets nacionais] para vedar as nações da Web.
pt_br: O que diferencia o Ceno da maioria das outras iniciativas de contorno é que os usuários podem continuar a compartilhar conteúdo Web mesmo quando não há conectividade (ou ela está extremamente limitada) ao longo das fronteiras nacionais. Ceno foi, assim, desenvolvido em antecipação às filtragens agressivas da Internet e ao estabelecimento de [intranets nacionais][intranets nacionais] para deixar nações de fora da Web.
tr: Ceno'yu diğer sansür aşma yöntemlerinden farklı kılan şey, uluslararası internet bağlantısı olmadığında (ya da aşırı şekilde kısıtlandığında) bile kullanıcıların internet içeriğini paylaşmasını sağlayabilmesidir. Ceno saldırgan internet kısıtlamaları ve [ulusal intranetlerin][national intranets] kurulması ile internet üzerinde kendine duvar ören ülkeler öngörülerek tasarlanmıştır.
uk: Ceno відрізняється від більшості інших рішень щодо обходу цензури тим, що користувачі можуть продовжувати обмінюватися мережевим вмістом навіть за відсутності (або вкрай обмеженої наявності) підключення через національні кордони. Таким чином, Ceno розроблено з розрахунком на жорстку фільтрацію Інтернету та розгорнуті [національні внутрішні мережі][national intranets], що відгороджують націю від зовнішнього Інтернету.
ur: جو چیز Ceno کو زیادہ تر دیگر دھوکہ دہی کے اقدامات سے الگ کرتی ہے وہ یہ ہے کہ صارف ویب مواد کا اشتراک جاری رکھ سکتے ہیں یہاں تک کہ جب قومی سرحدوں پر کوئی (یا انتہائی محدود) رابطہ موجود نہ ہو۔ اس طرح Ceno جارحانہ انٹرنیٹ فلٹرنگ اور قوموں کو ویب سے دور کرنے کے لیے [قومی انٹرانیٹ][national intranets] کے قیام کی توقع میں بنایا گیا ہے۔
zh_hans: Ceno与其他大多数规避措施的不同之处在于，即使在没有（或极其有限的）跨国界连接的情况下，用户也可以继续分享网络内容。因此，Ceno的建立，是预计到了积极的互联网过滤和建立[国家内部网][国家内部网]以将国家与互联网隔离开的情况。

source: Ceno Browser is built on an adapted version of [Firefox for Android][Firefox for Android], a popular, modern, feature-rich and secure Free/Libre/Open Source browser. Ceno extends Firefox with **Ouinet**, the underlying technology allowing it to share content between devices (described in later sections).
ar: تم بناء متصفح Ceno باستعمال نسخة معدلة من [فايرفوكس لأندرويد] [فايرفوكس لأندرويد]، وهو متصفح شهير وحديث وغني بالمميزات وآمن ومجاني وحر ومفتوح المصدر. تعمل Ceno على تمديد إمكانيات فايرفوكس Firefox باستخدام **Ouinet**، وهي التقنية التي تسمح للمتصفح بمشاركة المحتوى بين الأجهزة (التقنية موضحّة في أقسام لاحقة).
de: Ceno Browser wurde aus einer adaptierten Version von Firefox, einem bekannten, modernem, sicherem Open Source Browser mit großen Funktionsumfang erstellt. Ceno erweitert Firefox um **Ouinet**, welches die Funktionen zum Teilen von Inhalten zwischen Geräten mitbringt (Beschrieben in den folgenden Sektionen).
es: El Navegador Ceno está basado en una versión adaptada de [Firefox para Android][Firefox para Android], un navegador popular, moderno, rico en características y seguro Gratis/Libre/de Código Abierto. Ceno extiende Firefox con **Ouinet**, la tecnología subyacente que permite compartir el contenido entre los dispositivos (descrita en secciones posteriores).
fr: Le navigateur Ceno est construit sur une version adaptée de [Firefox pour Android][Firefox pour Android], un navigateur libre et à code source ouvert populaire, moderne, riche en fonctions et sécurisé. Ceno augmente les capacités de Firefox avec **Ouinet**, la technologie sous-jacente qui lui permet de partager du contenu entre appareils (décrite dans les sections suivantes).
id: Peramban Ceno dibangun di atas versi adaptasi dari [Firefox untuk Android], peramban bebas/terbuka yang populer, modern, kaya fitur, dan aman. Ceno memperluas Firefox dengan **Ouinet**, teknologi dasar yang memungkinkannya untuk berbagi konten antar perangkat (dijelaskan di bagian selanjutnya).
my: Ceno ဘရောက်ဇာကို [Android အတွက် Firefox] ကို ပြုပြင်၍ တည်ဆောက်ထားခြင်း ဖြစ်သည်။ [Android အတွက် Firefox] သည် ခေတ်မီ၍ လူကြိုက်များပြီး လုံခြုံမှုရှိသော အခမဲ့ open source ဘရောက်ဇာ ဖြစ်သည်။ Ceno ကို စက်ပစ္စည်းများအကြား အကြောင်းအရာများ မျှဝေရာတွင် အသုံးပြုသည့် နည်းပညာ ဖြစ်သည့် **Ouinet** နည်းပညာ (နောက်အပိုင်းများ တွင် ရှင်းလင်းချက်ပါဝင်) သုံး၍ Firefox ၏ အဆက်အဖြစ် ချိတ်ဆက်ထားပါသည်။
pt: Ceno Browser é construído sobre uma versão adaptada de [Firefox para Android][Firefox para Android], um popular, moderno, rico em funcionalidades e seguro navegador Free/Libre/Open Source. Ceno alarga o Firefox com **Ouinet**, a tecnologia subjacente que lhe permite partilhar conteúdos entre dispositivos (descrita em secções posteriores).
pt_br: O Navegador Ceno é construído em uma versão adaptada do [Firefox para Android][Firefox para Android], um navegador gratuito, livre e de código aberto popular, moderno, rico em funcionalidades e seguro. Ceno estende o Firefox com a **Ouinet**, a tecnologia subjacente que permite ao navegador compartilhar conteúdo entre dispositivos (descrito nas próximas seções).
tr: Ceno Browser, yaygın, modern, zengin özellikleri bulunan, güvenli, özgür ve açık kaynaklı [Android için Firefox][Firefox for Android] uygulamasının değiştirilmiş bir sürümü üzerine geliştirilmiştir. Ceno, Firefox tarayıcısını, içeriklerin aygıtlar arasında paylaşılmasını sağlayan (sonraki bölümlerde açıklanacak) **Ouinet** teknolojisi ile zenginleştirir.
uk: Браузер Ceno заснований на адаптованій версії [Firefox для Android][Firefox для Android] – популярного сучасного, багатофункціонального та безпечного браузера з відкритим вихідним кодом. Ceno розширює Firefox за допомогою технології **Ouinet**, що дозволяє обмінюватись вмістом між пристроями (описано в наступних розділах).
ur: Ceno براؤزر [فائر فاکس برائے اینڈرائیڈ][Firefox for Android] کے موافقت پذیر ورژن پر بنایا گیا ہے، جو ایک مقبول، جدید، خصوصیت سے بھرپور اور محفوظ مفت/لائبر/اوپن سورس براؤزر ہے۔ Ceno Firefox کو **Ouinet** کے ساتھ توسیع کرتا ہے، یہ بنیادی ٹیکنالوجی اسے ڈیوائسز کے درمیان مواد کا اشتراک کرنے کی اجازت دیتی ہے (بعد کے حصوں میں بیان کیا گیا ہے)۔
zh_hans: Ceno浏览器是建立在[Firefox for Android][Firefox for Android]的改编版本上的，这是一个流行的、现代的、功能丰富的、安全的自由/开放源码浏览器。Ceno用**Ouinet**扩展了Firefox，该底层技术使其能够在设备之间共享内容（在后面的章节中描述）。

source: Who develops Ceno?
ar: من يطور Ceno؟
de: Wer entwickelt Ceno?
es: ¿Quién desarrolla Ceno?
fr: Qui développe Ceno ?
id: Siapa yang mengembangkan Ceno?
my: Ceno ကို ဘယ်သူတွေ ရေးသားတည်ဆောက် ထားသလဲ။
pt: Quem desenvolve o Ceno?
pt_br: Quem desenvolve o Ceno?
tr: Ceno'yu kim geliştiriyor?
uk: Ким розробляється Ceno?
ur: Ceno کون تیار کرتا ہے؟
zh_hans: Ceno是谁开发的？

source: The *Censorship.no!* project is run by [eQualitie][eQualitie] in support of Articles 18, 19 and 20 of the [Universal Declaration of Human Rights][Universal Declaration of Human Rights]. Ceno and related technologies are developed as Free/Libre/Open Source software ([project source](https://github.com/censorship-no/ "Ceno source code repositories")), allowing anyone to use, study, share and enhance it. Please contact [cenoers@equalitie.org](mailto:cenoers@equalitie.org) in case of doubt or for further information.
es: El proyecto *Censorship.no!* es administrado por [eQualitie][eQualitie], en soporte de los Artículos 18, 19 y 20 de la [Declaración Universal de Derechos Humanos][Declaración Universal de Derechos Humanos]. Ceno y las tecnologías relacionadas son desarrolladas como software Gratis/Libre/de Código Abierto ([fuente del proyecto](https://gitlab.com/censorship-no/ "repositorios del código fuente de Ceno")), permitiéndole a cualquiera usarlo, estudiarlo, compartirlo y expandirlo. Por favor contacta a [cenoers@equalitie.org](mailto:cenoers@equalitie.org) en caso de duda o para mayor información.
tr: *Censorship.no!* projesi, [eQualitie][eQualitie] tarafından [İnsan hakları evrensel bildirgesi][Universal Declaration of Human Rights] 18, 19 ve 20. maddelerine destek vermek amacıyla yürütülmektedir. Ceno ve ilgili teknolojiler, herkesin kullanabileceği, inceleyebileceği, paylaşabileceği ve geliştirebileceği özgür/açık kaynaklı yazılım olarak ([projenin kaynağı](https://gitlab.com/censorship-no/ "Ceno kaynak kodu depoları")) geliştirilmektedir. Herhangi bir şüpheniz varsa ya da ayrıntılı bilgi almak için [cenoers@equalitie.org](mailto:cenoers@equalitie.org) adresinden bize ulaşabilirsiniz.
uk: Проєкт *Censorship.no!* керується компанією [eQualitie][eQualitie] на підтримку статей 18, 19 та 20 [Загальної декларації прав людини][Universal Declaration of Human Rights]. Ceno та повʼязані з ним технології розроблені як безкоштовне програмне забезпечення з відкритим вихідним кодом ([вихідний код проєкту](https://gitlab.com/censorship-no/ "Ceno source code repositories")), що дозволяє будь-кому використовувати, вивчати, поширювати та покращувати цей код. Звʼяжіться з нами за адресою [cenoers@equalitie.org](mailto:cenoers@equalitie.org), якщо у Вас є сумніви чи потрібна додаткова інформація.
ur: *Censorship.no!* پروجیکٹ [eQualitie][eQualitie] کے ذریعے [انسانی حقوق کے عالمی اعلامیہ] [Universal Declaration of Human Rights] کے آرٹیکل 18، 19 اور 20 کی حمایت میں چلایا جاتا ہے۔ Ceno اور متعلقہ ٹیکنالوجیز کو بطور مفت / لیبر / اوپن سورس سافٹ ویئر ([منصوبے کا ذریعہ](https://github.com/censorship-no/ "Ceno سورس کوڈ ریپوزٹریز")) کے طور پر تیار کیا گیا ہے، جو کسی کو بھی استعمال کرنے، مطالعہ کرنے، اشتراک کرنے اور اسے بڑھانا. شک کی صورت میں یا مزید معلومات کے لیے براہ کرم [cenoers@equalitie.org](mailto:cenoers@equalitie.org) سے رابطہ کریں۔

source: Who is it for?
ar: لمن يصلح Ouinet؟
de: Für wen ist es?
es: ¿Para quién es?
fa: Ouinet برای چه کسانی است؟
fr: À qui s’adresse Ouinet ?
id: Aplikasi ini untuk siapa?
my: ဘယ်သူ့အတွက်လဲ။
pt: A quem se destina?
pt_br: É feito para quem?
ru: Для кого он предназначен?
tr: Kimler içindir?
uk: Для кого це?
ur: یہ کس کے لیے ہے؟
zh_hans: Ceno的目标用户
