Repository: censorship-no/ceno-docs
Catalog: user-manual/*/intro/faq.po
Languages: ar, de, es, fa, fr, id, my, pt_br, ru, tr, uk, ur

source: Mobile connections often make reaching your device more difficult from the outside than Wi-Fi ones, thus decreasing the chances that you can help other users get content.
ar: غالبا ما تجعل اتصال الجوال الوصول إلى جهازك أكثر صعوبة من الخارج مقارنة مع اتصال Wi-Fi، مما يقلل من فرص مساعدة المستخدمين الآخرين في الحصول على المحتوى.
de: Bei mobilen Verbindungen ist es oft schwieriger, Ihr Gerät von außen zu erreichen als bei Wi-Fi-Verbindungen, wodurch die Chancen sinken, dass Sie anderen Nutzern helfen können, Inhalte zu erhalten.
es: Las conexiones móviles a menudo hacen que alcanzar a tu dispositivo sea más dificultoso desde fuera que las Wi-Fi, disminuyendo por lo tanto las oportunidades de que puedas ayudar a otros usuarios a obtener contenido.
fa: اتصال‌های موبایل نسبت به وای‌فای اغلب دسترسی به دستگاه‌تان از بیرون را سخت‌تر می‌کنند، و بنابراین از شانس کمک‌تان به کاربران دیگر برای گرفتن محتوا می‌کاهند.
fr: Comparées aux connexions Wi-Fi, les connexions mobiles rendent souvent l’accès à votre appareil plus difficile de l’extérieur, ce qui réduit vos chances de pouvoir aider les autres utilisateurs et utilisatrices à obtenir du contenu.
id: Koneksi seluler sering kali membuat perangkat Anda lebih sulit dijangkau dari luar daripada koneksi Wi-Fi, sehingga mengurangi peluang Anda untuk membantu pengguna lain dalam mendapatkan konten.
my: ဝိုင်ဖိုင်ချိတ်ဆက်မှုထက် မိုဘိုင်းချိတ်ဆက်မှုတွင် ပြင်ပမှ သင့်စက်သို့ ရောက်ရှိနိုင်ရန် ပိုမိုခက်ခဲတတ်သောကြောင့် အခြားအသုံးပြုသူများကို အကြောင်းအရာများရရှိအောင် ကူညီနိုင်သော အခွင့်အလမ်းများ ကျဆင်းစေပါသည်။
pt_br: As conexões móveis geralmente dificultam o alcance do seu dispositivo a partir do exterior do que as conexões WiFi. Assim, há uma diminuição das chances de você poder ajudar outros usuários a obter conteúdo.
ru: При мобильном подключении к интернету добраться до вашего устройства извне будет намного сложнее, чем при Wi-Fi, что снижает вероятность того, что вы сможете помочь другим пользователям получить контент.
tr: Aygıtınız mobil veri kullanırken, kablosuz bağlantılara göre dışarıdan daha az bağlantı kurulabilir. Bu da başkalarının içeriğe erişimesine yardım etme şansınızı azaltır.
uk: При мобільному підключенні, з'єднатися з вашим пристроєм ззовні буде набагато складніше, ніж при підключенні до Wi-Fi, що знижує можливість того, що ви зможете допомогти іншим користувачам отримати контент.
ur: موبائل کنکشن اکثر وائی فائی کی نسبت آپ کے ڈیوائس تک باہر سے پہنچنا زیادہ مشکل بنا دیتے ہیں، اس طرح یہ امکانات کم ہو جاتے ہیں کہ آپ دوسرے صارفین کو مواد حاصل کرنے میں مدد کر سکتے ہیں۔

source: Can CENO Browser replace my current browser (Chrome/Firefox/Safari)?
es: ¿El Navegador CENO puede reemplazar a mi navegador actual (Chrome/Firefox/Safari)?
ur: کیا CENO براؤزر میرے موجودہ براؤزر (Chrome/Firefox/Safari) کی جگہ لے سکتا ہے؟

source: Since CENO is based on Mozilla Firefox for Android, it provides all the features that are expected from a modern browser. However, its reliance on Ouinet technology for retrieving web content may affect its operation in subtle ways (some of them potentially involving your privacy).
es: Ya que CENO está basado en Mozilla Firefox para Android, provee todas las características que son esperadas de un navegador moderno. Sin embargo, su dependencia en la tecnología Ouinet para descargar contenido web podría afectar a su operación de maneras sutiles (algunas de ellas involucrando potencialmente a tu privacidad).
fa: از آن‌جا که سنو بر اساس موزیلا فایرفاکس برای اندروید ساخته شده است، تمام ویژگی‌های مورد انتظار از یک مرورگر امروزی را فراهم می‌آورد. با این حال، اتکای این مرورگر به فناوری وینت برای بازیابی محتوای وب می‌تواند بر عملکردش به طرز ظریفی اثر بگذارد (که گاه ممکن است به‌طور بالقوه به حریم خصوصی شما نیز ربط پیدا کند).
my: CENO သည် Mozilla Firefox for Android ကို အခြေခံသည့်အတွက် ၎င်းသည် ခေတ်မီ ဘရောက်ဇာတစ်ခုထံမှ မျှော်လင့်နိုင်သော လုပ်ဆောင်ချက်အားလုံးဖြင့် ပံ့ပိုးသည်။ သို့သော် ဝက်ဘ်အကြောင်းအရာကို ပြန်ထုတ်ရန် Ouinet နည်းပညာပေါ် ၎င်း၏ မှီခိုမှုက ၎င်း၏ လုပ်ဆောင်ချက်အပေါ် မသိမသာ အကျိုးသက်ရောက်မှု ရှိနိုင်သည် (၎င်းတို့ထဲမှ အချို့တွင် သင့်ကိုယ်ရေးလုံခြုံမှု ပါဝင်ပတ်သက်နိုင်သည်)။
ru: Поскольку CENO основан на базе Mozilla Firefox для Android, он предоставляет все функции, которые должны присутствовать в современном браузере. В то же время, его зависимость от технологии Ouinet для получения веб-контента может повлиять на его работу в тонких аспектах (некоторые из них могут повлиять на вашу конфиденциальность).
uk: Оскільки CENO заснований на базі Mozilla Firefox для Android, він надає всі функції, які ви очікуєте від сучасного браузера. Однак, його залежність від технології Ouinet для отримання веб-контенту може вплинути на його роботу незначним чином (деякі з них потенційно можуть вплинути на вашу конфіденційність).
ur: چونکہ CENO اینڈرائیڈ کے لیے Mozilla Firefox پر مبنی ہے، اس لیے یہ وہ تمام خصوصیات فراہم کرتا ہے جن کی ایک جدید براؤزر سے توقع کی جاتی ہے۔ تاہم، ویب مواد کی بازیافت کے لیے Ouinet ٹیکنالوجی پر اس کا انحصار اس کے کام کو ٹھیک طریقوں سے متاثر کر سکتا ہے (ان میں سے کچھ ممکنہ طور پر آپ کی رازداری میں شامل ہیں)۔

source: Also, since CENO and Ouinet are under continuous development, you may experience some instability. That may also mean that backwards-incompatible changes are introduced which require you to uninstall the application or remove stored data (including bookmarks and site settings) before upgrading.
es: Y también, ya que CENO y Ouinet están bajo desarrollo contínuo, podrías experimentar alguna inestabilidad. Eso podría significar también que sean introducidos cambios incompatibles con versiones anteriores, los cuales requerirían que desinstales la aplicación o remuevas los datos almacenados (incluyendo marcadores y configuraciones de sitios) antes de actualizar.
my: ထို့ပြင် CENO နှင့် Ouinet ကို တီထွင်ဖန်တီးဆဲ ဖြစ်သည့်အတွက် သင်သည် မတည်ငြိမ်မှုအချို့ကို ခံစားရနိုင်သည်။ ယင်းသည် အဆင့်မမြှင့်မီ သင့်အနေနှင့် အက်ပလီကေးရှင်းကို ဖျက်ရန် သို့မဟုတ် (စာမှတ်များနှင့် ဆိုက်ဆက်တင်များ အပါအဝင်) သိုလှောင်ထားသော ဒေတာကို ဖယ်ရှားရန် လိုအပ်သည့် နောက်ပြန် ကိုက်ညီမှုမရှိသော အပြောင်းအလဲများကို မိတ်ဆက်ခြင်းလည်း ဖြစ်နိုင်သည်။
ru: Кроме того, поскольку CENO и Ouinet находятся в стадии постоянной разработки, вы можете столкнуться с некоторой нестабильностью. Это также может означать внесение обратно несовместимых изменений, которые потребуют от вас удаления приложения или удаления сохраненных данных (включая закладки и настройки сайта) перед обновлением.
uk: Крім того, оскільки CENO та Ouinet постійно розвиваються, ви можете зіткнутися з деякою нестабільністю. Це також може означати внесення несумісних змін, що вимагають від вас видалити програми або видалити збереженіі дані (включно з закладками та налаштуваннями сайту) перед оновленням.
ur: اس کے علاوہ، چونکہ CENO اور Ouinet مسلسل ترقی کے تحت ہیں، آپ کو کچھ عدم استحکام کا سامنا ہو سکتا ہے۔ اس کا مطلب یہ بھی ہو سکتا ہے کہ پیچھے کی طرف متضاد تبدیلیاں متعارف کرائی گئی ہیں جن کے لیے آپ کو اپ گریڈ کرنے سے پہلے ایپلیکیشن کو ان انسٹال کرنے یا ذخیرہ شدہ ڈیٹا (بشمول بُک مارکس اور سائٹ کی ترتیبات) کو ہٹانے کی ضرورت ہے۔

source: For important work on Web sites not subject to censorship, we recommend that you use your habitual Web browser instead of CENO. Please read the section on [risks](../concepts/risks.md) for more information.
es: Para trabajos importantes en sitios Web que no están sujetos a censura, recomendamos que uses tu navegador Web habitual en vez de CENO. Por favor lee la sección sobre [riesgos](../concepts/risks.md) para más información.
fa: برای انجام کارهای مهم روی وب‌سایت‌هایی که سانسور نشده‌اند، توصیه می‌کنیم به جای سنو از همان مرورگر وب عادی خودتان استفاده کنید. برای اطلاعات بیشتر لطفاً این بخش درباره‌ی [خطرات](../concepts/risks.md) را بخوانید.
my: ဆင်ဆာလုပ်ခြင်းနှင့် မသက်ဆိုင်သော ဝဘ်ဆိုက်များတွင် အရေးကြီးသော အလုပ်အတွက် သင့်အနေနှင့် CENO အစား သင်သုံးနေကျ ဝက်ဘ်ဘရောက်ဇာကို အသုံးပြုရန် ကျွန်ုပ်တို့က သင့်အား အကြံပြုပါသည်။ ကျေးဇူးပြု၍ နောက်ထပ် အချက်အလက်များအတွက် [စွန့်စားမှုများ](../concepts/risks.md) အပိုင်းကို ဖတ်ပါ။
ru: Для выполнения важной работы на сайтах, не подверженных цензуре, мы рекомендуем вам использовать привычный веб-браузер вместо CENO. Для получения дополнительной информации ознакомьтесь с разделом [риски](../concepts/risks.md).
uk: Для виконання важливої роботи на сайтах, що не піддаються цензурі, ми рекомендуємо вам використовувати звичайний веб-браузер замість CENO. Для отримання додаткової інформації перегляньте розділ [ризики](../concepts/risks.md).
ur: ویب سائٹس پر اہم کام کے لیے جو سینسرشپ کے تابع نہیں ہیں، ہم تجویز کرتے ہیں کہ آپ CENO کے بجائے اپنا عادتاً ویب براؤزر استعمال کریں۔ مزید معلومات کے لیے براہ کرم [خطرے](../concepts/risks.md) پر سیکشن پڑھیں۔

source: Can I use CENO Browser to access Twitter, Facebook and Gmail?
es: ¿Puedo usar al Navegador CENO para acceder a Twitter, Facebook y Gmail?
ur: کیا میں ٹویٹر، فیس بک اور جی میل تک رسائی کے لیے CENO براؤزر استعمال کر سکتا ہوں؟

source: Although CENO strives to provide a user experience as similar to normal Web browsing as possible, some of the techniques used to avoid network interference do not play well with such dynamic sites. This is the case with CENO's default mode of operation (i.e. public browsing), since it strips down all private data (like passwords and cookies) from Web traffic to ensure that it does not leak to other untrusted CENO or Ouinet users.
es: A pesar de que CENO se esfuerce en proveer una experiencia de usuario tan similar a la navegación Web normal como sea posible, algunas de las técnicas usadas para evitar interferencia de red no van bien con sitios de tal dinamismo. Este es el caso con el modo de operación por defecto de CENO (esto es, navegación pública), ya que remueve todos los datos privados (como contraseñas y cookies) del tráfico Web para asegurar que no se filtre a otros usuarios de CENO o Ouinet en quienes no se confía.
fa: اگرچه سنو می‌کوشد تا تجربه‌‌ای تا حد ممکن شبیه به مرور معمولی وب را برای کاربران فراهم کند، بعضی از تکنیک‌های به‌کاررفته برای جلوگیری از اختلال در شبکه با سایت‌های پویایی ازاین‌دست چندان سازگاری ندارند. این مسئله در مورد طرز عملکرد معمول سنو (یعنی مرور عمومی) صادق است، چون تمام داده‌های خصوصی (مانند رمزهای عبور و کوکی‌ها) را از ترافیک وب حذف می‌کند تا اطمینان حاصل شود که این اطلاعات به سایر کاربران غیرقابل‌اعتماد سنو یا وینت درز نکنند.
my: CENO သည် အသုံးပြုသူများကို ပုံမှန် ဝဘ်ဆိုက်အသုံးပြုခြင်းနှင့် အတတ်နိုင်ဆုံးတူညီသော အတွေ့အကြုံရအောင် ကြိုးပမ်းပေးထားသော်လည်း ကွန်ရက်နှောင့်ယှက်မှုကို ရှောင်ရှားရန် အသုံးပြုထားသော တချို့နည်းပညာများသည် အပြောင်းအလဲရှိသော ဝဘ်ဆိုက်တချို့တွင် ကောင်းစွာအလုပ်မလုပ်နိုင်ပါ။ ဤပြဿနာကို CENO ၏ ပုံသေအလုပ်လုပ်မှုပုံစံ (ဆိုလိုသည်မှာ - အများသုံးရှာဖွေခြင်း) တွင် ကြုံရတတ်သည်။ အကြောင်းရင်းမှာ ယုံကြည်စိတ်ချရမှုမရှိသော အခြား CENO (သို့) Ouinet အသုံးပြုသူများထံသို့ ကိုယ်ရေးကိုယ်တာအချက်အလက်များ ပေါက်ကြားမှုမရှိစေရန် (စကားဝှက်များနှင့် ကွတ်ကီးများကဲ့သို့) ကိုယ်ရေးဒေတာအားလုံးကို ဝက်ဘ်အသွားအလာမှ ဖယ်ရှားခဲ့သောကြောင့်ဖြစ်သည်။
ru: Хотя CENO и старается предоставить пользователю опыт, максимально похожий на обычный просмотр веб-страниц, некоторые из методов, используемых для преодоления цензуры и вмешательства в интернет-соединение, не совсем корректно работают с подобными динамическими сайтами. Это относится к режиму работы CENO по умолчанию (т.е. публичный просмотр), поскольку он удаляет все частные данные (такие как пароли и файлы cookie) из интернет-трафика, чтобы исключить их утечку другим пользователям CENO или Ouinet.
uk: Хоча CENO і намагається надати користувачеві досвід, максимально схожий на звичайний перегляд веб-сторінок, деякі методи, що використовуються для подолання цензури та втручання в інтернет-з'єднання, не зовсім коректно працюють з подібними динамічними сайтами. Це стосується режиму роботи CENO за замовчуванням (тобто публічного перегляду), оскільки він видаляє всі приватні дані (такі як паролі та cookies) з інтернет-трафіку, щоб виключити їхній витік іншим користувачам CENO або Ouinet.
ur: اگرچہ CENO صارف کو عام ویب براؤزنگ جیسا تجربہ فراہم کرنے کی کوشش کرتا ہے، لیکن نیٹ ورک کی مداخلت سے بچنے کے لیے استعمال کی جانے والی کچھ تکنیکیں ایسی متحرک سائٹس کے ساتھ اچھا نہیں چلتی ہیں۔ یہی معاملہ CENO کے آپریشن کے پہلے سے طے شدہ موڈ (یعنی عوامی براؤزنگ) کا ہے، کیونکہ یہ ویب ٹریفک سے تمام نجی ڈیٹا (جیسے پاس ورڈز اور کوکیز) کو ہٹا دیتا ہے تاکہ یہ یقینی بنایا جا سکے کہ یہ دوسرے غیر بھروسہ مند CENO یا Ouinet صارفین تک نہ پہنچ جائے۔

source: To avoid this and enable the use of such dynamic sites in CENO, you can use private tabs (i.e. private browsing), which leave private data intact and keep connections to the sites encrypted and thus protected from everyone else. However, this requires that network traffic from your device can reach those websites in some way.
es: Para evitar esto y habilitar el uso de sitios de tal dinamismo en CENO, puedes usar pestañas privadas (esto es, navegación privada), las cuales dejan a los datos privados intactos y mantienen las conexiones a los sitios cifradas, y por lo tanto protegidas de todos los demás. Sin embargo, esto requiere que el tráfico de red desde tu dispositivo pueda alcanzar a esos sitios web de alguna manera.
fa: برای جلوگیری از این رویداد و ایجاد امکان استفاده از این‌گونه سایت‌های پویا در سنو، شما می‌توانید از زبانه‌های خصوصی (یعنی همان مرور خصوصی) استفاده کنید، که داده‌های خصوصی را دست‌نخورده باقی می‌گذارد و ارتباط‌های رمزگذاری‌شده و بنابراین محفوظ از هرکس دیگر را با این سایت‌ها حفظ می‌کند. با این حال، این نیازمند آن است که ترافیک شبکه از دستگاه شما بتواند به طریقی به آن وب‌سایت‌ها دسترسی پیدا کند.
my: ဤအဖြစ်ကို ရှောင်ရှားပြီး အပြောင်းအလဲရှိသော ဝဘ်ဆိုက်များကို CENO တွင် အသုံးပြုလိုပါက သီးသန့်တပ်ဗ်များ (ဆိုလိုသည်မှာ - သီးသန့်ရှာဖွေခြင်း) ကို အသုံးပြုပါ။ သီးသန့်တက်ဗ်များသည် ကိုယ်ရေးကိုယ်တာအချက်အလက်များကို မထိခိုက်စေဘဲ ဝဘ်ဆိုက်များနှင့်ဆက်သွယ်မှုကို ကုဒ်ဖြင့်ပြောင်းလဲ၍ အခြားလူများမှ ကာကွယ်ပေးသည်။ သို့သော် သင့်စက်မှ ကွန်ရက်အသွားအလာသည် ထိုဝဘ်ဆိုက်များသို့ တစ်နည်းနည်းဖြင့်ရောက်ရှိရန်လိုအပ်သည်။
ru: Чтобы избежать этого и просматривать подобные динамические сайты в CENO, вы можете использовать приватные вкладки (т.е. приватный просмотр), которые оставляют личные данные нетронутыми и поддерживают шифрование соединения с сайтами, обеспечивая таким образом защиту от утечки данных. В то же время, для этого необходимо, чтобы сетевой трафик с вашего устройства мог каким-то образом достигать этих сайтов.
uk: Щоб уникнути цього та переглядати подібні динамічні сайти в CENO, ви можете використовувати приватні вкладки (тобто приватний перегляд), які залишають особисті дані недоторканими та підтримують шифрування з'єднання з сайтами, забезпечуючи таким чином захист від витоку даних. У той самий час, для цього необхідно, щоб мережевий трафік з вашого пристрою міг якимсь чином досягати цих сайтів.
ur: اس سے بچنے اور CENO میں ایسی متحرک سائٹس کے استعمال کو فعال کرنے کے لیے، آپ نجی ٹیبز (یعنی نجی براؤزنگ) استعمال کر سکتے ہیں، جو نجی ڈیٹا کو برقرار رکھتے ہیں اور سائٹس کے کنکشن کو انکرپٹڈ رکھتے ہیں اور اس طرح ہر کسی سے محفوظ رہتے ہیں۔ تاہم، اس کے لیے ضروری ہے کہ آپ کے ڈیوائس سے نیٹ ورک ٹریفک کسی نہ کسی طریقے سے ان ویب سائٹس تک پہنچ سکے۔

source: CENO only shares content that you requested (using [public browsing](../concepts/public-private.md)).
es: CENO solamente comparte contenido que tu solicitaste (usando [navegación pública](../concepts/public-private.md)).
fa: سنو فقط محتوایی را به اشتراک می‌گذارد که شما درخواست کرده باشید (با استفاده از [مرور عمومی](../concepts/public-private.md)).
my: CENO သည် ([အများသုံး ရှာဖွေခြင်း](../concepts/public-private.md) ကိုအသုံးပြု၍) သင်တောင်းဆိုထားသော အကြောင်းအရာများကိုသာ မျှဝေပေးပါသည်။
ru: CENO распространяет только контент, который вы запросили (используя [публичный просмотр страниц](../concepts/public-private.md)).
uk: CENO розповсюджує лише контент, який ви запросили (використовуючи [публічний перегляд сторінок](../concepts/public-private.md)).
ur: CENO صرف وہ مواد شیئر کرتا ہے جس کی آپ نے درخواست کی تھی ([پبلک براؤزنگ](../concepts/public-private.md) کا استعمال کرتے ہوئے)۔

source: Read more about how your CENO Browser retrieves and shares Web content with others [here](../concepts/how.md).
es: Lee más acerca de cómo tu Navegador CENO descarga y comparte contenido Web con otros [aquí](../concepts/how.md).
fa: درباره‌ی چگونگی بازیابی و به‌اشتراک‌گذاشتن محتوای وب با دیگران توسط مرورگر سنو بیشتر بخوانید [اینجا](../concepts/how.md).
my: CENO ဘရောက်ဇာမှ ဝဘ်ဆိုက်အကြောင်းအရာများကို ရယူပုံနှင့် တခြားသူများအား မျှဝေပုံကို [ဒီနေရာမှာ](../concepts/how.md) ဖတ်ရှုနိုင်ပါသည်။
ru: Подробнее о том, как ваш Браузер CENO получает веб-контент и распространяет его другим пользователям, прочтите [здесь](../concepts/how.md).
uk: Докладніше про те, як ваш браузер CENO отримує веб-контент і ділиться з іншими користувачами, прочитайте [тут](../concepts/how.md).
ur: اس بارے میں مزید پڑھیں کہ آپ کا CENO براؤزر کس طرح ویب مواد کو بازیافت اور دوسروں کے ساتھ شیئر کرتا ہے [یہاں](../concepts/how.md)۔

source: Can anyone see if I am using CENO Browser to access censored Web sites?
es: ¿Cualquiera puede ver si estoy usando al Navegador CENO para acceder a sitios Web censurados?
ur: کیا کوئی دیکھ سکتا ہے کہ کیا میں سنسر شدہ ویب سائٹس تک رسائی کے لیے CENO براؤزر استعمال کر رہا ہوں؟

source: CENO is not an anonymity tool. An attacker able to spy on your network traffic can see content being requested from or served to another user from your device. The attacker can also assess whether you are sharing a particular website, although they cannot list all the content that you are sharing.
es: CENO no es una herramienta de anonimato. Un atacante capaz de espiar sobre tu tráfico de red puede ver contenido siendo solicitado desde o servido a otro usuario desde tu dispositivo. El atacante también puede evaluar si estás compartiendo un sitio web particular, aunque no puede listar todo el contenido que estás compartiendo.
fa: سنو یک ابزار گمنامی نیست. مهاجمی که قادر به جاسوسی ترافیک شبکه‌ی شما باشد می‌تواند محتوای درخواست‌شده یا ارائه‌شده به یک کاربر دیگر از دستگاه‌تان را ببیند. مهاجم همچنین می‌تواند تشخیص دهد که آیا شما یک وب‌سایت خاص را به اشتراک می‌گذارید، گرچه نمی‌تواند لیستی از هر محتوایی که به اشتراک می‌گذارید داشته باشد.
my: CENO သည် အမည်ဝှက် ကိရိယာတစ်ခု မဟုတ်ပါ။ တိုက်ခိုက်သူတစ်ဦးက သင့်စက်မှ တောင်းဆိုသော (သို့) အခြားသုံးစွဲသူထံ ပေးပို့သော အကြောင်းအရာများကို သင့်ကွန်ရက်လမ်းကြောင်းကနေ ခိုးယူကြည့်ရှုနိုင်ပါသည်။ တိုက်ခိုက်သူသည် သင်မျှဝေနေသော အကြာင်းအရာအားလုံးကို စာရင်းမပြုလုပ်နိုင်သော်လည်း သီးခြားဝဘ်ဆိုက်တစ်ခုကို သင်မျှဝေနေသလားဆိုတာကို သိနိုင်ပါသည်။
ru: CENO не является средством обеспечения анонимности. Злоумышленник, способный шпионить за вашим сетевым трафиком, может увидеть контент, запрашиваемый у другого пользователя или распространяемый с вашего устройства. Злоумышленник также может определить, пользуетесь ли вы определенным веб-сайтом, хотя он не может получить полный список контента, которым вы делитесь.
uk: CENO НЕ є засобом забезпечення анонімності. Зловмисник, здатний шпигувати за вашим мережним трафіком, може побачити контент, що запитується в іншого користувача або розповсюджується з вашого пристрою. Зловмисник також може визначити, чи ви користуєтесь певним веб-сайтом, хоча він не може отримати повний список контенту, яким ви ділитеся.
ur: CENO گمنامی کا ڈیوائس نہیں ہے۔ آپ کے نیٹ ورک ٹریفک کی جاسوسی کرنے والا حملہ آور آپ کے ڈیوائس سے کسی دوسرے صارف سے درخواست یا پیش کیے جانے والے مواد کو دیکھ سکتا ہے۔ حملہ آور اس بات کا بھی اندازہ لگا سکتا ہے کہ آیا آپ کسی خاص ویب سائٹ کا اشتراک کر رہے ہیں، حالانکہ وہ ان تمام مواد کی فہرست نہیں دے سکتا جو آپ شیئر کر رہے ہیں۔

source: Does CENO Browser use a lot of data?
es: ¿El Navegador CENO usa un montón de datos?
ur: کیا CENO براؤزر بہت زیادہ ڈیٹا استعمال کرتا ہے؟

source: Whenever your CENO Browser serves content to another user or forwards their traffic, it is consuming extra data depending on factors like how popular or large the content is, and how well-connected your device is. Sharing more content also implies more overhead.
es: Cada vez que tu Navegador CENO sirve contenido a otro usuario o redirige su tráfico, está consumiendo datos extra, dependiendo de factores tales como qué tan popular o grande es el contenido, y qué tan bien conectado está tu dispositivo. Compartir más contenido también implica más costos.
fa: هرگاه مرورگر سنو شما محتوایی را به یک کاربر دیگر ارائه می‌دهد یا ترافیک آن‌ها را حمل می‌کند، مقدار مازادی از داده را مصرف می‌کند که به عواملی مثل میزان محبوبیت یا حجم آن محتوا بستگی دارد، و نیز این‌که اتصال دستگاه‌تان چه‌قدر خوب باشد. به‌اشتراک‌گذاشتن محتوای بیشتر تلویحاً به معنای پردازش افزوده نیز است.
my: သင်၏ CENO ဘရောက်ဇာသည် အခြားသောအသုံးပြုသူများထံ အကြောင်းအရာများကို ပေးပို့သောအခါ သို့မဟုတ် အသွားအလာများကို ထပ်ဆင့်ပို့သောအခါ CENO သည် အကြောင်းအရာ၏ ကျော်ကြားပုံ သို့မဟုတ် ကြီးမားပုံနှင့် သင့်စက်၏ ကွန်ရက်ချိတ်ဆက်မှုအားကောင်းခြင်း အစရှိသော အချက်များပေါ်တွင် မူတည်ပြီး ဒေတာပိုမိုကုန်စေပါသည်။ အကြောင်းအရာများ ပိုမိုမျှဝေပါက ပိုမိုကုန်ကျနိုင်ပါသည်။
ru: Каждый раз, когда ваш Браузер CENO передает контент другому пользователю или перенаправляет его трафик, он потребляет избыточный объем данных, зависящий от таких факторов, как популярность или объем контента, а также от того, насколько надежно подключено ваше устройство. Передача большего количества контента также подразумевает увеличение накладных расходов.
uk: Щоразу, коли ваш браузер CENO роздає контент іншим користувачам або передає їхній контент, він споживає додатковий трафік, що залежить від таких факторів, як популярність або обсяг контенту, а також від того, наскільки надійно підключений ваш пристрій до інтернету. Чим більше контенту ви роздаєте, тим вищі додаткові витрати.
ur: جب بھی آپ کا CENO براؤزر کسی دوسرے صارف کو مواد فراہم کرتا ہے یا ان کے ٹریفک کو آگے بھیجتا ہے، تو یہ اضافی ڈیٹا استعمال کر رہا ہوتا ہے اس پر منحصر ہوتا ہے کہ مواد کتنا مقبول یا بڑا ہے، اور آپ کا ڈیوائس کتنا اچھی طرح سے منسلک ہے۔ زیادہ مواد کا اشتراک کرنے کا مطلب بھی زیادہ اوور ہیڈ ہوتا ہے۔
