Repository: censorship-no/ceno-docs
Catalog: user-manual/*/intro/faq.po
Languages: ar, de, es, fa, fr, id, my, pt_br, ru, tr, uk, ur

source: Can anyone see if I am using Ceno Browser to access censored Web sites?
ar: هل يمكن لأي شخص معرفة ما إذا كنت أستخدم متصفح Ceno للوصول إلى مواقع الويب الخاضعة للرقابة؟
de: Kann jemand sehen, ob ich CENO Browser benutze, um auf zensierte Websites zuzugreifen?
fr: Quelqu’un peut-il voir si j’utilise le Navigateur Ceno pour accéder à des sites Web censurés ?
id: Bisakah orang lain melihat jika saya memakai Peramban Ceno untuk mengakses situs web yang disensor?
pt_br: Alguém pode ver se eu estou usando o Navegador CENO para acessar websites censurados?
tr: CENO Browser kullanarak sansürlenen sitelere erişmeye çalıştığımı başkaları görebilir mi?

source: Short answer: yes, with some technical knowledge and resources.
ar: إجابة مختصرة: نعم ، مع بعض المعارف والموارد التقنية.
de: Kurze Antwort: Ja, mit einigen technischen Kenntnissen und Ressourcen.
es: Respuesta corta: sí, con algún conocimiento y recursos técnicos.
fa: پاسخ کوتاه: بله، با داشتن کمی دانش فنی و منابع.
fr: La réponse est oui, avec des connaissances et des ressources techniques.
id: Jawaban singkat: ya, dengan beberapa pengetahuan teknis dan sumber daya.
my: အဖြေတို - သိနိုင်ပါသည်၊ တချို့သော နည်းပညာဆိုင်ရာ ဗဟုသုတနှင့် အရင်းအမြစ်တို့ရှိပါက သိနိုင်ပါသည်။
pt_br: Resposta curta: sim, com algum conhecimento técnico e recursos.
ru: Краткий ответ: да, при наличии определенных технических знаний и ресурсов.
tr: Kısa yanıt: Evet, teknik bilgi ve kaynağa sahip oldukları sürece.
uk: Коротка відповідь: так, за наявності певних технічних знань та ресурсів.
ur: مختصر جواب: ہاں، کچھ تکنیکی علم اور وسائل کے ساتھ۔

source: Ceno is not an anonymity tool. An attacker able to spy on your network traffic can see content being requested from or served to another user from your device. The attacker can also assess whether you are sharing a particular website, although they cannot list all the content that you are sharing.
ar: Ceno ليس أداة إخفاء هوية. يمكن لمهاجم قادر على التجسس على حركة مرور الشبكة الخاصة بك رؤية المحتوى الذي تطلبه أو الذي ترسله إلى مستخدم آخر من جهازك. يمكن للمهاجم أيضًا تحديد ما إذا كنت شاركت موقعًا إلكترونيًا معينًا، لكن لا يمكنه سرد كل المحتوى الذي تشاركه.
de: CENO ist kein Anonymitätswerkzeug. Ein Angreifer, der in der Lage ist, Ihren Netzwerkverkehr auszuspionieren, kann sehen, welche Inhalte von Ihrem Gerät aus von einem anderen Benutzer angefordert oder an diesen übermittelt werden. Der Angreifer kann auch feststellen, ob Sie eine bestimmte Website teilen, obwohl er nicht alle Inhalte auflisten kann, die Sie teilen.
fr: Ceno n’est pas un outil d’anonymisation. Un assaillant capable d’espionner votre trafic réseau peut voir le contenu demandé de votre appareil à un autre utilisateur ou une autre utilisatrice, ou servi à cette personne. Il peut également déterminer si vous partagez un site Web particulier, bien qu’il ne puisse lister tous les contenus que vous partagez.
id: Ceno bukanlah alat anonimitas. Penyerang yang dapat memata-matai lalu lintas jaringan Anda, bisa melihat konten yang sedang diminta dari atau dikirim ke pengguna lain dari perangkat Anda. Penyerang bisa juga menilai apakah Anda sedang membagikan situs web tertentu atau tidak, meskipun mereka tidak bisa memerinci semua konten yang Anda bagikan.
pt_br: CENO não é uma ferramenta de anonimato. Um atacante capaz de espionar o seu tráfego de rede pode ver o conteúdo sendo requisitado de ou provido para outro usuário a partir do seu dispositivo. O atacante pode também determinar se você está ou não compartilhando um website específico, mesmo que ele não possa listar todo o conteúdo sendo compartilhado por você.
tr: CENO bir anonimlik aracı değildir. Ağ trafiğinizi izleme yeteneği olan bir saldırgan, başka bir kullanıcının aygıtınızdan istediği veya aldığı içerikleri görebilir. Saldırgan ayrıca belirli bir siteyi paylaşıp paylaşmadığınızı da anlayabilir, ancak paylaştığınız tüm içeriği göremez.

source: However, content being retrieved into the network for the first time or using [private browsing](../concepts/public-private.md) will travel over encrypted connections. See [how content retrieval works](../concepts/how.md) and the associated [risks](../concepts/risks.md) for more information.
ar: ومع ذلك، المحتوى الذي يتم استرداده إلى الشبكة لأول مرة أو باستخدام [التصفح الخاص](../concepts/public-private.md) سينتقل عبر اتصالات مشفرة. انظر [كيف يعمل استرداد المحتوى](../concepts/how.md) و [المخاطر](../concepts/risks.md) المرتبطة بذلك للمزيد من المعلومات.
de: Allerdings werden Inhalte, die zum ersten Mal im Netz abgerufen werden oder das [private Browsing](../concepts/public-private.md) nutzen, über verschlüsselte Verbindungen übertragen. Weitere Informationen finden Sie unter [wie der Abruf von Inhalten funktioniert](../concepts/how.md) und den damit verbundenen [Risiken](../concepts/risks.md).
es: Sin embargo, el contenido siendo descargado dentro de la red por primera vez o usando [navegación privada](../concepts/public-private.md) viajará sobre conexiones cifradas. Mira [cómo funciona la descarga de contenido](../concepts/how.md) y los [riesgos](../concepts/risks.md) asociados para mayor información.
fa: با این حال، محتوایی که برای نخستین بار یا با استفاده از [مرور خصوصی](../concepts/public-private.md) درون شبکه بازیابی می‌شود، از طریق ارتباط‌های رمزگذاری‌شده فرستاده خواهد شد. برای اطلاعات بیشتر به بخش [بازیابی محتوا چگونه کار می‌کند](../concepts/how.md) و [خطرها](../concepts/risks.md)ی مرتبط با آن بنگرید.
id: Namun, konten yang diambil oleh jaringan untuk pertama kali atau memakai [penjelajahan privat](../concepts/public-private.md) akan melakukan perjalanan melalui koneksi terenkripsi. Lihat [cara kerja pengambilan konten](../concepts/how.md) dan [risiko](../concepts/risks.md) untuk informasi lebih lanjut.
my: သို့သော် ပထမဆုံးအကြိမ် ရယူပြီး သို့မဟုတ် [သီးသန့်ရှာဖွေမှု](../concepts/public-private.md) ကို အသုံးပြုပြီး ကွန်ရက်ထဲထည့်သော အကြောင်းအရာကို ကုဒ်ဖြင့်ပြောင်းလဲထားသော ချိတ်ဆက်မှုများမှတစ်ဆင့် ပေးပို့ပါမည်။ နောက်ထပ်အချက်အလက်များ သိလိုပါက [အကြောင်းအရာ ပြန်ရယူပုံ](../concepts/how.md) နှင့် ၎င်းနှင့်ဆက်စပ်နေသော [စွန့်စားမှုများ](../concepts/risks.md) ကို ကြည့်ပါ။
ru: В то же время, контент, добавляемый в сеть впервые или получаемый при использовании [приватного просмотра](../concepts/public-private.md), будет передаваться по шифрованному соединению. Дополнительную информацию см. в разделе [как работает получение контента](../concepts/how.md) и связанные с этим [риски](../concepts/risks.md).
uk: Однак, контент, що додається в мережу вперше або отримується при використанні [приватного перегляду](../concepts/public-private.md), буде передаватися шифрованим з'єднанням. Додаткову інформацію дивіться у розділі [як працює отримання контенту](../concepts/how.md) та пов'язані з цим [ризики](../concepts/risks.md).
ur: تاہم، نیٹ ورک میں پہلی بار حاصل کیے جانے والے مواد یا [نجی براؤزنگ](../concepts/public-private.md) کا استعمال کرتے ہوئے انکرپٹڈ کنکشنز پر سفر کرے گا۔ مزید معلومات کے لیے دیکھیں [مواد کی بازیافت کیسے کام کرتی ہے](../concepts/how.md) اور متعلقہ [خطرے](../concepts/risks.md)۔

source: Resource usage
ar: استخدام الموارد
de: Ressourcenverbrauch
es: Uso de recursos
fa: استفاده از منابع
fr: Utilisation des ressources
id: Penggunaan sumber daya
my: ရင်းမြစ် သုံးစွဲမှု
pt_br: Uso de recursos
ru: Использование ресурсов
tr: Kaynak kullanımı
uk: Використання ресурсів
ur: وسائل کا استعمال

source: Does Ceno Browser use a lot of data?
ar: هل يستخدم متصفح Ceno الكثير من البيانات؟
de: Verbraucht CENO Browser viele Daten?
fr: Le Navigateur Ceno utilise-t-il beaucoup de données ?
id: Apakah Peramban Ceno menggunakan banyak data?
pt_br: O Navegador CENO usa uma grande quantidade de dados?
tr: CENO Browser çok fazla veri tüketir mi?

source: Short answer: more than your usual browser.
ar: إجابة مختصرة: أكثر من متصفحك المعتاد.
de: Kurze Antwort: mehr als Ihr herkömmlicher Browser.
es: Respuesta corta: más que tu navegador usual.
fa: پاسخ کوتاه: بیشتر از مرورگر معمول‌تان.
fr: La réponse est oui, davantage que votre navigateur habituel.
id: Jawaban singkat: lebih dari peramban biasa Anda.
my: အဖြေတို - သင် အသုံးပြုနေကျ ဘရောက်ဇာထက် ပိုသုံးပါသည်။
pt_br: Resposta curta: mais que o seu navegador tradicional.
ru: Краткий ответ: больше, чем обычный браузер.
tr: Kısa yanıt: Normal tarayıcınızdan daha fazla veri tüketir.
uk: Коротка відповідь: більше, ніж звичайний браузер.
ur: مختصر جواب: آپ کے معمول کے براؤزر سے زیادہ۔

source: Whenever your Ceno Browser serves content to another user or forwards their traffic, it is consuming extra data depending on factors like how popular or large the content is, and how well-connected your device is. Sharing more content also implies more overhead.
ar: عندما يرسل متصفح Ceno الخاص بك محتوى ما إلى مستخدم آخر أو يعيد توجيه حركة المرور الخاصة به، فإنه يستهلك بيانات إضافية اعتمادًا على عدة عوامل مثل مدى شعبية المحتوى و حجمه وجودة اتصال جهازك. مشاركة المزيد من المحتوى يعني أيضًا المزيد من الاستهلاك.
de: Jedes Mal, wenn Ihr CENO Browser Inhalte für andere Benutzer bereitstellt oder deren Datenverkehr weiterleitet, verbraucht er zusätzliche Daten, abhängig von Faktoren wie der Beliebtheit oder dem Umfang der Inhalte und der Verbindungsqualität Ihres Geräts. Die Freigabe von mehr Inhalten bedeutet auch mehr Overhead.
fr: Chaque fois que votre Navigateur Ceno sert du contenu à un autre utilisateur ou utilisatrice, ou transfère son trafic, il consomme des données supplémentaires en fonction de facteurs tels que la popularité ou la taille du contenu et la qualité de la connexion de votre appareil. Partager davantage de contenu implique également une utilisation accrue de ressources.
id: Setiap kali Peramban Ceno Anda menyajikan konten ke pengguna lain atau meneruskan lalu lintas mereka, itu mengonsumsi data tambahan tergantung pada faktor-faktor seperti seberapa populer atau besar kontennya, dan seberapa baik koneksi perangkat Anda. Berbagi lebih banyak konten juga berarti lebih banyak biaya data tambahan.
pt_br: Em qualquer ocasião em que o Navegador CENO provê conteúdo para outro usuário ou encaminha seu tráfego, ele consome dados extras a depender de fatores como o quão popular ou extenso é o conteúdo e o quão bem conectado é o seu dispositivo. Compartilhar mais conteúdo também implica em maior sobrecarga.
tr: CENO Browser, başka bir kullanıcıya içerik gönderirken ya da trafik aktarırken, içeriğin yaygınlığına, büyüklüğüne ve aygıtınızın bağlantı kalitesine bağlı olarak daha fazla veri kullanabilir. İçerik paylaşımı arttıkça veri kullanımı da artar.

source: Although Ceno is much lighter in resources than other data-sharing applications, it can still result in increased data usage and fees. We recommend keeping an eye on the app's data usage (under Android settings) and running Ceno while connected to Wi-Fi instead of using mobile data.
ar: رغم أن استهلاك Ceno للموارد أقل من تطبيقات مشاركة البيانات الأخرى، إلا أنه من الممكن أن يؤدي إلى زيادة استخدام البيانات والمصاريف. نوصي بمراقبة استخدام بيانات التطبيق (ضمن إعدادات أندرويد) وتشغيل Ceno أثناء الاتصال بشبكة Wi-Fi بدلاً من استخدام بيانات الجوال.
de: Obwohl CENO viel weniger Ressourcen benötigt als andere Anwendungen zur gemeinsamen Datennutzung, kann es dennoch zu einer erhöhten Datennutzung und zu Gebühren kommen. Wir empfehlen, die Datennutzung der App im Auge zu behalten (in den Android-Einstellungen) und CENO mit einer Wi-Fi-Verbindung statt mit mobilen Daten zu nutzen.
fr: Bien que Ceno soit beaucoup moins gourmand en ressources que d’autres applications de partage de données, il peut néanmoins entraîner une augmentation de l’utilisation des données et des frais afférents. Nous recommandons de garder un œil sur l’utilisation des données par l’appli (dans les paramètres d’Android) et lancer Ceno connecté au Wi-Fi plutôt qu’aux données mobiles.
id: Meskipun sumber daya Ceno jauh lebih ringan daripada aplikasi berbagi data lainnya, Ceno masih dapat menghasilkan peningkatan penggunaan dan biaya data. Kami merekomendasikan untuk mengawasi penggunaan data aplikasi (di bawah pengaturan Android) dan menjalankan Ceno saat terhubung ke Wi-Fi daripada menggunakan data seluler.
pt_br: Apesar de o CENO consumir muito menos recursos que outras aplicações de compartilhamento de dados, seu uso ainda pode resultar em um aumento das tarifas e da utilização de dados. Recomendamos monitorar o uso de dados do aplicativo (pelas configurações do Android) e executar o CENO enquanto estiver conectado ao WiFi ao invés de dados móveis.
tr: CENO diğer veri paylaşım uygulamalarına göre daha az kaynak kullansa da veri kullanımı ve ücretleri daha yüksek olabilir. Bu yüzden, uygulamanın veri kullanımına (Android ayarlarından) dikkat etmeniz ve yalnızca kablosuz ağ bağlantınız varken CENO kullanmanız önerilir.

source: Does Ceno Browser use a lot of battery on my device?
ar: هل يستخدم متصفح Ceno الكثير من البطارية على جهازي؟
de: Verbraucht CENO Browser viel Akku auf meinem Gerät?
fr: Le Navigateur Ceno consomme-t-il beaucoup d’énergie sur mon appareil ?
id: Apakah Peramban Ceno mengonsumsi banyak baterai di perangkatku?
pt_br: O Navegador CENO consome muita bateria do meu dispositivo?
tr: CENO Browser aygıtımın pilini daha çabuk bitirir mi?

source: Ceno and Ouinet use various techniques for different users to cooperate in avoiding network interference and outages. Serving content to and forwarding traffic for other users consumes extra power. Also, even when your device is not actively helping other users, it still needs to stay reachable over the network, which prevents the use of some energy-saving features.
ar: يستخدم كل من Ceno و Ouinet عدة تقنيات للمستخدمين المختلفين للتعاون في تجاوز تداخل الشبكة وانقطاعها. إن تقديم المحتوى وإعادة توجيه حركة المرور للمستخدمين الآخرين يستهلك طاقة إضافية. و حتى عندما لا يكون جهازك يساعد المستخدمين الآخرين، فلا يزال من الضروري أن يظل متاحًا عبر الشبكة، مما يمنع استخدام بعض الميزات الموفرة للطاقة.
de: CENO und Ouinet verwenden verschiedene Techniken für die Zusammenarbeit verschiedener Nutzer, um Netzstörungen und Ausfälle zu vermeiden. Die Bereitstellung von Inhalten und die Weiterleitung von Datenverkehr für andere Nutzer verbraucht zusätzliche Energie. Auch wenn Ihr Gerät anderen Nutzern nicht aktiv hilft, muss es dennoch über das Netz erreichbar bleiben, was die Nutzung einiger Energiesparfunktionen verhindert.
fr: Ceno et Ouinet utilisent des techniques variées pour que différents utilisateurs coopèrent afin d’éviter les interférences et les coupures de réseau. Servir du contenu à d’autres utilisateurs et leur transmettre du trafic consomme plus d’énergie. De plus, même si votre appareil n’aide pas activement d’autres utilisateurs ou utilisatrices, il doit rester joignable sur le réseau, ce qui empêche l’utilisation de certaines fonctions d’économie d’énergie.
id: Ceno dan Ouinet menggunakan berbagai teknik untuk pengguna yang berbeda untuk bekerja sama dalam menghindari gangguan dan pemadaman jaringan. Melayani konten ke dan meneruskan lalu lintas untuk pengguna lain menghabiskan daya baterai ekstra. Selain itu, meskipun perangkat Anda tidak secara aktif membantu pengguna lain, perangkat tetap harus dapat dijangkau oleh jaringan, yang mana dapat mencegah penggunaan beberapa fitur hemat energi.
pt_br: CENO e Ouinet aplicam várias técnicas para que diferentes usuários cooperem para evitar interferências e interrupções na rede. Provendo conteúdo e encaminhando tráfego para outros usuários consome energia extra. Além disso, mesmo quando seu dispositivo não está ativamente ajudando outros usuários, ele ainda precisa estar alcançável pela rede, o que impede o uso de algumas funcionalidades de economia de energia.
tr: CENO ve Ouinet ağ ksıtılamaları ve kesintilerden kaçınmak için çeşitli yöntemler kullanır. Diğer kullanıcılar için içerik sağlama ve trafik aktarma işlemleri fazladan güç tüketir. Aygıtınız başkalarına etkin şekilde yardım etmediği zaman bile ağ üzerinde erişilebilir olmalıdır. Bu yüzden bazı pil koruma özellikleri kullanılamaz.

source: The net result is that Ceno may keep on draining your battery even when not in use. Our tests have not shown power consumption hiking too much, but your mileage may vary. When in need of battery, we recommend stopping Ceno completely (it offers a convenient shortcut for this, see [here](../browser/install.md)).
ar: كنتيجة قد يستمر Ceno في استنزاف البطارية حتى عندما لا تكون قيد الاستخدام. لم تُظهر اختباراتنا ارتفاع استهلاك الطاقة كثيرًا، ولكن قد يختلف الأمر بالنسبة لك. عندما تحتاج إلى شحن البطارية، نوصي بإيقاف Ceno تمامًا (يوفر التطبيق اختصارًا مناسبًا لذلك، انظر [هنا](../browser/install.md)).
de: Das Ergebnis ist, dass CENO Ihren Akku auch bei Nichtgebrauch weiter entlädt. Unsere Tests haben nicht gezeigt, dass der Stromverbrauch zu stark ansteigt, aber das kann bei Ihnen anders sein. Wir empfehlen, CENO komplett zu stoppen, wenn der Akku leer ist (es bietet eine praktische Verknüpfung dafür, siehe [hier](../browser/install.md)).
fr: Ceno peut effectivement continuer à vider votre batterie même s’il n’est pas utilisé. Nos tests n’ont pas démontré d’augmentation trop importante de la consommation d’énergie, mais cela peut dépendre des situations. Si vous avez besoin d’énergie, nous vous recommandons d’arrêter complètement Ceno (qui offre un raccourci pratique [pour ce faire](../browser/install.md)).
id: Hasil akhirnya adalah Ceno dapat terus menguras baterai Anda bahkan saat tidak digunakan. Pengujian kami tidak menunjukkan peningkatan konsumsi daya yang terlalu banyak, tetapi jarak tempuh konten Anda mungkin berbeda. Saat membutuhkan baterai, kami sarankan untuk menghentikan Ceno sepenuhnya (Ceno menawarkan pintasan yang nyaman untuk ini, lihat [di sini](../browser/install.md)).
pt_br: O resultado final é que o CENO pode continuar drenando sua bateria mesmo quando não estiver em uso. Nossos testes não demonstraram muitos picos de consumo de energia, mas isso pode variar de acordo com o cada caso. Quando na necessidade de bateria, recomendamos parar o CENO completamente (ele oferece um atalho conveniente para isso, veja [aqui](../browser/install.md)).
tr: CENO kullanmadığınız zaman bile aygıtınızın pilini tüketebilir. Denemelerimizde güç tüketiminde aşırı bir artış görünmüyor. Ama bu durum kullanımınıza bağlı olarak değişebilir. Şarja gerek duyduğunuzda CENO uygulamasını tümüyle kapatmanız önerilir (bu işlem için kolayca erişilebilir bir kısayolu [buradan](../browser/install.md) bulabilirsiniz).

source: Do I need to be connected to Wi-Fi to use Ceno Browser?
ar: هل أحتاج إلى الاتصال بشبكة Wi-Fi لاستخدام متصفح Ceno؟
de: Brauche ich eine Wi-Fi-Verbindung, um CENO Browser zu nutzen?
fr: Une connexion au Wi-Fi est-elle nécessaire pour utiliser le Navigateur Ceno ?
id: Apakah saya perlu terhubung ke Wi-Fi saat menggunakan Peramban Ceno?
pt_br: Eu preciso de conexão WiFi para usar o Navegador CENO?
tr: CENO Browser kullanmak için kablosuz ağa bağlı olmam şart mı?

source: Short answer: no, but we strongly recommend it.
ar: إجابة مختصرة: لا ، لكننا نوصي بذلك بشدة.
de: Kurze Antwort: Nein, aber wir empfehlen es dringend.
es: Respuesta corta: no, pero lo recomendamos enfáticamente.
fa: پاسخ کوتاه: نه، اما آن را به‌شدت توصیه می‌کنیم.
fr: La réponse est non, mais nous le recommandons fortement.
id: Jawaban singkat: tidak, tetapi kami sangat menganjurkannya.
my: အဖြေတို - မလိုအပ်ပါ၊ သို့သော် ဖွင့်ထားဖို့ တိုက်တွန်းပါသည်။
pt_br: Resposta curta: não, mas recomendamos fortemente.
ru: Краткий ответ: нет, но мы настоятельно рекомендуем это сделать.
tr: Kısa yanıt: Hayır, ama şiddetle önerilir.
uk: Коротка відповідь: ні, але ми наполегливо рекомендуємо це зробити.
ur: مختصر جواب: نہیں، لیکن ہم اس کی سختی سے سفارش کرتے ہیں۔

source: Although Ceno should work fine on a mobile connection, there are two reasons why we recommend using a Wi-Fi connection instead:
ar: على الرغم من أن Ceno يجب أن يعمل بشكل جيد على اتصال الهاتف المحمول، إلا أن هناك سببين يجعلنا نوصي باستخدام اتصال Wi-Fi بدلا من ذلك:
de: Obwohl CENO über eine Mobilfunkverbindung problemlos funktionieren sollte, empfehlen wir aus zwei Gründen, stattdessen eine Wi-Fi-Verbindung zu verwenden:
fr: Même si Ceno devrait bien fonctionner avec une connexion mobile, nous vous recommandons d’utiliser plutôt une connexion Wi-Fi pour deux raisons :
id: Meskipun Ceno seharusnya berfungsi dengan baik pada koneksi seluler, ada dua alasan mengapa kami menyarankan untuk menggunakan koneksi Wi-Fi:
pt_br: Embora o CENO deva funcionar bem em uma conexão móvel, há duas razões pelas quais recomendamos usar uma conexão WiFi:
tr: CENO mobil veri ile de çalışabilir fakat iki nedenle kablosuz ağ kullanmanızı öneriyoruz:

source: Ceno consumes an extra amount of data which may result in a higher phone bill (see above).
ar: يستهلك Ceno كمية إضافية من البيانات التي قد تؤدي إلى ارتفاع فاتورة الهاتف (انظر أعلاه).
de: CENO verbraucht eine zusätzliche Datenmenge, was zu einer höheren Telefonrechnung führen kann (siehe oben).
fr: Ceno consomme plus de données, ce qui pourrait entraîner une facture de téléphone plus élevée (voir ci-dessus).
id: Ceno menggunakan sejumlah data ekstra yang dapat menyebabkan tagihan ponsel lebih tinggi (lihat di atas).
pt_br: CENO consome uma quantidade extra de dados, o que pode resultar em uma conta de telefone mais alta (veja acima).
tr: CENO normal tarayıcılardan daha fazla veri kullanır. Bu nedenle telefon faturanız daha yüksek gelebilir (yukarıya bakın).
