Repository: censorship-no/ceno-docs
Catalog: user-manual/*/intro/faq.po
Languages: ar, de, es, fa, fr, id, my, pt_br, ru, tr, uk, ur

source: Although CENO is much lighter in resources than other data-sharing applications, it can still result in increased data usage and fees. We recommend keeping an eye on the app's data usage (under Android settings) and running CENO while connected to Wi-Fi instead of using mobile data.
es: Aunque CENO no consuma tantos recursos como otras aplicaciones de compartición de datos, aún así puede resultar en uso de datos y tarifas incrementadas. Recomendamos prestar atención al uso de datos de la aplicación (bajo los ajustes de Android) y ejecutar CENO mientras se está conectado a Wi-Fi, en vez de usar datos móviles.
fa: اگرچه سنو نسبت به سایر نرم‌افزارهای اشتراک داده منابع بسیار سبک‌تری را به کار می‌گیرد، این همچنان می‌تواند به حجم افزوده‌ای از کاربرد داده‌ها و هزینه‌های بیشتر منجر شود. ما توصیه می‌کنیم مراقب میزان استفاده‌ی این برنامه از داده‌ها (در بخش تنظیمات اندروید) باشید و سنو را در هنگام اتصال به وای‌فای اجرا کنید و نه با استفاده از اینترنت موبایل.
my: CENO သည် အခြားသော ဒေတာမျှဝေသည့် အက်ပလီကေးရှင်းများထက် ရင်းမြစ်တွင် ပိုမိုပေါ့ပါးသော်လည်း ဒေတာသုံးစွဲမှုနှင့် အခကြေးငွေတို့ ပိုမိုကုန်ကျစေနိုင်ပါသည်။ (Android ဆက်တင်တွင်) အက်ပလီကေးရှင်း၏ ဒေတာသုံးစွဲမှုကို စောင့်ကြည့်ရန် ကျွန်ုပ်တို့ အကြံပေးလိုပါသည်။ ထို့ပြင် မိုဘိုင်းဒေတာကို အသုံးပြုမည့်အစား ဝိုင်ဖိုင်ကို အသုံးပြုပြီး CENO ကို အသုံးပြုပါ။
ru: Несмотря на то, что CENO использует гораздо меньше ресурсов, чем другие приложения для обмена данными, это все равно может привести к увеличению потребления данных и повышению расходов. Мы рекомендуем следить за использованием данных приложением (в настройках Android) и запускать CENO при подключении к Wi-Fi вместо использования мобильного интернета.
uk: Незважаючи на те, що CENO використовує набагато менше ресурсів, ніж інші програми обміну даними, це все одно може призвести до збільшення споживання даних та підвищення витрат. Ми рекомендуємо стежити за споживанням трафіку програмою (в налаштуваннях Android) та використовувати CENO через Wi-Fi замість мобільного інтернету.
ur: اگرچہ CENO دیگر ڈیٹا شیئرنگ ایپلی کیشنز کے مقابلے میں وسائل میں بہت ہلکا ہے، اس کے باوجود ڈیٹا کے استعمال اور فیسوں میں اضافہ ہو سکتا ہے۔ ہم موبائل ڈیٹا استعمال کرنے کے بجائے وائی فائی سے منسلک رہتے ہوئے ایپ کے ڈیٹا کے استعمال پر نظر رکھنے اور CENO چلانے کی تجویز کرتے ہیں۔

source: Does CENO Browser use a lot of battery on my device?
es: ¿El Navegador CENO usa un montón de batería en mi dispositivo?
ur: کیا CENO براؤزر میری ڈیوائس پر بہت زیادہ بیٹری استعمال کرتا ہے؟

source: CENO and Ouinet use various techniques for different users to cooperate in avoiding network interference and outages. Serving content to and forwarding traffic for other users consumes extra power. Also, even when your device is not actively helping other users, it still needs to stay reachable over the network, which prevents the use of some energy-saving features.
es: CENO y Ouinet usan varias técnicas para que diferentes usuarios cooperen para evitar interferencia de red y apagones. Servir contenido y redirigir tráfico para otros usuarios consume poder extra. También, aún cuando tu dspositivo no esté ayudando activamente a otros usuarios, aún necesita permanecer alcanzable sobre la red, lo cual previene el uso de algunas características de ahorro de energía.
fa: سنو و وینت از تکنیک‌های گوناگونی برای کاربران مختلف استفاده می‌کنند تا به جلوگیری از اختلال و قطعی شبکه کمک کنند. ارائه‌ی محتوا به کاربران دیگر و حمل ترافیک آن‌ها باعث مصرف بیشتر برق می‌شود. همچنین، حتی وقتی دستگاه‌تان فعالانه به کاربران دیگر کمک نمی‌کند، باز هم نیاز دارد که روی شبکه در دسترس باقی بماند، که همین مانع از کاربرد برخی گزینه‌های صرف‌جویی در انرژی می‌شود.
my: CENO နှင့် Ouinet သည် အသုံးပြုသူအမျိုးမျိုးအတွက် ကွန်ရက်နှောင့်ယှက်မှုများနှင့် ပြတ်တောက်မှုများကို ရှောင်ရှားရန် နည်းပညာအများအပြားကို အသုံးပြုထားသည်။ အခြားသောအသုံးပြုသူများထံ အကြောင်းအရာများကို ပေးပို့ခြင်းနှင့် အသွားအလာများကို ထပ်ဆင့်ပို့ခြင်းတို့သည် အား ပိုကုန်စေပါသည်။ သင့်စက်သည် အခြားအသုံးပြုသူများကို တက်တက်ကြွကြွ မကူညီချိန်တွင်ပင် ကွန်ရက်ပေါ်၌ အခြားသူတို့က သင့်စက်ကို ချိတ်ဆက်နိုင်ရန် လိုအပ်ပါသည်။ ထို့ကြောင့် စွမ်းအင်ချွေတာသော လုပ်ဆောင်ချက်အချို့ကို အသုံးမပြုနိုင်ပါ။
ru: CENO и Ouinet используют различные техники для взаимодействия различных пользователей во избежание помех и сбоев в работе сети. Обслуживание контента и пересылка трафика для других пользователей потребляет дополнительную энергию. Кроме того, даже если ваше устройство не оказывает активной помощи другим пользователям, оно все равно должно оставаться доступным по сети, что не позволяет использовать некоторые энергосберегающие функции.
uk: CENO та Ouinet використовують різні техніки для взаємодії між різними користувачами у випадку перешкод та збоїв у роботі мережі. Обслуговування контенту та пересилання трафіку для інших користувачів споживає додаткову енергію. Крім того, навіть якщо ваш пристрій не надає активної допомоги іншим користувачам, він все одно повинен залишатися доступним в мережі, що не дозволяє використовувати деякі енергозберігаючі функції.
ur: CENO اور Ouinet نیٹ ورک کی مداخلت اور بندش سے بچنے میں تعاون کرنے کے لیے مختلف صارفین کے لیے مختلف تکنیکوں کا استعمال کرتے ہیں۔ دوسرے صارفین کے لیے مواد پیش کرنے اور ٹریفک کو آگے بھیجنے میں اضافی طاقت خرچ ہوتی ہے۔ اس کے علاوہ، یہاں تک کہ جب آپ کا آلہ فعال طور پر دوسرے صارفین کی مدد نہیں کر رہا ہے، تب بھی اسے نیٹ ورک پر قابل رسائی رہنے کی ضرورت ہے، جو توانائی کی بچت کی کچھ خصوصیات کے استعمال کو روکتا ہے۔

source: The net result is that CENO may keep on draining your battery even when not in use. Our tests have not shown power consumption hiking too much, but your mileage may vary. When in need of battery, we recommend stopping CENO completely (it offers a convenient shortcut for this, see [here](../browser/install.md)).
es: El resultado neto es que CENO podría seguir descargando tu batería aún cuando no esté en uso. Nuestras pruebas no han mostrado que el consumo de energía se eleve demasiado, pero tu experiencia podría variar. Cuando necesites la batería, recomendamos detener a CENO por completo (ofrece un atajo conveniente para esto, mira [aquí](../browser/install.md)).
fa: نتیجه‌ی نهایی این است که سنو ممکن است باتری دستگاه‌تان را حتی وقتی از آن استفاده نمی‌کنید خالی کند. آزمایش‌های ما افزایش شدیدی در مصرف برق را نشان نداده‌اند، اما میزان مصرف شما ممکن است متفاوت باشد. اگر نیاز به باتری دارید، توصیه می‌کنیم سنو را به‌طور کامل متوقف کنید (این نرم‌افزار میان‌بر آسانی برای این کار دارد، [این‌جا](../browser/install.md) را ببینید).
my: ရလဒ်အနေနှင့် CENO ကို အသုံးမပြုချိန်တွင်ပင် ၎င်းကြောင့် ဘက်ထရီအားလျော့နိုင်ပါသည်။ ကျွန်ုပ်တို့ စမ်းသပ်ချက်များတွင် စွမ်းအင်အသုံးပြုမှု အလွန်မများသော်လည်း သင်အသုံးပြုရာတွင် ကွဲပြားနိုင်ပါသည်။ ဘက်ထရီအား လိုအပ်ချိန်တွင် CENO ကို လုံးဝရပ်ပစ်လိုက်ဖို့ ကျွန်ုပ်တို့ အကြံပြုလိုပါသည် (ထိုသို့ရပ်ပစ်ရန် အဆင်ပြေစေမည့် ဖြတ်လမ်းကို [ဒီနေရာ](../browser/install.md) တွင် ကြည့်ပါ)။
ru: В результате CENO может продолжать разряжать аккумулятор, даже когда он не используется. Наши тесты не показали значительных скачков энергопотребления, но у вас может быть по-разному. При необходимости экономии батареи мы рекомендуем полностью остановить CENO (для этого есть удобный ярлык, см. [здесь](../browser/install.md)).
uk: Як наслідок, CENO може продовжувати розряджати акумулятор, навіть коли браузер не використовується. Наші випробування не показали значних стрибків енергоспоживання, але у вас може бути інакше. За потреби економії батареї ми рекомендуємо повністю зупинити CENO (для цього є зручний ярлик, дивіться тут (../browser/install.md)).
ur: خالص نتیجہ یہ ہے کہ CENO استعمال میں نہ ہونے کے باوجود بھی آپ کی بیٹری کو ختم کرنا جاری رکھ سکتا ہے۔ ہمارے ٹیسٹوں نے بجلی کی کھپت کو بہت زیادہ نہیں دکھایا ہے، لیکن آپ کا مائلیج مختلف ہو سکتا ہے۔ جب بیٹری کی ضرورت ہو تو، ہم CENO کو مکمل طور پر روکنے کی تجویز کرتے ہیں (یہ اس کے لیے ایک آسان شارٹ کٹ پیش کرتا ہے، [یہاں](../browser/install.md)) دیکھیں۔

source: Do I need to be connected to Wi-Fi to use CENO Browser?
es: ¿Necesito estar conectado a Wi-Fi para usar al Navegador CENO?
ur: کیا مجھے CENO براؤزر استعمال کرنے کے لیے وائی فائی سے منسلک ہونے کی ضرورت ہے؟

source: Although CENO should work fine on a mobile connection, there are two reasons why we recommend using a Wi-Fi connection instead:
es: Si bien CENO debería funcionar bien sobre una conexión móvil, hay dos razones por las que recomendamos usar una conexión Wi-Fi en su lugar:
fa: اگرچه سنو بایستی با اتصال به اینترنت موبایل نیز به‌خوبی کار کند، ما به دو علت استفاده از اتصال وای‌فای را به جای آن توصیه می‌کنیم:
my: CENO သည် မိုဘိုင်းချိတ်ဆက်မှုဖြင့် ကောင်းစွာ အလုပ်လုပ်နိုင်သော်လည်း ဝိုင်ဖိုင်ချိတ်ဆက်မှုကို အစားထိုး အသုံးပြုရန် ကျွန်ုပ်တို့ အကြံပြုရသည့် အကြောင်းရင်းနှစ်ခု ရှိပါသည်။
ru: Хотя CENO должен нормально работать по мобильному интернету, есть две причины, по которым мы рекомендуем использовать Wi-Fi соединение:
uk: Хоча CENO повинен нормально працювати через мобільний інтернет, є дві причини, через які ми рекомендуємо використовувати Wi-Fi-підключення:
ur: اگرچہ CENO کو موبائل کنکشن پر ٹھیک کام کرنا چاہیے، اس کی دو وجوہات ہیں کہ ہم اس کے بجائے Wi-Fi کنکشن استعمال کرنے کی تجویز کرتے ہیں:

source: CENO consumes an extra amount of data which may result in a higher phone bill (see above).
es: CENO consume una cantidad extra de datos, lo cual podría resultar en una tarifa de teléfono más alta (ver arriba).
fa: سنو مقدار بیشتری از داده‌ها را مصرف می‌کند که می‌تواند به قبض تلفن بیشتری منجر شود (به بالا بنگرید).
my: CENO သည် ဒေတာပမာဏ ပိုမိုအသုံးပြုခြင်းကြောင့် ဖုန်းဘေလ် ပိုမိုကုန်ကျနိုင်ပါသည် (အပေါ်တွင်ကြည့်ပါ)။
ru: CENO расходует дополнительный объем данных, что может привести к повышению расходов мобильной связи (см. выше).
uk: CENO витрачає додатковий трафік, що може призвести до підвищення витрат на мобільний зв'язок (дивіться вище).
ur: CENO اضافی مقدار میں ڈیٹا استعمال کرتا ہے جس کے نتیجے میں فون کا بل زیادہ ہو سکتا ہے (اوپر دیکھیں)۔

source: Can the CENO Browser replace my current browser (Chrome/Firefox/Safari)?
fa: آیا مرورگر سنو می‌تواند جایگزین مرورگر کنونی‌ام (کروم/فایرفاکس/سافاری) شود؟
my: CENO ဘရောက်ဇာသည် ကျွန်ုပ်၏ လက်ရှိ ဘရောက်ဇာ (Chrome/Firefox/Safari) ကို အစားထိုးနိုင်သလား။
ru: Может ли Браузер CENO заменить мой текущий браузер (Chrome/Firefox/Safari)?
uk: Чи може CENO замінити мій поточний браузер (Chrome/Firefox/Safari)?

source: Also, since CENO and Ouinet are still under development, you may experience some instability. That may also mean that backwards-incompatible changes are introduced which require you to uninstall the application or remove stored data (including bookmarks and site settings) before upgrading.
fa: همچنین، از آن‌جا که سنو و وینت هنوز در حال توسعه و تکمیل‌اند، شاید نوعی بی‌ثباتی را در کار با آن‌ها تجربه کنید. این می‌تواند به معنای آن هم باشد که تغییراتی ناسازگار با نسخه‌ی پیشین ایجاد شوند که به خاطر آن‌ها لازم باشد نرم‌افزار یا داده‌های ذخیره‌شده (از جمله نشانه‌گذاری‌ها و تنظیمات سایت‌ها) را پیش از به‌روزرسانی حذف کنید.

source: Can I use the CENO Browser to access Twitter, Facebook and Gmail?
fa: آیا می‌توانم برای دسترسی به توییتر، فیسبوک و جی‌میل از مرورگر سنو استفاده کنم؟
my: Twitter၊ Facebook နှင့် Gmail ကို ဝင်ရောက်သုံးစွဲရန် CENO ဘရောက်ဇာကို အသုံးပြုနိုင်သလား။
ru: Могу ли я использовать Браузер CENO для доступа к Twitter, Facebook и Gmail?
uk: Чи можу я використовувати браузер CENO для доступу до Twitter, Facebook та Gmail?

source: Can anyone see if I am using the CENO Browser to access censored Web sites?
fa: آیا کسی می‌فهمد که من از مرورگر سنو برای دسترسی به وب‌سایت‌های سانسورشده استفاده می‌کنم؟
my: ကျွန်ုပ်က CENO ဘရောက်ဇာကို အသုံးပြုပြီး ပိတ်ဆို့ထားသော ဝဘ်ဆိုက်များကို ဝင်ကြည့်သည်ကို အခြားသူများ သိနိုင်ပါသလား။
ru: Может ли кто-нибудь определить, использую ли я Браузер CENO для доступа к сайтам, подвергающимся цензуре?
uk: Чи може хто-небудь визначити, чи я використовую браузер CENO для доступу до сайтів, що підпадають під цензуру?

source: Does the CENO Browser use a lot of data?
fa: آیا مرورگر سنو از حجم انبوهی از داده‌ها استفاده می‌کند؟
my: CENO ဘရောက်ဇာသည် ဒေတာကို အများအပြား အသုံးပြုပါသလား။
ru: Много ли трафика потребляет Браузер CENO?
uk: Чи багато трафіку споживає браузер CENO?

source: Does the CENO Browser use a lot of battery on my device?
fa: آیا مرورگر سنو باتری دستگاه‌ام را خیلی مصرف می‌کند؟
my: CENO ဘရောက်ဇာသည် ကျွန်ုပ်၏စက်တွင် ဘက်ထရီများများ အသုံးပြုပါသလား။
ru: Потребляет ли Браузер CENO больше заряда батареи на моем устройстве?
uk: Чи сильно браузер CENO розряджає батарею на смартфоні?

source: Do I need to be connected to Wi-Fi to use the CENO Browser?
fa: آیا برای استفاده از مرورگر سنو لازم است به اینترنت وای‌فای وصل باشم؟
my: CENO ဘရောက်ဇာကို အသုံးပြုရန်အတွက် ဝိုင်ဖိုင်နှင့်ချိတ်ရန် လိုအပ်ပါသလား။
ru: Нужно ли мне подключаться к Wi-Fi для использования Браузера CENO?
uk: Чи потрібно підключатися до Wi-Fi для використання браузера CENO?
