Repository: censorship-no/ceno-docs
Catalog: user-manual/*/intro/faq.po
Languages: ar, de, es, fa, fr, id, my, pt_br, ru, tr, uk, ur

source: Frequently Asked Questions
ar: أسئلة شائعة
de: Häufig gestellte Fragen (FAQ)
es: Preguntas Más Frecuentes
fa: پرسش‌های متداول
fr: Foire aux questions
id: Tanya Jawab Umum
my: မေးလေ့ရှိသော မေးခွန်းများ
pt_br: Perguntas Mais Frequentes
ru: Часто задаваемые вопросы
tr: Sıkça sorulan sorular
uk: Часті питання
ur: اکثر پوچھے گئے سوالات

source: Usage
ar: استعمال
de: Nutzung
es: Uso
fa: کاربرد
fr: Utilisation
id: Penggunaan
my: သုံးစွဲပုံ
pt_br: Uso
ru: Использование
tr: Kullanım
uk: Використання
ur: استعمال

source: Can Ceno Browser replace my current browser (Chrome/Firefox/Safari)?
ar: هل يمكن لمتصفح Ceno أن يحل محل متصفحي الحالي (Chrome/Firefox/Safari)؟
de: Kann CENO Browser meinen aktuellen Browser (Chrome/Firefox/Safari) ersetzen?
fr: Le Navigateur Ceno peut-il remplacer mon navigateur actuel (Chrome, Firefox ou Safari) ?
id: Bisakah Peramban Ceno menggantikan perambanku saat ini (Chrome/Firefox/Safari)?
pt_br: O Navegador CENO pode substituir meu navegador atual (Chrome/Firefox/Safari)?
tr: Kullandığım tarayıcıyı (Chrome/Firefox/Safari) CENO Browser ile değiştirebilir miyim?

source: Short answer: yes, at least for some non-critical browsing.
ar: إجابة مختصرة: نعم، على الأقل لبعض عمليات التصفح غير الحرجة.
de: Kurze Antwort: Ja, zumindest bei einigen unkritischen Browsing-Vorgängen.
es: Respuesta corta: sí, al menos para alguna navegación que no sea crítica.
fa: پاسخ کوتاه: بله، دست‌کم برای مرور در حالت عادی.
fr: La réponse est oui, du moins pour certaines navigations non critiques.
id: Jawaban singkat: ya, setidaknya untuk beberapa penjelajahan nonkritis.
my: အဖြေတို - အနည်းဆုံး အရေးမကြီးသော ရှာဖွေမှုအချို့အတွက် အစားထိုးနိုင်သည်။
pt_br: Resposta curta: sim, ao menos para alguns tipos não-sensíveis de navegação.
ru: Краткий ответ: да, по крайней мере, для обычного просмотра страниц.
tr: Kısa yanıt: En azından aşırı önemli olmayan internet gezinmelerinizde evet.
uk: Коротка відповідь: так, принаймні для звичайного перегляду сторінок.
ur: مختصر جواب: ہاں، کم از کم کچھ غیر اہم براؤزنگ کے لیے۔

source: Since Ceno is based on Mozilla Firefox for Android, it provides all the features that are expected from a modern browser. However, its reliance on Ouinet technology for retrieving web content may affect its operation in subtle ways (some of them potentially involving your privacy).
ar: نظرًا لأن Ceno يعتمد على موزيلا فايرفكس لنظام أندرويد، فإنه يوفر جميع الميزات المتوقعة من متصفح حديث. ومع ذلك، فإن اعتماده على تقنية Ouinet لاسترداد محتوى الويب قد يؤثر على تشغيله بطرق خفية (قد يؤثر بعضها على خصوصيتك).
de: Da CENO auf Mozilla Firefox für Android basiert, bietet es alle Funktionen, die man von einem modernen Browser erwartet. Seine Abhängigkeit von der Ouinet-Technologie zum Abrufen von Webinhalten kann jedoch den Betrieb auf subtile Weise beeinträchtigen (einige davon betreffen möglicherweise Ihre Privatsphäre).
fr: Ceno étant fondé sur Firefox pour Android de Mozilla, il offre toutes les fonctions attendues d’un navigateur moderne. Cependant, le fait qu’il dépende de la technologie Ouinet pour récupérer les contenus Web peut affecter son fonctionnement de manière subtile (ce qui pourrait parfois affecter votre vie privée).
id: Karena Ceno didasarkan pada Mozilla Firefox untuk Android, Ceno menyediakan semua fitur yang diharapkan dari peramban modern. Namun, ketergantungannya pada teknologi Ouinet untuk mengambil konten web dapat memengaruhi operasinya dengan cara yang tidak kentara (beberapa di antaranya berpotensi melibatkan privasi Anda).
pt_br: Porque o CENO é baseado no Mozilla Firefox para Android, ele oferece todas as funcionalidades que são esperadas de um navegador moderno. No entanto, sua dependência da tecnologia Ouinet para recuperação de conteúdo web pode afetar sua operação de maneiras sutis (algumas delas podendo envolver sua privacidade).
tr: CENO, Mozilla tarafından geliştirilen Android için Firefox tarayıcısını temel alarak hazırlanmıştır. Bu nedenle günümüz tarayıcılarından beklenen tüm özellikleri sağlar. Fakat internet içeriğine, Ouinet teknolojisini kullanarak eriştiğinden çalışma şekli biraz farklı olabilir (bu farklardan birisi gizliliğinizle ilgilidir).

source: Also, since Ceno and Ouinet are under continuous development, you may experience some instability. That may also mean that backwards-incompatible changes are introduced which require you to uninstall the application or remove stored data (including bookmarks and site settings) before upgrading.
ar: أيضًا، نظرًا لأن Ceno و Ouinet قيد التطوير المستمر، فقد تلاحظ عدم إستقرار التطبيق. قد يعني ذلك أيضًا إدخال تعديلات غير متوافقة مع الإصدارات السابقة والتي تتطلب منك إلغاء تثبيت التطبيق أو إزالة البيانات المخزنة (بما في ذلك المفضلات وإعدادات الموقع) قبل ترقيته.
de: Da CENO und Ouinet ständig weiterentwickelt werden, kann es außerdem zu Instabilitäten kommen. Das kann auch bedeuten, dass rückwärtskompatible Änderungen eingeführt werden, die es erforderlich machen, die Anwendung zu deinstallieren oder gespeicherte Daten (einschließlich Lesezeichen und Website-Einstellungen) vor dem Upgrade zu entfernen.
fr: De plus, comme Ceno et Ouinet sont en développement continu, une certaine instabilité est possible. Cela peut également signifier que des changements non rétrocompatibles sont effectués, qui vous obligent à désinstaller l’application ou à supprimer les données stockées (dont les marque-pages et les paramètres du site) avant de la mettre à niveau.
id: Selain itu, karena Ceno dan Ouinet sedang dalam pengembangan berkelanjutan, Anda mungkin mengalami beberapa ketidakstabilan. Hal ini juga dapat berarti bahwa perubahan yang tidak kompatibel dengan versi sebelumnya akan diperkenalkan dan mengharuskan Anda untuk menghapus aplikasi atau menghapus data yang tersimpan (termasuk penanda dan pengaturan situs) sebelum melakukan pembaruan.
pt_br: Além disso, como CENO e Ouinet estão em constante desenvolvimento, você pode experienciar alguma instabilidade. Isso pode significar, também, a introdução de alterações incompatíveis com versões anteriores as quais demandam a desinstalação da aplicação ou remoção dos dados armazenados (incluindo marcadores e configurações de website).
tr: Ayrıca, CENO ve Ouinet sürekli geliştirildiğinden bazı dengesizliklerle karşılaşabilirsiniz. Bazı eskiyle uyumlu olmayan değişiklikler yapılmış olabilir ve uygulamayı ya da verilerini (yer imleri ve site ayarları) güncellemeden önce silip yeniden kurmanız gerekebilir.

source: For important work on Web sites not subject to censorship, we recommend that you use your habitual Web browser instead of Ceno. Please read the section on [risks](../concepts/risks.md) for more information.
ar: بالنسبة للأعمال المهمة على مواقع الويب التي لا تخضع للرقابة، نوصيك باستخدام متصفح الويب المعتاد بدلا من Ceno. يرجى قراءة القسم الخاص ب [المخاطر](../concepts/risks.md) لمزيد من المعلومات.
de: Für wichtige Arbeiten auf Websites, die nicht der Zensur unterliegen, empfehlen wir Ihnen, Ihren gewohnten Webbrowser anstelle von CENO zu verwenden. Bitte lesen Sie den Abschnitt über [Risiken](../concepts/risks.md) für weitere Informationen.
fr: Pour les travaux importants sur des sites Web non soumis à la censure, nous vous recommandons d’utiliser votre navigateur habituel au lieu de Ceno. Veuillez consultez la section sur les [risques](../concepts/risques.md) pour plus de précisions.
id: Untuk pekerjaan penting di situs web yang tidak terkena penyensoran, kami sarankan Anda untuk menggunakan peramban web yang biasa Anda gunakan, bukan Ceno. Silakan baca bagian [risiko](../konsep/risks.md) untuk informasi lebih lanjut.
pt_br: Para trabalhos importantes em websites não sujeitos a censura, recomendamos que você use seu navegador Web habitual ao invés de CENO. Por favor, leia a seção sobre [riscos](../concepts/risks.md) para mais informações.
tr: Sansür uygulanmayan sitelerdeki önemli işleriniz için CENO yerine normal tarayıcınızı kullanmanızı öneririz. Ayrıntılı bilgi almak için [tehlikeler](../concepts/risks.md) bölümünü okuyabilirsiniz.

source: Can I use Ceno Browser to access Twitter, Facebook and Gmail?
ar: هل يمكنني استخدام متصفح Ceno للوصول إلى Twitter و Facebook و Gmail؟
de: Kann ich CENO Browser für den Zugriff auf Twitter, Facebook und Gmail verwenden?
fr: Puis-je utiliser le Navigateur Ceno pour accéder à Twitter, Facebook et Gmail ?
id: Bisakah saya menggunakan Peramban Ceno untuk mengakses Twitter, Facebook, dan Gmail?
pt_br: Posso usar o Navegador CENO para acessar Twitter, Facebook e Gmail?
tr: Sosyal ağlara ve e-postalarıma CENO Browser ile erişebilir miyim?

source: Short answer: yes, by using private tabs.
ar: إجابة مختصرة: نعم ، باستخدام علامات التبويب الخاصة.
de: Kurze Antwort: Ja, indem Sie private Registerkarten verwenden.
es: Respuesta corta: sí, usando pestañas privadas.
fa: پاسخ کوتاه: بله، با استفاده از زبانه‌های خصوصی.
id: Jawaban singkat: ya, dengan menggunakan tab privat.
my: အဖြေတို - သီးသန့် တပ်ဗ်များ သုံး၍ အသုံးပြုနိုင်သည်။
ru: Краткий ответ: да, используя приватные вкладки.
uk: Коротка відповідь: так, використовуючи приватні вкладки.
ur: مختصر جواب: ہاں، نجی ٹیبز کا استعمال کرکے۔

source: Although Ceno strives to provide a user experience as similar to normal Web browsing as possible, some of the techniques used to avoid network interference do not play well with such dynamic sites. This is the case with Ceno's default mode of operation (i.e. public browsing), since it strips down all private data (like passwords and cookies) from Web traffic to ensure that it does not leak to other untrusted Ceno or Ouinet users.
ar: على الرغم من أن Ceno يسعى جاهدًا لتوفير تجربة مستخدم مماثلة لتصفح الويب العادي قدر الإمكان، إلا أن بعض التقنيات المستخدمة لتجنب تداخل الشبكة لا تعمل بشكل جيد مع المواقع الديناميكية. هذا هو الحال مع وضع التشغيل الافتراضي لـ Ceno (أي التصفح العام)، لأنه يزيل جميع البيانات الخاصة (مثل كلمات المرور وملفات تعريف الارتباط) من حركة مرور الويب لضمان عدم تسربها إلى مستخدمي Ceno أو Ouinet الآخرين غير الموثوق بهم.
de: Obwohl CENO bestrebt ist, ein Benutzererlebnis zu bieten, das dem normalen Web-Browsing so ähnlich wie möglich ist, funktionieren einige der Techniken, die zur Vermeidung von Netzwerkstörungen eingesetzt werden, nicht gut mit solchen dynamischen Websites. Dies ist bei der Standardbetriebsart von CENO (d. h. öffentliches Surfen) der Fall, da alle privaten Daten (wie Kennwörter und Cookies) aus dem Webverkehr entfernt werden, um sicherzustellen, dass sie nicht an andere, nicht vertrauenswürdige CENO- oder Ouinet-Nutzer gelangen.
fr: Bien que Ceno s’efforce de fournir une expérience utilisateur aussi proche que possible d’une navigation Web normale, certaines des techniques utilisées pour éviter les interférences du réseau ne sont pas adaptées à des sites aussi dynamiques. C’est le cas du mode de fonctionnement par défaut de Ceno (c.-à-d. la navigation publique), puisqu’il supprime toutes les données privées (telles que les mots de passe et les témoins) du trafic Web pour s’assurer qu’elles ne soient pas divulguées à d’autres utilisateurs de Ceno ou de Ouinet non dignes de confiance.
id: Meskipun Ceno berusaha keras untuk menyediakan pengalaman pengguna semirip mungkin dengan penjelajahan web biasa, beberapa teknik yang digunakan untuk menghindari gangguan jaringan tidak bekerja dengan baik pada situs-situs dinamis. Ini adalah kasus pada mode operasi bawaan Ceno (yaitu penjelajahan publik), karena Ceno menghapus semua data pribadi (seperti kata sandi dan kuki) dari lalu lintas web untuk memastikan bahwa data tersebut tidak bocor ke pengguna Ceno atau Ouinet yang tidak tepercaya.
pt_br: Apesar do esforço do CENO em oferecer uma experiência de usuário o mais similar possível à navegação Web normal, algumas das técnicas usadas para evitar a interferência da rede não funcionam bem com websites tão dinâmicos. É esse o caso do modo de operação padrão do CENO (isto é, navegação pública), pois retira todos os dados privados (como senhas e cookies) do tráfego Web para assegurar que não sejam vazados para outros usuários não confiáveis do CENO ou da Ouinet.
tr: CENO, olabildiğince normal internet gezinmesine benzer bir kullanıcı deneyimi sunmaya çalışır. Ancak ağ kısıtlamalarından kaçınmak için kullanılan bazı teknikler böyle devingen sitelerle iyi çalışmaz. Bu durum, varsayılan CENO çalışma kipi (yani, herkese açık gezinme) ile ilgilidir. Kişisel veriler (parolalar ve çerezler gibi), diğer güvenilmeyen CENO veya Ouinet kullanıcılarına sızmaması için internet trafiğinden çıkarılır.

source: To avoid this and enable the use of such dynamic sites in Ceno, you can use private tabs (i.e. private browsing), which leave private data intact and keep connections to the sites encrypted and thus protected from everyone else. However, this requires that network traffic from your device can reach those websites in some way.
ar: لتجنب ذلك وتمكين استخدام مثل هذه المواقع الديناميكية في Ceno، يمكنك استخدام علامات التبويب الخاصة (أي التصفح الخاص)، والتي تترك البيانات الخاصة كما هي وتحافظ على الاتصال بالمواقع مشفرًا وبالتالي محميًا من الآخرين. ومع ذلك، يتطلب هذا أن تصل حركة مرور الشبكة من جهازك إلى مواقع الويب هذه بطريقة ما.
de: Um dies zu vermeiden und die Nutzung solcher dynamischen Websites in CENO zu ermöglichen, können Sie private Registerkarten (d. h. privates Surfen) verwenden, bei denen private Daten intakt bleiben und die Verbindungen zu den Websites verschlüsselt und somit vor allen anderen geschützt sind. Dies setzt jedoch voraus, dass der Netzwerkverkehr von Ihrem Gerät diese Websites auf irgendeine Weise erreichen kann.
id: Untuk menghindari hal ini dan memungkinkan penggunaan situs dinamis seperti itu di Ceno, Anda dapat menggunakan tab privat (yaitu penjelajahan privat), yang membuat data pribadi tetap utuh dan menjaga agar koneksi ke situs selalu dienkripsi sehingga terlindungi dari orang lain. Namun, hal ini membutuhkan lalu lintas jaringan dari perangkat Anda untuk dapat mencapai situs-situs tersebut dengan cara tertentu.

source: For further details, please refer to the section on the differences between [public and private browsing](../concepts/public-private.md).
ar: لمزيد من التفاصيل، يرجى الرجوع إلى القسم الخاص بالاختلافات بين [التصفح العام والخاص](../concepts/public-private.md).
de: Weitere Einzelheiten entnehmen Sie bitte dem Abschnitt über die Unterschiede zwischen [öffentlichem und privatem Browsing](../concepts/public-private.md).
es: Para mayores detalles, por favor consulta la sección sobre las diferencias entre [navegación pública y privada](../concepts/public-private.md).
fa: برای جزئیات بیشتر، لطفاً به این بخش درباره‌ی تفاوت‌های میان [مرور عمومی و خصوصی](../concepts/public-private.md) مراجعه کنید.
id: Untuk rincian lebih lanjut, lihat bagian tentang perbedaan antara [penjelajahan publik dan privat](../concepts/public-private.md).
my: အသေးစိတ်အချက်အလက်များ သိလိုပါက [အများသုံးနှင့် သီးသန့် ရှာဖွေမှု](../concepts/public-private.md) အပိုင်းတွင် ကွာခြားချက်များကို ကြည့်နိုင်ပါသည်။
ru: Более подробную информацию можно найти в разделе о различиях между [публичным и приватным просмотром](../concepts/public-private.md).
uk: Більш детальну інформацію можна знайти в розділі про різницю між [публічним та приватним переглядом](../concepts/public-private.md).
ur: مزید تفصیلات کے لیے، براہ کرم [عوامی اور نجی براؤزنگ] (../concepts/public-private.md) کے درمیان فرق پر سیکشن دیکھیں۔

source: Privacy and security
ar: الخصوصية والأمن
de: Datenschutz und Sicherheit
es: Privacidad y seguridad
fa: حریم خصوصی و امنیت
fr: Confidentialité, protection des données et sécurité
id: Privasi dan keamanan
my: ကိုယ်ရေးလုံခြုံမှုနှင့် လုံခြုံရေး
pt_br: Privacidade e segurança
ru: Конфиденциальность и безопасность
tr: Gizlilik ve güvenlik
uk: Конфіденційність та безпека
ur: رازداری اور سیکورٹی

source: Will my device store content that I did not request?
ar: هل سيخزن جهازي المحتوى الذي لم أطلبه؟
de: Wird mein Gerät Inhalte speichern, die ich nicht angefordert habe?
es: ¿Mi dispositivo almacenará contenido que no solicité?
fa: آیا دستگاه من محتوایی را ذخیره خواهد کرد که خودم درخواست نکرده‌ام؟
fr: Mon appareil stockera-t-il des contenus que je n’ai pas demandés ?
id: Apakah perangkat saya menyimpan konten yang tidak saya minta?
my: ကျွန်ုပ်၏စက်ပစ္စည်းသည် ကျွန်ုပ်မတောင်းဆိုခဲ့သည့်အကြောင်းအရာများကို သိမ်းဆည်းမည်လား။
pt_br: Meu dispositivo irá armazenar conteúdo não solicitado por mim?
ru: Будет ли мое устройство хранить контент, который не был запрошен мной?
tr: Aygıtımda istemediğim içerikler depolanacak mı?
uk: Чи зберігатиме мій пристрій контент, який я не запитував?
ur: کیا میرا ڈیوائس اس مواد کو اسٹور کرے گا جس کی میں نے درخواست نہیں کی تھی؟

source: Short answer: no.
ar: إجابة مختصرة: لا.
de: Kurze Antwort: Nein.
es: Respuesta corta: no.
fa: پاسخ کوتاه: نه.
fr: La réponse est non.
id: Jawaban singkat: tidak.
my: အဖြေတို - မသိမ်းပါ။
pt_br: Resposta curta: não.
ru: Краткий ответ: нет.
tr: Kısa yanıt: Hayır.
uk: Коротка відповідь: ні.
ur: مختصر جواب: نہیں۔

source: Ceno only shares content that you requested (using [public browsing](../concepts/public-private.md)).
ar: يشارك Ceno المحتوى الذي طلبته فقط (باستخدام [التصفح العام](../concepts/public-private.md)).
de: CENO gibt nur Inhalte frei, die Sie angefordert haben (mit [öffentlichem Browsen](../concepts/public-private.md)).
id: Ceno hanya membagikan konten yang Anda minta (menggunakan [penjelajahan publik](../concepts/public-private.md)).

source: Please note that a malicious website may still try to trick your browser into retrieving content from other sites without your knowledge so as to force your device to store and share it with other users. While Firefox code already does a pretty good job at detecting and blocking such attempts, you should still avoid visiting suspicious sites.
ar: يرجى ملاحظة أن المواقع الإلكترونية الخبيثة قد تستمر في محاولة خداع متصفحك لاسترداد المحتوى من مواقع أخرى دون علمك وذلك لإجبار جهازك على تخزينه ومشاركته مع مستخدمين آخرين. بينما تقوم شيفرة فايرفكس بعمل جيد جدًا في اكتشاف مثل هذه المحاولات وحظرها، فلا يزال يتعين عليك تجنب زيارة المواقع المشبوهة.
de: Bitte beachten Sie, dass eine bösartige Website immer noch versuchen kann, Ihren Browser dazu zu bringen, ohne Ihr Wissen Inhalte von anderen Websites abzurufen, um Ihr Gerät zu zwingen, diese zu speichern und mit anderen Benutzern zu teilen. Obwohl der Firefox-Code solche Versuche bereits recht gut erkennt und blockiert, sollten Sie dennoch den Besuch verdächtiger Websites vermeiden.
es: Por favor ten en cuenta que un sitio web malicioso aún podría intentar engañar a tu navegador para descargar contenido desde otros sitios sin tu conocimiento, así como forzar a tu dispositivo a almacenarlo y compartirlo con otros usuarios. Mientras que el código de Firefox ya hace un trabajo bastante bueno para detectar y bloquear tales intentos, aún así deberías evitar visitar sitios sospechosos.
fa: لطفاً توجه کنید که یک وب‌سایت خرابکار ممکن است با این حال سعی کند تا مرورگرتان را فریب دهد تا بدون اطلاع‌تان محتوایی را از سایت‌های دیگر بازیابی کند تا این‌گونه دستگاه‌تان را وادار به ذخیره‌کردن و به‌اشتراک‌گذاشتن آن محتوا با کاربران دیگر کند. اگرچه کد فایرفاکس پیشاپیش این‌گونه تلاش‌ها را به‌خوبی شناسایی می‌کند و مانع آن‌ها می‌شود، شما بایستی با این حال از بازدید از سایت‌های مشکوک خودداری کنید.
fr: Notez qu’un site Web malveillant pourrait toujours essayer de tromper votre navigateur à récupérer le contenu d’autres sites à votre insu, afin de forcer votre appareil à le stocker et à le partager avec d’autres utilisateurs et utilisatrices. Bien que le code de Firefox fasse déjà un très bon travail pour détecter et bloquer de telles tentatives, vous devriez quand même éviter de visiter des sites suspects.
id: Harap perhatikan bahwa situs web jahat mungkin masih mencoba untuk mengelabui peramban Anda untuk mengambil konten dari situs lain tanpa sepengetahuan Anda sehingga memaksa perangkat Anda untuk menyimpan dan membagikannya ke pengguna lain. Meskipun kode Firefox sudah melakukan pekerjaan yang cukup baik dalam mendeteksi dan memblokir upaya semacam itu, Anda tetap harus menghindari kunjungan ke situs yang mencurigakan.
my: သတိပြုရန်မှာ အန္တရာယ်ရှိသော ဝဘ်ဆိုက်တစ်ခုခုသည် သင်မသိလိုက်ဘဲ သင့်ဘရောက်ဇာဖြင့် တခြားဝဘ်ဆိုက်များမှ အကြောင်းအရာများကို ပြန်လည်ရယူနိုင်ပြီး ထိုအကြောင်းအရာကို သင့်စက်တွင်သိုလှောင်၍ တခြားအသုံးပြုသူများနှင့် မျှဝေရန် အတင်းအကျပ် ပြုလုပ်နိုင်ပါသည်။ Firefox သင်္ကေတများသည် ထိုကဲ့သို့သော ဝဘ်ဆိုက်များမှ ကြိုးစားအားထုတ်မှုများကို ရှာဖွေဆန်းစစ်၍ ပိတ်ပင်ရာတွင် ကျွမ်းကျင်သော်လည်း သင်သည် သံသယဖြစ်စရာကောင်းသော ဝဘ်ဆိုက်များကို ဝင်ရောက်ကြည့်ရှုခြင်းအား ရှောင်ရှားသင့်သည်။
pt_br: Por favor, observe que um website malicioso pode ainda assim tentar induzir seu navegador a recuperar conteúdo de outros websites sem o seu conhecimento de modo a forçar seu dispositivo a armazenar e compartilhá-lo com outros usuários. Mesmo que o código do Firefox já faça um ótimo trabalho na detecção e bloqueio dessas tentativas, você deveria, mesmo assim, evitar fazer visitas a websites suspeitos.
ru: Обратите внимание, что вредоносный веб-сайт всё же может попытаться обмануть ваш браузер и получить контент с других сайтов без вашего ведома, чтобы заставить ваше устройство хранить и распространять его другим пользователям. Хотя код Firefox достаточно хорошо справляется с обнаружением и блокировкой таких попыток, вам все равно следует избегать посещения подозрительных сайтов.
tr: Unutmayın, kötü amaçlı bir site, sizden habersiz olarak aygıtınızı diğer kullanıcılarla paylaşmak üzere bazı içerikleri almaya zorlayabilir. Firefox kodu bu tür girişimleri algılayıp engellemekte oldukça iyi bir iş çıkarsa da, yine de şüpheli sitelere girmekten kaçınmanız önemlidir.
uk: Будь ласка, зверніть увагу, що шкідливий веб-сайт може спробувати обдурити ваш браузер і отримати контент з інших сайтів без вашого відома, щоб змусити ваш пристрій зберігати і поширювати його іншим користувачам. Хоча код Firefox досить добре справляється з виявленням та блокуванням таких спроб, вам все одно слід уникати відвідування підозрілих сайтів.
ur: براہ کرم نوٹ کریں کہ ایک بدنیتی پر مبنی ویب سائٹ اب بھی آپ کے علم کے بغیر آپ کے براؤزر کو دوسری سائٹوں سے مواد بازیافت کرنے کے لیے پھنسانے کی کوشش کر سکتی ہے تاکہ آپ کے ڈیوائس کو اسے اسٹور کرنے اور دوسرے صارفین کے ساتھ شیئر کرنے پر مجبور کیا جا سکے۔ اگرچہ فائر فاکس کوڈ پہلے سے ہی ایسی کوششوں کا پتہ لگانے اور اسے روکنے میں بہت اچھا کام کرتا ہے، پھر بھی آپ کو مشکوک سائٹس پر جانے سے گریز کرنا چاہیے۔

source: Read more about how your Ceno Browser retrieves and shares Web content with others [here](../concepts/how.md).
ar: اقرأ المزيد حول كيفية استرداد متصفح Ceno لمحتوى الويب ومشاركته مع الآخرين [هنا](../concepts/how.md).
de: Lesen Sie mehr darüber, wie Ihr CENO Browser Webinhalte abruft und mit anderen teilt [hier](../concepts/how.md).
fr: Apprenez [ici](../concepts/how.md) comment votre Navigateur Ceno récupère les contenus Web et les partage avec d’autres.
id: Baca lebih lanjut tentang bagaimana Peramban Ceno Anda mengambil dan berbagi konten web dengan orang lain [di sini](../concepts/how.md).
pt_br: Leia mais sobre como o Navegador CENO recupera e compartilha conteúdo Web com outros [aqui](../concepts/how.md).
tr: CENO Browser internet içeriğini nasıl alıp paylaştığı ile ilgili ayrıntılı bilgi almak için [buraya](../concepts/how.md) bakabilirsiniz.
