Repository: censorship-no/ceno-docs
Catalog: user-manual/*/intro/ouinet.po
Languages: ar, es, fr, ru, tr, uk

source: What is Ouinet?
ar: ما هو Ouinet؟
es: ¿Qué es Ouinet?
fr: Qu’est-ce que Ouinet ?
ru: Что такое Ouinet?
tr: Ouinet nedir?
uk: Що таке Ouinet?

source: [Ouinet][Ouinet] is a core technology that allows Ceno Browser to share Web content with other devices. Ouinet comes in the form of reusable computer code (a library) that an application like Ceno can use to become a participant in a network of cooperating nodes that communicate directly ([peer-to-peer][P2P] or P2P) to help access and store new Web content, and to request and deliver previously accessed content to others.
ar: [Ouinet][Ouinet] هي تقنية تسمح لمتصفح Ceno بمشاركة محتوى الويب مع الأجهزة الأخرى. يأتي Ouinet في شكل شفرة مصدرية (مكتبة) قابلة لإعادة الاستخدام، يمكن أن يستخدمه تطبيق مثل Ceno ليصبح جزءا من شبكة من العقد المتعاونة التي تتواصل مباشرة ([نظير لنظير][P2P] أو P2P) لتسهيل الوصول إلى محتوى ويب جديد وتخزينه، وأيضا لطلب محتوى تم الوصول إليه مسبقًا وتقديمه للآخرين.
es: [Ouinet][Ouinet] es una tecnología esencial que le permite al Navegador CENO compartir contenido Web con otros dispositivos. Ouinet se presenta en forma de código de computadora reutilizable (una biblioteca) que una aplicación como CENO puede usar para tornarse en participante en una red de nodos cooperativos que se comunican directamente ([par a par][P2P] o P2P) para ayudar a acceder y almacenar nuevo contenido Web, y solicitar y entregar contenido previamente accedido a otros.
fr: [Ouinet][Ouinet] est une technologie de base qui permet au Navigateur Ceno de partager du contenu Web avec d’autres appareils. Ouinet se présente sous la forme d’un code informatique réutilisable (une bibliothèque) qu’une application telle que Ceno peut utiliser pour participer à un réseau de nœuds coopératifs qui communiquent directement ([pair à pair][Pair à pair] pour faciliter l’accès aux nouveaux contenus Web et leur stockage, ainsi que pour demander et fournir à d’autres des contenus auxquels ils ont déjà accédé.
tr: [Ouinet][Ouinet], internet içeriklerinin CENO Browser üzerinden diğer aygıtlara paylaşılmasını sağlayan bir teknolojidir. Ouinet, CENO gibi uygulamaların, yeni içeriğe erişim sağlamak ve önceden erişilen içeriği diğer kullanıcılara sunmak için doğrudan iletişim ([eşler arası][P2P] veya P2P) kurarak işbirliği yaptığı katılımcılardan oluşan ağa katılmalarını sağlayan bir kod kitaplığıdır.

source: Ouinet is based on a clever combination and use of existing technologies to accomplish each of its functionalities: locating other participants is done with techniques coming from the world of file-sharing (BitTorrent's distributed hash table), communicating with them uses common Web and file-sharing protocols (HTTP proxy requests and BitTorrent's µTP), and modern industry standards ensure the security of communications and the authenticity of exchanged content (TLS encryption and Ed25519 signatures). Ouinet allows replacing particular technologies with others if needed (for instance, some uses of µTP can be replaced by Tor's Pluggable Transports).
ar: يعتمد Ouinet على استخدام ومزج ذكي لتقنيات متوافرة لإنجاز كل من وظائفه: تحديد موقع المشاركين الآخرين يتم باستخدام تقنيات قادمة من عالم مشاركة الملفات (جدول هاشات الموزع الخاص ببت تورنت BitTorrent)، والتواصل معهم يستخدم بروتوكولات الويب ومشاركة الملفات الشائعة (طلبات وكيل HTTP و μTP من بت تورنت BitTorrent)، وتضمن معايير الصناعة الحديثة أمان الاتصالات وأمانة المحتوى المتبادل، (تشفير TLS وتوقيعات Ed25519). يسمح Ouinet باستبدال تقنيات معينة بأخرى إذا لزم الأمر (على سبيل المثال، يمكن استبدال بعض استخدامات μTP بوسائل النقل القابلة للتوصيل من Tor).
es: Ouinet está basada en una combinación y uso inteligentes de tecnologías existentes para lograr cada una de sus funcionalidades: la ubicación de otra(o)s participantes se hace con técnicas provenientes del mundo de la compartición de archivos (la tabla de hash distribuida de BitTorrent), la comunicación con ellos usa protocolos comunes Web y de compartición de archivos (solicitudes proxy HTTP y el µTP de BitTorrent), y estándares modernos de la industria afirman la seguridad de las comunicaciones y la autenticidad del contenido intercambiado (cifrado TLS y firmas Ed25519). Ouinet permite el reemplazo de tecnologías particulares con otras, de ser necesario (por ejemplo, algunos usos de µTP pueden ser reemplazados por los Transportes Conectables de Tor).
fr: Ouinet repose sur une ingénieuse combinaison de technologies existantes et sur leur utilisation pour accomplir chacune de ses fonctions : la localisation d’autres participants.tes se fait avec des techniques provenant du monde du partage de fichiers (la table de hachage distribuée de BitTorrent), la communication avec eux.elles fait appel à des protocoles Web et de partage de fichiers courants (les requêtes au mandataire HTTP et µTP de BitTorrent), et les normes modernes du secteur assurent la sécurité des communications et l’authenticité des contenus échangés (le chiffrement TLS et les signatures Ed25519). Ouinet permet au besoin de remplacer certaines technologies par d’autres (par exemple, certaines utilisations de µTP peuvent être remplacées par les transports enfichables de Tor).
ru: Ouinet основан на изобретательном сочетании существующих технологий для реализации своего функционала: поиск других участников осуществляется с помощью методов, пришедших из обмена файлами (распределенные хэш-таблицы BitTorrent), для связи с ними используются стандартные протоколы как Web, так и файлообмена (прокси-запросы HTTP и µTP BitTorrent), а отраслевые стандарты обеспечивают безопасность связи и подлинность контента (шифрование TLS и подписи Ed25519). Ouinet позволяет при необходимости заменять одни технологии другими (например, в некоторых случаях µTP можно заменить на подключаемые транспорты Tor).
tr: Ouinet, işlevlerini gerçekleştirmek için var olan teknolojiler zekice bir araya getirilerek kullanılmıştır: Diğer katılımcıları bulmak, dosya paylaşımı dünyasından gelen tekniklerle yapılır (BitTorrent dağıtılmış karma tablosu), katılımcılarla iletişim, ortak internet ve dosya paylaşım iletişim kuralları ile gerçekleştirilir (HTTP vekil sunucu istekleri ve BitTorrent µTP) ve güncel standartlar, iletişim ve değiştirilen içeriğin güvenilirliğini doğrular (TLS şifreleme ve Ed25519 imzaları). Ouinet, gerektiğinde belirli teknolojilerin başka teknolojilerle değiştirilmesine izin verir (örneğin µTP yerine Tor Değiştirilebilir Taşıyıcıları kullanılabilir).
uk: Ouinet заснований на винахідливому поєднанні існуючих технологій для реалізації свого функціоналу: пошук інших учасників здійснюється за допомогою методів, що прийшли з обміну файлами (розподілені хеш-таблиці BitTorrent), для зв'язку з ними використовуються стандартні вееб-протоколи, файлообміну (проксі-запити HTTP та µTP BitTorrent), а галузеві стандарти забезпечують безпеку зв'язку та справжність контенту (шифрування TLS та підписи Ed25519). Ouinet дозволяє за необхідності замінювати одні технології іншими (наприклад, у деяких випадках µTP можна замінити на транспорти Tor).

source: On mobile devices, Ouinet can be embedded into end-user applications (as an Android library). In computers, it can be used by normal Web clients like browsers (as a local HTTP proxy).
ar: على الأجهزة المحمولة، يمكن تضمين Ouinet في تطبيقات المستخدم النهائي (على شكل مكتبة أندرويد Android). في أجهزة الكمبيوتر، يمكن استخدامه من قبل عملاء الويب العاديين مثل المتصفحات (على شكل وكيل HTTP محلي).
es: En dispositivos móviles, Ouinet puede ser incluida dentro de aplicaciones de usuario final (como una biblioteca Android). En computadoras, puede ser usada por clientes Web normales, como navegadores (como proxy HTTP local).
fr: Sur les appareils mobiles, Ouinet peut être intégré dans les applications des utilisateurs finaux (en tant que bibliothèque Android). Sur les ordinateurs, il peut être utilisé par des clients Web normaux tels que les navigateurs (en tant que mandataire HTTP local).
ru: На мобильных устройствах Ouinet может быть встроен в приложения (как библиотека Android). На компьютерах он может использоваться обычными веб-клиентами, такими как браузеры (как локальный HTTP-прокси).
tr: Ouinet mobil aygıtlarda son kullanıcı uygulamaları ile bütünleştirilebilir (Android kitaplığı olarak). Bilgisayarlarda ise (yerel HTTP vekil sunucusu olarak) tarayıcılar gibi normal internet istemcileri tarafından kullanılabilir.
uk: На мобільних пристроях Ouinet може бути вбудований у додатки (як бібліотека Android). На комп'ютерах він може використовуватися звичайними веб-клієнтами, такими, як браузери (як локальний HTTP-проксі).

source: Same as Ceno Browser, Ouinet is developed by [eQualitie][eQualitie] as Free/Libre/Open-Source software.
ar: مثل متصفح Ceno، تم تطوير Ouinet بواسطة [eQualitie][eQualitie] كبرنامج مجاني و حر و مفتوح المصدر.
es: Al igual que el Navegador CENO, Ouinet está desarrollada por [eQualitie][eQualitie] como software Gratis/Libre/de Código Abierto.
fr: Comme c’est le cas du Navigateur Ceno, Ouinet est développé par [eQualitie][eQualitie] en tant que logiciel libre et à code source ouvert.
tr: CENO Browser gibi, Ouinet yazılımı da [eQualitie][eQualitie] tarafından özgür ve açık kaynaklı olarak geliştirilmiştir.

source: Who is it for?
ar: لمن يصلح Ouinet؟
es: ¿Para quién es?
fr: À qui s’adresse Ouinet ?
ru: Для кого он предназначен?
tr: Kimler içindir?
uk: Для кого це?

source: Ouinet is mostly useful for software developers, content creators and publishers who want to enable users of their applications to share retrieved content with other users. This reduces the overall demand on the application server and improves content accessibility for users living in countries that block access to that server.
ar: Ouinet مفيد في الغالب لمطوري البرامج ومنشئي المحتوى والناشرين الذين يرغبون في تمكين مستخدمي تطبيقاتهم من مشاركة المحتوى المسترد مع مستخدمين آخرين. يؤدي ذلك إلى تقليل الطلب الإجمالي على خادم التطبيق ويحسن إمكانية الوصول إلى المحتوى للمستخدمين الذين يعيشون في البلدان التي تمنع الوصول إلى هذا الخادم.
es: Ouinet es mayormente útil para desarrolladora(e)s de software, creadora(e)s de contenido y publicistas que quieren habilitar a usuaria(o)s de sus aplicaciones compartir contenido descargado con otra(o)s usuaria(o)s. Esto reduce la demanda general en el servidor de aplicación y mejora la accesibilidad del contenido para usuaria(o)s viviendo en países que bloquean el acceso a ese servidor.
fr: Ouinet est surtout utile pour les développeurs de logiciels, les créateurs de contenu et les éditeurs qui souhaitent permettre aux utilisateurs et aux utilisatrice de leurs applications de partager avec d’autres le contenu récupéré. Cela réduit la demande globale sur le serveur d’application et améliore l’accessibilité du contenu pour les ceux et celles situés dans des pays où l’accès à ce serveur est bloqué.
ru: Ouinet в основном полезен для разработчиков программного обеспечения, создателей контента и издателей, которые хотят дать пользователям своих приложений возможность делиться полученным контентом с другими пользователями. Это снижает общую нагрузку на серверы приложений и улучшает доступность контента для пользователей, проживающих в странах, которые блокируют доступ к этим серверам.
tr: Ouinet, uygulama geliştiriciler, içerik oluşturucular ve yayıncılar için yararlıdır. Kullanıcıların alınan içeriği diğer kullanıcılarla paylaşmasını sağlar. Uygulama sunucusuna yapılan genel istekleri azaltır ve bu sunucuya erişimin engellendiği ülkelerde yaşayan kullanıcılar için içeriğin erişilebilirliğini artırır.
uk: В основному, Ouinet корисний для розробників програмного забезпечення, творців контенту та видавців, які хочуть дати користувачам своїх програм можливість ділитися отриманим контентом з іншими користувачами. Це знижує загальне навантаження на сервери додатків та покращує доступність контенту для користувачів, які проживають у країнах, де блокують доступ до цих серверів.

source: Please note that Ouinet is an evolving experimental project: some features may not work reliably enough in certain scenarios, bugs may exist and crashes may occur. We encourage you to reach out to us at [cenoers@equalitie.org](mailto:cenoers@equalitie.org), test it and report back - your feedback is very welcome!
ar: يرجى ملاحظة أن Ouinet هو مشروع تجريبي يتطور: قد لا تعمل بعض الميزات بشكل أمثل في في سيناريوهات معينة، وقد توجد أخطاء وقد تحدث أعطال. نحن نشجعك على التواصل معنا على [cenoers@equalitie.org](mailto:cenoers@equalitie.org)، اختبره وأعلمنا - نرحب بتعليقاتك!
es: Por favor ten en cuenta que Ouinet es un proyecto experimental en evolución: algunas características pudieran no funcionar en forma suficientemente confiable en ciertos escenarios, pudieran existir errores y ocurrir bloqueos. Te animamos a contactarnos a [cenoers@equalitie.org](mailto:cenoers@equalitie.org), probarla e informar - ¡tu comentario es muy bienvenido!
tr: Unutmayın, Ouinet hala gelişmekte olan deneysel bir projedir. Bazı özellikler belirli senaryolarda yeterince dengeli çalışmayabilir. Hatalar ve çökmeler oluşabilir. Sizden denemenizi ve [cenoers@equalitie.org] adresinden bize geri bildirim göndermenizi rica ediyoruz!

source: **Warning:** *Ouinet is not an anonymity tool*. If you are unsure about its adequacy for a certain task, do not hesitate to contact us.
ar: **تحذير:** *Ouinet ليس أداة إخفاء هوية*. إذا لم تكن متأكدا من مدى ملاءمته لمهمة معينة، فلا تتردد في الاتصال بنا.
es: **Advertencia:** *Ouinet no es una herramienta de anonimato*. Si no estás segura(o) acerca de si es adecuada para una cierta tarea, no dudes en contactarnos.
fr: **Avertissement :** *Ouinet n’est pas un outil d’anonymisation*. Si vous avez des doutes sur pertinence pour une tâche donnée, n’hésitez pas à nous contacter.
ru: **Внимание:** *Ouinet не обеспечивает анонимность*. Если вы не уверены в его способности справиться с определенной задачей, не стесняйтесь обращаться к нам.
tr: **Uyarı** *Ouinet bir anonimlik aracı değildir*. Belirli bir amaç için kullanabileceğinizden emin değilseniz, bize sormaya çekinmeyin.
uk: **Увага:** *Ouinet не забезпечує анонімність*. Якщо ви не впевнені у його здатності впоратися з певним завданням, не соромтеся звертатися до нас.

source: [P2P]: https://en.wikipedia.org/wiki/Peer-to-peer
ar: [نظير لنظير P2P]: https://ar.wikipedia.org/wiki/%D9%86%D8%AF_%D9%84%D9%86%D8%AF
es: [P2P]: https://es.wikipedia.org/wiki/Peer-to-peer
fr: [Pair à pair] : https://fr.wikipedia.org/wiki/Pair-%C3%A0-pair
ru: [P2P]: https://ru.wikipedia.org/wiki/%D0%9E%D0%B4%D0%BD%D0%BE%D1%80%D0%B0%D0%BD%D0%B3%D0%BE%D0%B2%D0%B0%D1%8F_%D1%81%D0%B5%D1%82%D1%8C
tr: [P2P]: https://tr.wikipedia.org/wiki/Peer-to-peer
uk: [P2P]: https://uk.wikipedia.org/wiki/Peer-to-peer

source: [eQualitie]: https://equalit.ie/
fr: [eQualitie] : https://equalit.ie/fr/

source: [Ouinet][Ouinet] is a core technology that allows the CENO browser to share Web content with other devices. Ouinet comes in the form of reusable computer code (a library) that an application like CENO can use to become a participant in a network of cooperating nodes that communicate directly ([peer-to-peer][P2P] or P2P) to help access and store new Web content, and to request and deliver previously accessed content to others.
ru: [Ouinet][Ouinet] — это ключевая технология, которая позволяет браузеру CENO обмениваться веб-контентом с другими устройствами. Ouinet поставляется в виде библиотеки (набора методов и функций), которую подобные CENO приложения могут использовать, чтобы стать участником пиринговой ([peer-to-peer][P2P] или P2P) сети, где узлы взаимодействуют друг с другом напрямую для обеспечения доступа к веб-контенту и его хранения, а также для запроса и доставки ранее полученного контента другим пользователям.
uk: [Ouinet][Ouinet] — це ключова технологія, яка дозволяє браузеру CENO обмінюватися веб-контентом з іншими пристроями. Ouinet поставляється у вигляді бібліотеки (набору методів і функцій), яку подібні програми, як то CENO можуть використовувати, щоб стати учасником пірінгової ([peer-to-peer][P2P] або P2P) мережі, де вузли взаємодіють один з одним безпосередньо для забезпечення доступу до веб-контенту та його зберігання, а також для запиту та доставки раніше отриманого контенту іншим користувачам.

source: Same as the CENO Browser, Ouinet is developed by [eQualitie][eQualitie] as Free/Libre/Open-Source software.
ru: Как и браузер CENO, Ouinet разработан компанией [eQualitie][eQualitie] как свободное и бесплатное программное обеспечение с открытым исходным кодом.
uk: Як і браузер CENO, Ouinet розроблений компанією [eQualitie][eQualitie] як вільне та безкоштовне програмне забезпечення з відкритим вихідним кодом.

source: Please note that Ouinet is an evolving experimental project: some features may not work reliably enough in certain scenarios, bugs may exist and crashes may occur. We encourage you to reach out to us at [cenoers@equalit.ie](mailto:cenoers@equalit.ie), test it and report back - your feedback is very welcome!
ru: Обратите внимание, что Ouinet — это развивающийся экспериментальный проект: в определенных случаях некоторые функции могут работать недостаточно стабильно; также могут встречаться ошибки и происходить сбои. Мы просим вас связаться с нами по адресу [cenoers@equalit.ie](mailto:cenoers@equalit.ie) и сообщить о вашем опыте — будем рады вашим отзывам!
uk: Будь ласка, зверніть увагу, що Ouinet — це експериментальний проект, що розвивається: у певних випадках деякі функції можуть працювати недостатньо стабільно; також можуть зустрічатися помилки та відбуватися збої. Ми просимо вас зв'язатися з нами за адресою [cenoers@equalit.ie](mailto:cenoers@equalit.ie) та повідомити про ваш досвід — будемо раді вашим відгукам!
