Repository: censorship-no/ceno-docs
Catalog: user-manual/*/intro/qsg.po
Languages: ar, el, es, fa, fr, id, my, pt, pt_br, ru, tr, uk, ur

source: Quick start guide
ar: دليل البدء السريع
el: Οδηγός γρήγορης εκκίνησης
es: Guía de inicio rápido
fa: راهنمای آغاز سریع
fr: Guide de démarrage
id: Panduan mulai cepat
my: အသုံးပြုပုံလမ်းညွှန် (အကျဉ်းချုပ်)
pt: Guia de início rápido
pt_br: Guia para Início Rápido
ru: Краткое руководство
tr: Hızlı başlangıç rehberi
uk: Короткий посібник
ur: فوری آغاز گائیڈ

source: Ceno Browser allows you to access any website on the Internet, even if it is censored in your country. Ceno uses a peer-to-peer infrastructure to route your requests, as well as to store and share retrieved content with others. [Read more about Ceno](ceno.md).
ar: يسمح لك متصفح Ceno بالوصول إلى أي موقع ويب على الإنترنت، حتى لو كان خاضعا للرقابة في بلدك. يستخدم Ceno بنية تحتية من نظير إلى نظير لتوجيه طلباتك، بالإضافة إلى تخزين ومشاركة المحتوى الذي تم استرداده مع الآخرين. [اقرأ المزيد عن Ceno](ceno.md).
el: Το CENO Browser σας επιτρέπει να έχετε πρόσβαση σε οποιονδήποτε ιστότοπο, ακόμη και αν λογοκρίνεται στη χώρα σας. Το CENO χρησιμοποιεί μια υποδομή από χρήστη σε χρήστη για τη δρομολόγηση των αιτημάτων σας, καθώς και για την αποθήκευση και την κοινή χρήση του ανακτηθέντος περιεχομένου με άλλους. [Δείτε περισσότερα για το CENO](ceno.md).
fa: مرورگر CENO به شما امکان دسترسی به هر وب‌سایتی روی اینترنت را می‌دهد، حتی اگر آن وب‌سایت در کشورتان سانسور شده باشد. CENO از یک زیرساخت همتا-به-همتا استفاده می‌کند تا درخواست‌های شما را رهیابی کند، و نیز محتوای بازیابی‌شده را ذخیره نماید و با دیگران به اشتراک گذارد. [درباره‌ی سنو بیشتر بخوانید](ceno.md).
fr: Le Navigateur Ceno vous permet d’accéder à n’importe quel site Web sur Internet, même s’il est censuré dans votre pays. Ceno utilise une infrastructure pair à pair pour acheminer vos demandes, ainsi que pour stocker et partager le contenu récupéré avec d’autres. [En apprendre davantage sur Ceno](ceno.md).
id: CENO Browser mengizinkan anda untuk akses situs web apapun di Internet, sekalipun jika disensor di negara anda. CENO menggunakan infrastruktur peer-to-peer untuk merutekan permintaan anda, sebagaimana untuk menyimpan dan membagikan konten yang diambil dengan lainnya. [Baca lebih lanjut tentang CENO](ceno.md).
pt: O CENO Browser permite-lhe aceder a qualquer website na Internet, mesmo que seja censurado no seu país. CENO utiliza uma infraestrutura peer-to-peer para encaminhar os seus pedidos, bem como para armazenar e partilhar conteúdos recuperados com outros. [Leia mais sobre CENO](ceno.md).
tr: CENO Browser, ülkenizde yasaklanmış olsa bile internet üzerindeki tüm sitelere erişmenizi sağlar. CENO siteye yaptığınız erişim isteklerini yönlendirmek ve başkaları ile paylaşmak üzere kaydetmek için eşler arası bir altyapı kullanır. [CENO hakkında ayrıntılı bilgi alın](ceno.md).
ur: Ceno براؤزر آپ کو انٹرنیٹ پر کسی بھی ویب سائٹ تک رسائی کی اجازت دیتا ہے، چاہے وہ آپ کے ملک میں سنسر ہو۔ Ceno آپ کی درخواستوں کو روٹ کرنے کے ساتھ بازیافت شدہ مواد کو دوسروں کے ساتھ ذخیرہ کرنے اور ان کا اشتراک کرنے کے لیے پیئر ٹو پیئر انفراسٹرکچر کا استعمال کرتا ہے۔ [Ceno کے بارے میں مزید پڑھیں](ceno.md)۔

source: How to get started
ar: كيفية البدء
el: Πως να ξεκινήσετε
es: Cómo empezar
fa: چگونه آغاز کنید
fr: Commencer
id: Bagaimana cara memulainya
my: ဘယ်လို စတင် အသုံးပြုရမလဲ
pt: Como começar
pt_br: Como começar
ru: Как начать
tr: Nasıl kullanmaya başlayabilirsiniz
uk: Як почати
ur: شروع کرنے کا طریقہ

source: You will need an Android device:
ar: ستحتاج إلى جهاز أندرويد (Android):
el: Θα χρειαστείτε μια συσκευή Android:
es: Necesitarás un dispositivo Android:
fa: شما به یک دستگاه اندروید نیاز خواهید داشت:
fr: Vous aurez besoin d’un appareil Android :
id: Anda membutuhkan sebuah perangkat Android:
my: Android စနစ် အသုံးပြုသော စက်ကိရိယာတစ်ခု လိုအပ်ပါသည် -
pt: Vai precisar de um dispositivo Android:
pt_br: Você vai precisar de um dispositivo Android:
ru: Вам потребуется устройство Android:
tr: Android bir aygıta gerek duyacaksınız:
uk: Вам знадобиться пристрій Android:
ur: آپ کو ایک اینڈرائیڈ ڈیوائس کی ضرورت ہوگی:

source: Install Ceno Browser from [Google Play][ceno-gplay], [GitHub][ceno-gh] or [Paskoocheh][ceno-pask]. *No special permissions are needed*.
ar: قم بتثبيت متصفح Ceno من [Google Play][ceno-gplay] أو [GitHub][ceno-gh] أو [Paskoocheh][ceno-pask]. *ليست هناك حاجة إلى أذونات خاصة*.
el: Εγκαταστήστε το CENO Browser από τα [Google Play][ceno-gplay], [GitHub][ceno-gh] ή το [Paskoocheh][ceno-pask]. *Δεν απαιτούνται ειδικά δικαιώματα*.
fa: مرورگر CENO را از [گوگل پلی][ceno-gplay]، [گیت‌هاب][ceno-gh] یا [پس‌کوچه][ceno-pask] دریافت و نصب کنید. *به هیچ جواز خاصی نیازی نیست*.
fr: Installez le Navigateur Ceno de [Google Play][ceno-gplay], [GitHub][ceno-gh] ou de [Paskoocheh][ceno-pask]. *Aucune autorisation particulière n’est nécessaire*.
id: Pasang CENO Browser dari [Google Play][ceno-gplay], [GitHub][ceno-gh] atau [Paskoocheh][ceno-pask]. *Tidak ada izin khusus yang dibutuhkan*.
pt: Instalar o CENO Browser de [Google Play][ceno-gplay], [GitHub][ceno-gh] ou [Paskoocheh][ceno-pask]. *Não são necessárias permissões especiais*.
tr: CENO Browser uygulamasını [Google Play][ceno-gplay], [GitHub][ceno-gh] ya da [Paskoocheh (Türkçe desteklenmiyor)][ceno-pask] üzerinden indirin. *Hiçbir özel izin vermeniz gerekmez*.
ur: [Google Play][ceno-gplay]، [GitHub][ceno-gh] یا [Paskoocheh][ceno-pask] سے Ceno براؤزر انسٹال کریں۔ *کسی خاص اجازت کی ضرورت نہیں ہے*۔

source: Run it.
ar: قم بتشغيله.
el: Εκτελέστε το.
es: Ejecútalo.
fa: آن را اجرا کنید.
fr: Lancez-le.
id: Jalankan.
my: စတင်လည်ပတ်ပါ။
pt: Execute-o.
pt_br: Execute-o.
ru: Запустите его.
tr: Uygulamayı açın.
uk: Запустіть його.
ur: اسے چلائیں۔

source: Browse pages normally to help other users access them; if concerned about privacy for some page or if it is not loading as expected, use a private tab (see [public vs. private browsing](../concepts/public-private.md)).
ar: تصفح الصفحات بشكل طبيعي لمساعدة المستخدمين الآخرين على الوصول إليها؛ إذا كنت قلقا بشأن خصوصية صفحة ما أو إذا لم يتم تحميلها كما هو متوقع، فاستخدم علامة تبويب خاصة (راجع [التصفح العام مقابل التصفح الخاص](../concepts/public-private.md)).
el: Περιηγηθείτε κανονικά σε ιστότοπους για να βοηθήσετε άλλους χρήστες να έχουν πρόσβαση σε αυτούς. Εάν ανησυχείτε για το απόρρητο κάποιας σελίδας ή εάν δε φορτώνεται κανονικά, χρησιμοποιήστε μια ιδιωτική καρτέλα (δείτε [δημόσια έναντι ιδιωτικής περιήγησης](../concepts/public-private.md)).
es: Navega las páginas normalmente para ayudar a otros usuarios a accederlas; si estás preocupado acerca de la privacidad por alguna página, o si no está siendo cargada como es de esperar, usa una pestaña privada (ver [navegación pública vs. privada](../concepts/public-private.md)).
fa: مانند معمول صفحه‌ها را مرور کنید تا به کاربران دیگر نیز کمک کنید به آن‌ها دسترسی پیدا کنند؛ اگر در مورد صفحه‌ای دلواپس حریم خصوصی‌تان بودید یا اگر صفحه‌ای مطابق انتظارتان بار نشد، از یک زبانه‌ی خصوصی استفاده کنید (بنگرید به [مقایسه‌ی مرور عمومی و مرور خصوصی](concepts/public-private.md/..).
fr: Parcourez les pages normalement pour aider les autres utilisateurs et utilisatrices à y accéder ; si vous êtes préoccupé par la confidentialité d’une page ou si elle ne se charge pas comme prévu, utilisez un onglet privé (voir [La navigation publique comparée à la navigation privée](../concepts/public-private.md)).
id: Jelajahi halaman secara normal untuk membantu pengguna lain untuk mengaksesnya. Jika khawatir mengenai privasi untuk beberapa halaman atau jika tidak memuat seperti yang diharapkan, gunakan tab privat (lihat [penjelajahan publik vs. privat](../concepts/public-private.md)).
my: အခြားအသုံးပြုသူများ ဝင်‌ရောက်ကြည့်ရှုနိုင်ရန် အင်တာနက်စာမျက်နှာများကို ပုံမှန်အတိုင်းရှာဖွေပါ။ အင်တာနက်စာမျက်နှာတစ်ခုခုနှင့် ပတ်သက်၍ လုံခြုံရေးပိုင်းကို သံသယရှိပါက (သို့) သင်ထင်ထားသလို တက်မလာပါက သီးသန့်တပ်ဗ်ကို အသုံးပြုပါ ([အများသုံးနှင့် သီးသန့် ရှာဖွေခြင်း](../concepts/public-private.md) ကိုကြည့်ပါ)။
pt_br: Navegue pelas páginas normalmente para ajudar de outros usuários a acessá-las; se houver preocupações sobre a privacidade para algumas páginas ou se não estiver carregando como deveria, use uma aba privativa (veja [navegação pública versus privativa](../concepts/public-private.md)).
ru: Просматривайте страницы как обычно, чтобы помочь другим пользователям получить к ним доступ; если вас беспокоит конфиденциальность какой-то страницы или если она загружается не так, как ожидалось, используйте приватную вкладку (см. раздел [публичного и приватного просмотра страниц](../concepts/public-private.md)).
tr: Başka kullanıcıların da erişmesine yardımcı olarak internette normal bir şekilde gezinin. Gizlilik endişeleriniz varsa ya da bir sayfa farklı şekilde yükleniyorsa, gizli sekme kullanın ([herkese açık ve gizli genizme karşılaştırması](../concepts/public-private.md) bölümüne bakabilirsiniz).
uk: Переглядайте сторінки як завжди, щоб допомогти іншим користувачам отримати доступ до них; якщо вас непокоїть конфіденційність якоїсь сторінки або якщо вона завантажується не так, як очікувалося — використовуйте приватну вкладку (дивіться [публічний чи приватний. перегляд сторінок](../concepts/public-private.md)).
ur: عام طور پر صفحات کو براؤز کریں تاکہ دوسرے صارفین کو ان تک رسائی میں مدد ملے۔ اگر کسی صفحے کی رازداری کے بارے میں فکر مند ہو یا اگر یہ توقع کے مطابق لوڈ نہیں ہو رہا ہے تو، ایک نجی ٹیب استعمال کریں (دیکھیں [عوامی بمقابلہ نجی براؤزنگ](../concepts/public-private.md))۔

source: Tap on the Ceno notification to stop it completely.
ar: اضغط على إشعار Ceno لإيقافه تماما.
el: Πατήστε στην ειδοποίηση CENO για πλήρη τερματισμό.
fa: روی اطلاع‌رسان CENO بزنید تا آن را به‌طور کامل متوقف کنید.
fr: Touchez la notification de Ceno pour l’arrêter complètement.
id: Ketuk pada notifikasi CENO untuk menghentikan secara keseluruhan.
pt: Toque na notificação CENO para a parar completamente.
tr: Tamamen durdurmak için CENO bildirimine dokunun.
ur: اسے مکمل طور پر روکنے کے لیے Ceno اطلاع پر دبائيں۔

source: Detailed installation instructions are [here](../browser/install.md).
ar: تعليمات التثبيت المفصلة [هنا](../browser/install.md).
el: Για λεπτομερείς οδηγίες εγκατάστασης δείτε [εδώ](../browser/install.md).
es: Las instrucciones detalladas de instalación están [aquí](../browser/install.md).
fa: راهنمای ریزبه‌ریز نصب را در [این‌جا](../browser/install.md) می‌یابید.
fr: Vous trouverez [ici](../browser/install.md) des instructions détaillées d’installation.
id: Rincian instruksi pemasangan [di sini](../browser/install.md).
my: ထည့်သွင်းရန် လမ်းညွှန်ချက် အသေးစိတ်ကို [ဒီမှာ](../browser/install.md) ကြည့်ပါ။
pt: As instruções detalhadas de instalação são [aqui](.../browser/install.md).
pt_br: As instruções detalhadas para a instalação estão [aqui](../browser/install.md).
ru: Подробные инструкции по установке находятся [здесь](../browser/install.md).
tr: Ayrıntılı kurulum yönergelerine [buradan](../browser/install.md) ulaşabilirsiniz.
uk: Детальні інструкції зі встановлення розташовані [тут](../browser/install.md).
ur: انسٹالیشن کی تفصیلی ہدایات [یہاں پر](../browser/install.md) ہیں۔

source: Configuration
ar: تهيئة
el: Ρυθμίσεις
es: Configuración
fa: تنظیم
id: Konfigurasi
my: ဖွဲ့စည်းပုံစနစ်
pt: Configuração
pt_br: Configração
ru: Настройка
tr: Yapılandırma
uk: Налаштування
ur: کنفیگریشن

source: Ceno Browser should work out-of-the-box. You can find some [diagnostics and settings](../browser/settings.md) under the *Ceno* menu entry.
ar: يجب أن يعمل متصفح Ceno مباشرة. يمكنك العثور على بعض [التشخيصات والإعدادات](../browser/settings.md) ضمن قائمة الدخول *Ceno*.
el: Ο φυλλομετρητής CENO πρέπει να λειτουργεί έτοιμος. Μπορείτε να βρείτε μερικά [διαγνωστικά και ρυθμίσεις](../browser/settings.md) στο αρχικό μενού *CENO*.
fa: مرورگر CENO باید به محض نصب به‌خوبی کار کند. شما می‌توانید بعضی [تنظیمات و عیب‌یابی‌ها](browser/settings.md/..) را ذیل عنوان *CENO* در منو بیابید.
fr: Le Navigateur Ceno est prêt à être utilisé. Vous trouverez des [diagnostics et paramètres](../browser/settings.md) sous l’entrée *Ceno* du menu.
id: Peramban Ceno harus bekerja di luar kotak. Anda dapat menemukan beberapa [diagnostik dan pengaturan](../browser/settings.md) di bawah entri menu *Ceno*.
pt: O CENO Browser deve funcionar fora da caixa. Pode encontrar alguns [diagnósticos e definições](.../browser/settings.md) sob a entrada do menu *CENO*.
tr: CENO Browser açıldığı anda kullanılabilir. Menüdeki *CENO* seçeneğinde çeşitli [tanılayıcılar ve ayarlar](../browser/settings.md) bulabilirsiniz.
ur: Ceno براؤزر کو عمومیت سے ہٹ کر کام کرنا چاہئے۔ آپ *Ceno* مینو اندراج کے تحت کچھ [تشخیص اور ترتیبات](../browser/settings.md) تلاش کر سکتے ہیں۔

source: If you want to make sure that your app is also helping others access blocked content, please [read this section](../browser/bridging.md).
ar: إذا كنت تريد التأكد من أن تطبيقك يساعد الآخرين أيضا في الوصول إلى المحتوى المحظور، فيرجى [قراءة هذا القسم](../browser/bridging.md).
el: Εάν θέλετε να βεβαιωθείτε ότι η εφαρμογή βοηθάει και άλλους να έχουν πρόσβαση σε αποκλεισμένο περιεχόμενο, παρακαλούμε [διαβάστε την ενότητα](../browser/bridging.md).
es: Si quieres asegurarte de que tu aplicación también está ayudando a otros a acceder a contenido bloqueado, por favor [lee esta sección](../browser/bridging.md).
fa: اگر می‌خواهید مطمئن شوید که اپ شما به دیگران نیز برای دسترسی به محتوای مسدودشده کمک می‌کند، لطفاً [این بخش را بخوانید](browser/bridging.md/..).
fr: Si vous voulez vous assurer que votre appli aide aussi d'autres personnes à accéder à des contenus bloqués, veuillez [lire cette section](../browser/bridging.md).
id: Jika Anda ingin memastikan bahwa aplikasi Anda juga membantu orang lain untuk mengakses konten yang diblokir, harap [baca bagian ini](../browser/bridging.md).
my: ပိတ်ဆို့ထားသော အကြောင်းအရာများကို အခြားသူများ ဝင်ရောက်ကြည့်ရှုနိုင်အောင် သင့်အက်ပလီကေးရှင်းက ကူညီပေးနေကြောင်း သေချာချင်ပါက ကျေးဇူးပြုပြီး [ဒီအပိုင်းကိုဖတ်ပါ](../browser/bridging.md)။
pt: Se quiser ter a certeza de que a sua aplicação também está a ajudar outros a aceder ao conteúdo bloqueado, por favor [leia esta secção](.../browser/bridging.md).
pt_br: Se vocẽ quer ter certeza de que seu aplicativo está também ajudando outras pessoas a acessar conteúdo bloqueado, por favor [leia esta seção](../browser/bridging.md).
ru: Если вы хотите убедиться, что ваше приложение также помогает другим получить доступ к заблокированному контенту, пожалуйста, [прочтите этот раздел](../browser/bridging.md).
tr: Uygulamanızın başkalarının da yasaklanan içeriğe erişmesine yardımcı olmasını isterseniz, lütfen [bu bölümü okuyun](../browser/bridging.md).
uk: Якщо ви хочете переконатися, що ваша програма також допомагає іншим отримати доступ до заблокованого контенту, будь ласка [прочитайте цей розділ](../browser/bridging.md).
ur: اگر آپ یہ یقینی بنانا چاہتے ہیں کہ آپ کی ایپ مسدود شدہ مواد تک رسائی میں دوسروں کی مدد کر رہی ہے، تو براہ کرم [اس سیکشن کو پڑھیں](../browser/bridging.md)۔

source: More questions?
ar: المزيد من الأسئلة؟
el: Έχετε περισσότερες ερωτήσεις;
es: ¿Más preguntas?
fa: پرسش‌های بیشتر؟
fr: D’autres questions ?
id: Ada pertanyaan lain?
my: နောက်ထပ် မေးစရာများ ရှိပါသလား။
pt: Mais perguntas?
pt_br: Mais perguntas?
ru: Другие вопросы?
tr: Başka sorularınız mı var?
uk: Залишилися питання?
ur: مزید سوالات؟

source: Please see the [FAQ](faq.md).
ar: يرجى الاطلاع على [الأسئلة الشائعة](faq.md).
el: Παρακαλούμε δείτε το [Συχνές ερωτήσεις](faq.md).
es: Por favor mira las [PMF](faq.md).
fa: لطفاً به [پرسش‌های متداول](faq.md) بنگرید.
fr: Consultez la [Foire aux questions](faq.md).
id: Silakan lihat [FAQ](faq.md).
my: ကျေးဇူးပြုပြီး [မေးလေ့ရှိသော မေးခွန်းများ](faq.md) ကို ကြည့်ပါ။
pt: Por favor ver a [FAQ](faq.md).
pt_br: Por favor, consulte a [FAQ](faq.md).
ru: Пожалуйста, ознакомьтесь с [Часто задаваемыми вопросами](faq.md).
tr: [SSS](faq.md) bölümüne bakabilirsiniz.
uk: Будь ласка, ознайомтесь з [Часті питання](faq.md).
ur: براہ کرم [اکثر پوچھے گئے سوالات](faq.md) دیکھیں۔

source: Refer to the [troubleshooting guide](../browser/troubleshooting.md).
ar: ارجع إلى [دليل استكشاف الأخطاء وإصلاحها](../browser/troubleshooting.md).
el: Συμβουλευθείτε τον [οδηγό αντιμετώπισης προβλημάτων](../browser/troubleshooting.md).
es: Consulta a la [guía de solución de problemas](../browser/troubleshooting.md).
fa: به [راهنمای شناسایی و رفع اشکال](browser/troubleshooting.md/..) رجوع کنید.
fr: Consultez le [guide de dépannage](../browser/troubleshooting.md).
id: Lihat [panduan pemecahan masalah](../browser/troubleshooting.md).
my: [ပြဿနာဖြေရှင်းခြင်း လမ်းညွှန်](../browser/troubleshooting.md) ကို လေ့လာပါ။
pt: Consultar o [guia de resolução de problemas](.../browser/troubleshooting.md).
pt_br: Consulte o [guia de solução de problemas](../browser/troubleshooting.md).
ru: Обратитесь к [руководству по устранению неполадок](../browser/troubleshooting.md).
tr: [Sorun giderme rehberi](../browser/troubleshooting.md) bölümüne bakabilirsiniz.
uk: Зверніться до [посібника з усунення несправностей](../browser/troubleshooting.md).
ur: [خرابیوں کا سراغ لگانا گائیڈ](../browser/troubleshooting.md) سے رجوع کریں۔

source: [ceno-gplay]: https://play.google.com/store/apps/details?id=ie.equalit.ceno
el: [ceno-gplay]: https://play.google.com/store/apps/details?id=ie.equalit.cenο

source: Contact us by writing to [cenoers@equalitie.org](mailto:cenoers@equalitie.org).
fa: با ما با نشانی [cenoers@equalitie.org](mailto:cenoers@equalitie.org) تماس بگیرید.
fr: Contactez-nous par courriel à [cenoers@equalitie.org](mailto:cenoers@equalitie.org).
pt: Contacte-nos escrevendo para [cenoers@equalitie.org](mailto:cenoers@equalitie.org).

source: CENO Browser allows you to access any website on the Internet, even if it is censored in your country. CENO uses a peer-to-peer infrastructure to route your requests, as well as to store and share retrieved content with others. [Read more about CENO](ceno.md).
pt_br: O Navegador CENO permite que você acesse qualquer website na Internet, mesmo que seja censurado em seu país. CENO usa uma infraestrutura P2P para encaminhar suas requisições, bem como para armazenar e compartilhar conteúdo recuperado com outras pessoas. [Leia mais sobre o CENO](ceno.md).

source: Install CENO Browser from [Google Play][ceno-gplay], [GitHub][ceno-gh] or [Paskoocheh][ceno-pask]. *No special permissions are needed*.
pt_br: Instale o Navegador CENO via [Google Play][ceno-gplay], [GitHub][ceno-gh] ou [Paskoocheh][ceno-pask]. *Não são necessárias permissões especiais*.

source: Tap on the CENO notification to stop it completely.
es: Pulsa en la notificación CENO para detenerlo completamente.
pt_br: Toque na notificação do CENO para interrompê-lo completamente.
ru: Нажмите на уведомление CENO, чтобы полностью остановить его.
uk: Натисніть на сповіщення CENO, щоб повністю зупинити його.

source: CENO Browser should work out-of-the-box. You can find some [diagnostics and settings](../browser/settings.md) under the *CENO* menu entry.
pt_br: O Navegador CENO deveria funcionar imediatamente. Você pode encontrar uma gama de [diagnósticos e configurações](../browser/settings.md) sob o menu *CENO*.

source: Contact us by writing to [cenoers@equalit.ie](mailto:cenoers@equalit.ie).
es: Contáctanos por escrito a [cenoers@equalit.ie](mailto:cenoers@equalit.ie).
my: [cenoers@equalit.ie](mailto:cenoers@equalit.ie) သို့ အီးမေးလ်ပို့ပြီး ကျွန်ုပ်တို့ကို ဆက်သွယ်ပါ။
pt_br: Fale conosco escrevendo para [cenoers@equalit.ie](mailto:cenoers@equalit.ie).
ru: Свяжитесь с нами, написав по адресу [cenoers@equalit.ie](mailto:cenoers@equalit.ie).
uk: Зв'яжіться з нами, написавши на адресу [cenoers@equalit.ie](mailto:cenoers@equalit.ie).
ur: [cenoers@equalit.ie](mailto:cenoers@equalit.ie) پر لکھ کر ہم سے رابطہ کریں۔

source: The CENO Browser allows you to access any website on the Internet, even if it is censored in your country. CENO uses a peer-to-peer infrastructure to route your requests, as well as to store and share retrieved content with others. [Read more about CENO](ceno.md).
ru: Браузер CENO позволяет вам получить доступ к любому сайту в интернете, даже если он подвергается цензуре в вашей стране. CENO использует одноранговую инфраструктуру для маршрутизации ваших запросов, а также для хранения и обмена полученным контентом с другими пользователями. [Подробнее о CENO](ceno.md).

source: Install the CENO Browser from [Google Play][ceno-gplay], [GitHub][ceno-gh] or [Paskoocheh][ceno-pask]. *No special permissions are needed*.
ru: Установите Браузер CENO из [Google Play][ceno-gplay], [GitHub][ceno-gh] или [Paskoocheh][ceno-pask]. *Никаких специальных разрешений не требуется*.

source: The CENO Browser should work out-of-the-box. You can find some [diagnostics and settings](../browser/settings.md) under the *CENO* menu entry.
ru: Браузер CENO должен работать «из коробки». Вы можете найти некоторые [диагностики и настройки](../browser/settings.md) под пунктом меню *CENO*.
