Repository: censorship-no/ceno-docs
Catalog: user-manual/*/concepts/how.po
Languages: ar, de, es, fa, fr, my, pt_br, ru, tr, uk, ur

source: You could of course download a page from your browser and copy the resulting files to other people, which should be fine if you know each other. But what if you received such files from an unknown person? How could you be sure that the content actually came from the website it claims to, that it was retrieved at a certain date or that the information in it was not manipulated?
ar: يمكنك بالطبع تنزيل صفحة من متصفحك ونسخ الملفات وإرسالها إلى آخرين. هذا أمر عادي ضمن شبكة معارفك. ولكن ماذا لو تلقيت مثل هذه الملفات من شخص مجهول؟ كيف يمكنك التأكد من أن المحتوى جاء بالفعل من موقع الويب في تاريخ معين أو أن المعلومات الموجودة فيه لم يتم التلاعب بها؟
es: Tu podrías, por supuesto, descargar una página desde tu navegador y copiar los archivos resultantes para otras personas, lo cual estaría bien si se conocieran entre todos. ¿Pero qué pasa si recibiste tales archivos de una persona desconocida? ¿Cómo puedes estar seguro que el contenido realmente vino del sitio web del que dice ser, que fuera descargado en una cierta fecha o que la información en ellos no fue manipulada?
fa: شما البته می‌توانید صفحه‌ای را از مرورگرتان دانلود کنید و فایل‌های نتیجه را برای سایر افراد کپی کنید، که اگر همدیگر را بشناسید نباید مشکلی پیش آید، اما اگر چنین فایل‌هایی را از یک شخص ناشناخته دریافت کنید چطور؟ چگونه می‌توانید یقین داشته باشید که آن محتوا واقعاً از وب‌سایتی آمده که ادعا می‌شود، که در تاریخ مشخصی بازیابی شده یا این‌که اطلاعات موجود در آن دستکاری نشده است؟
fr: Vous pouvez bien sûr télécharger une page depuis votre navigateur et copier les fichiers résultants vers d'autres personnes, ce qui devrait convenir si vous vous connaissez. Mais que se passe-t-il si vous recevez de tels fichiers d'une personne inconnue ? Comment pouvez-vous être sûr que le contenu provient bien du site Web auquel il prétend, qu'il a été récupéré à une certaine date ou que les informations qu'il contient n'ont pas été manipulées ?
my: သင့်အနေဖြင့် စာမျက်နှာတစ်ခုကို ဒေါင်းလုတ်ဆွဲပြီး ကော်ပီကူးကာ အခြားသူတစ်ဦးထံသို့ စိတ်ချလက်ချ မျှဝေပေးနိုင်သော်လည်း ထိုသူနှင့်သင် အချင်းချင်းသိရန် လိုအပ်သည်။ သင်မသိသောသူထံမှ ဖိုင်တစ်ခုကိုလက်ခံရသည့်အခါတွင် ထိုဖိုင်ပါ အကြောင်းအရာများသည် ဝက်ဘ်ဆိုက်အစစ်အမှန်မှလာကြောင်း မည်သို့သိရှိနိုင်မည်နည်း (သို့မဟုတ်) သင်ကြည့်လိုသည့်နေ့တွင် ရယူထားသော အကြောင်းအရာ ဖြစ်ကြောင်း (သို့မဟုတ်) ကြားဖြတ်၍ ပြုပြင် ပြောင်းလဲထားခြင်း ရှိ/မရှိ မည်သို့သိနိုင်မည်နည်း။
pt_br: Você com certeza poderia baixar uma página a partir do seu navegador e copiar os arquivos resultantes para outras pessoas, o que não tem problema se vocês se conhecem. Mas e se você recebesse tais arquivos de uma pessoa desconhecida? Como poderia ter certeza de que aquele conteúdo de fato veio do website do qual diz ter vindo, de que foi recuperado em uma determinada data ou de que a informação contida nele não foi manipulada?
ru: Конечно, вы можете загрузить страницу из своего браузера и скопировать полученные файлы другим людям, что вполне нормально, если вы знакомы. Но что, если вы получили такие файлы от неизвестного человека? Как вы можете быть уверены в том, что содержимое действительно пришло с того сайта, на который оно претендует, что оно было получено в определенную дату или что информация в нем не была подделана?
tr: Elbette tarayıcınızdan bir sayfayı indirebilir ve ilgili dosyaları başkalarına kopyalayabilirsiniz. Bu kullanım, birbirinizi tanıdığınız sürece sorun çıkarmayabilir. Ancak, böyle dosyaları bilinmeyen bir kişiden aldıysanız ne yapacaksınız? İçeriğin gerçekten iddia edildiği siteden geldiğinden, belirli bir tarihte alındığından veya içindeki bilginin değiştirilmediğinden nasıl emin olabilirsiniz?
uk: Звичайно, ви можете завантажити сторінку зі свого браузера та скопіювати отримані файли для інших людей, що цілком нормально, якщо ви знайомі між собою. Але що робити, якщо ви отримали такі файли від невідомої людини? Як ви можете бути впевнені в тому, що контент дійсно прийшов із заявленого сайту, що контент був отриманий у такий-то час, або що інформація з сайту не була підроблена?
ur: آپ یقیناً اپنے براؤزر سے ایک صفحہ ڈاؤن لوڈ کر سکتے ہیں اور نتیجے میں آنے والی فائلوں کو دوسرے لوگوں میں کاپی کر سکتے ہیں، اگر آپ ایک دوسرے کو جانتے ہیں تو یہ ٹھیک ہو گا۔ لیکن اگر آپ کو کسی نامعلوم شخص سے ایسی فائلیں موصول ہوں تو کیا ہوگا؟ آپ کیسے اس بات کا یقین کر سکتے ہیں کہ مواد دراصل اس ویب سائٹ سے آیا ہے جس کا یہ دعویٰ کرتا ہے، کہ اسے ایک خاص تاریخ پر بازیافت کیا گیا تھا یا اس میں موجود معلومات میں ہیرا پھیری نہیں کی گئی تھی؟

source: We want Ceno and Ouinet usage to scale and provide as much content to as many people as possible, so we do want you to be able to receive content from people you do not know. To enable you to accept such content, Ouinet uses **content signing**: your client is configured to trust content that is signed using a special key owned by injectors. Whenever a client tells an injector to retrieve some Web content for sharing, the injector gets it from the origin server, uses the key to sign it, and returns the signed content to the client.
ar: نريد أن يؤدي استخدام Ceno و Ouinet إلى توسيع نطاق توفير المحتوى لأكبر قدر ممكن و لأكبر عدد ممكن من الأشخاص، لذلك نريدك أن تكون قادرًا على تلقي المحتوى من أشخاص لا تعرفهم. لتمكينك من قبول مثل هذا المحتوى، يستخدم Ouinet ميزة **توقيع المحتوى**: تم تهيئة عميلك للثقة في المحتوى المُوَقَّع باستخدام مفتاح خاص يمتلكه الحاقنون. عندما يخبر العميل حاقناً باسترداد بعض محتوى الويب لمشاركته، يحصل الحاقن عليه من الخادم الأصلي، ويستخدم المفتاح لتوقيعه، ويرسل المحتوى المُوَقَّع إلى العميل.
ur: ہم چاہتے ہیں کہ CENO اور Ouinet کے استعمال کی پیمائش کی جائے اور زیادہ سے زیادہ لوگوں کو زیادہ سے زیادہ مواد فراہم کیا جائے، اس لیے ہم چاہتے ہیں کہ آپ ان لوگوں سے مواد وصول کرنے کے قابل ہو جائیں جنہیں آپ نہیں جانتے۔ آپ کو اس طرح کے مواد کو قبول کرنے کے قابل بنانے کے لیے، Ouinet **مواد پر دستخط** کا استعمال کرتا ہے: آپ کے کلائنٹ کو ایسے مواد پر بھروسہ کرنے کے لیے ترتیب دیا گیا ہے جس پر انجیکٹرز کی ملکیت والی خصوصی کلید کا استعمال کرتے ہوئے دستخط کیے گئے ہیں۔ جب بھی کوئی کلائنٹ کسی انجیکٹر کو شیئر کرنے کے لیے کچھ ویب مواد کو بازیافت کرنے کو کہتا ہے، انجیکٹر اسے اصل سرور سے حاصل کرتا ہے، اس پر دستخط کرنے کے لیے کلید کا استعمال کرتا ہے، اور دستخط شدہ مواد کلائنٹ کو واپس کرتا ہے۔

source: **Technical note:** In fact, the injector signs individual blocks of data as they come, so even if the connection is cut in the middle while retrieving a big file, the downloaded data can still be shared by the client that received it.
ar: **ملاحظة تقنية:** في الواقع، يقوم الحاقن بتوقيع كتل فردية من البيانات فور وصولها، لذلك حتى إذا تم قطع الاتصال في المنتصف أثناء استرداد ملف كبير، فلا يزال من الممكن مشاركة البيانات التي تم تنزيلها بواسطة العميل الذي استلمها.
es: **Nota técnica:** De hecho, el inyector firma bloques individuales de datos en la medida en que llegan, por lo que aún si la conexión es cortada a la mitad mientras se está descargando un archivo grande, los datos descargados aún pueden ser compartidos por el cliente que los recibió.
fa: **نکته‌ی فنی:** در واقع، injector بلوک‌هایی از داده‌های فردی را پس از ورودشان امضا می‌کند، طوری که حتی اگر ارتباط در میان فرایند بازیابی یک فایل بزرگ قطع شود، داده‌های دانلودشده می‌توانند همچنان از طرف سرویس‌گیرنده‌ای که آن‌ها را دریافت کرده به اشتراک گذاشته شوند.
fr: **Note technique :** En fait, l'injecteur signe des blocs de données individuels au fur et à mesure qu'ils arrivent, donc même si la connexion est coupée au milieu lors de la récupération d'un gros fichier, les données téléchargées peuvent toujours être partagées par le client qui les a reçues.
my: **နည်းပညာနှင့်ဆိုင်ရာ သတိပြုရန်** အမှန်တကယ်အားဖြင့် ထိုးသွင်းစက်သည် သီးသန့်အချက်အလက်တစ်ခုချင်းစီကို အချက်ပြနိုင်သည်။ ထို့ကြောင့် ကြီးမားသောဖိုင်အချက်အလက်များကို ရယူနေစဉ်ကြားထဲတွင် ချိတ်ဆက်မှုများပြတ်တောက်သွားစေကာမူ ဒေါင်းလုပ်ဆွဲယူထားသောအချက်အလက်များကို လက်ခံသူမှ ရရှိနိုင်ပါသေးတယ်။
pt_br: **Nota técnica:** Na verdade, o injetor assina blocos individuais de dados conforme eles chegam, então mesmo que a conexão seja cortada no meio da recuperação de um arquivo grande, os dados baixados ainda podem ser compartilhados pelo cliente que os recebeu.
ru: **Техническое примечание:** Фактически, инъектор подписывает отдельные блоки данных по мере их поступления, поэтому даже если соединение обрывается на середине при получении большого файла, загруженные данные все равно могут быть доступны клиенту, который их получил.
tr: **Teknik not:** İçerik ekleyiciler büyük bir dosya alınırken gelen veri parçalarını ayrı ayrı imzalar. Böylece büyük bir veri indirilirken bağlantı kesilse bile onu alan istemci tarafından hala paylaşılabilir.
uk: **Технічна примітка:** Фактично, ін'єктор підписує окремі блоки даних по мірі їх надходження, тому навіть якщо з'єднання обривається на середині при отриманні великого файлу, завантажені дані все одно будуть доступні клієнту, який отримав ці дані.
ur: **تکنیکی نوٹ:** درحقیقت، انجیکٹر ڈیٹا کے انفرادی بلاکس کے آتے ہی دستخط کرتا ہے، اس لیے اگر ایک بڑی فائل کو بازیافت کرتے وقت کنکشن درمیان میں کٹ جاتا ہے، تب بھی ڈاؤن لوڈ کردہ ڈیٹا کو موصول ہونے والے کلائنٹ کے ذریعے اشتراک کیا جا سکتا ہے۔

source: Different injectors may have different keys, so you can choose which injectors to trust. Picture it like this: you may trust a document signed by a *notary public* from your country, no matter who gave it to you (national or foreigner), while you would not be required to accept a document signed by a notary from another country. Ceno Browser is already configured to trust a set of injectors run by eQualitie.
ar: قد يكون للحاقنات المختلفة مفاتيح مختلفة، لذا يمكنك اختيار الحاقن الذي تثق به. تصور الأمر على هذا النحو: يمكنك الوثوق في مستند مُوَقَّعٍ من قبل *مُوَثِّقٍ* من بلدك، بغض النظر عمّن أعطاك هذا المستند (مواطن أو أجنبي)، بينما لن يُطلَب منك قبول مستند مُوَقَّع من كاتب عدل من بلد آخر. تمت تهيئة متصفح Ceno للثقة في مجموعة من الحاقنات التي تديرها eQualitie.
ur: مختلف انجیکٹرز میں مختلف کلیدیں ہو سکتی ہیں، لہذا آپ انتخاب کر سکتے ہیں کہ کن انجیکٹروں پر بھروسہ کرنا ہے۔ اس کی اس طرح تصویر بنائیں: آپ اپنے ملک کے *نوٹری پبلک* کے دستخط شدہ دستاویز پر بھروسہ کرسکتے ہیں، چاہے وہ آپ کو کس نے دیا ہو (قومی یا غیر ملکی)، جب کہ آپ کو کسی دوسرے ملک سے نوٹری کے دستخط شدہ دستاویز کو قبول کرنے کی ضرورت نہیں ہوگی۔ CENO براؤزر پہلے ہی eQualitie کے ذریعے چلائے جانے والے انجیکٹروں کے سیٹ پر بھروسہ کرنے کے لیے ترتیب دیا گیا ہے۔

source: **Technical note:** Injectors use a public/private key pair to create Ed25519 signatures; public keys are small enough to allow them to be sent along signatures, and encoded as 64 hexadecimal characters or 52 Base32 characters. They may even be exchanged on the phone or written down on a piece of paper.
ar: **ملاحظة تقنية:** تستخدم الحاقنات زوج مفاتيح عام/خاص لإنشاء توقيعات Ed25519؛ المفاتيح العامة صغيرة بما يكفي للسماح بإرسالها مع التوقيعات، ومشفرة بصيغة 64 حرفًا ستة عشري أو 52 حرفًا من Base32. يمكن حتى تبادلها على الهاتف أو كتابتها على قطعة من الورق.
de: **Technischer Hinweis:** Injektoren verwenden ein öffentliches/privates Schlüsselpaar, um Ed25519-Signaturen zu erstellen; die öffentlichen Schlüssel sind so klein, dass sie zusammen mit den Signaturen verschickt werden können, und als 64 hexadezimale Zeichen oder 52 Base32-Zeichen kodiert. Sie können sogar am Telefon ausgetauscht oder auf einem Blatt Papier notiert werden.
es: **Nota técnica:** Los inyectores usan un par de claves pública/privada para crear firmas Ed25519; las claves públicas son suficientemente pequeñas para permitir ser enviadas junto con las firmas, y codificadas como 64 caracteres hexadecimales o 52 caracteres Base32. Es más, podrían ser intercambiadas sobre el teléfono o escritas en un pedazo de papel.
fa: **نکته‌ی فنی:** injectorها از یک جفت کلید عمومی/خصوصی برای ایجاد امضاهای Ed25519 استفاده می‌کنند؛ کلیدهای عمومی به قدر کافی کوچک هستند تا به آن‌ها اجازه دهند همراه با امضاها فرستاده شوند، و در قالب ۶۴ کاراکتر دستگاه اعداد پایه‌ی ۱۶ یا ۵۲ کاراکتر اعداد پایه‌ی ۳۲ رمزگذاری شوند. آن‌ها می‌توانند حتی روی تلفن ردوبدل شوند یا روی یک تکه کاغذ نوشته شوند.
fr: **Note technique :** Les injecteurs utilisent une paire de clés publique/privée pour créer des signatures Ed25519 ; les clés publiques sont suffisamment petites pour leur permettre d'être envoyées avec des signatures et codées sous forme de 64 caractères hexadécimaux ou de 52 caractères Base32. Ils peuvent même être échangés par téléphone ou écrits sur un bout de papier.
my: **နည်းပညာဆိုင်ရာသတိပြုရန်** ထိုးသွသင်းစက်များသည် အများသုံး သို့မဟုတ် တစ်ကိုယ်ရည်သုံးသော့အစုံလိုက်ကို အသုံးပြုပြီး Ed25519 လက်မှတ်များကို ပြုလုပ်ပေးပါသည်။ အများသုံးသော့များသည် လက်မှတ်နှင့်အတူပို့ခွင့်ပြုနိုင်လောက်တဲ့အထိ တိုပါသည်။ အများသုံးသော့များကို ၆၄လုံးရှိသော hexadecimal စာလုံးများ သို့မဟုတ် ၅၂လုံးရှိသော Base32 စာလုံးများကို အနေဖြင့် ဝှက်စာပြုလုပ်ထားပါသည်။ သော့များကို ဖုန်းကနေတစ်ဆင့် ဖလှယ်ခြင်း သို့မဟုတ် စာရွက်ပေါ်တွင် ချရေးထားနိုင်ပါသည်။
pt_br: **Nota técnica:** Injetores usam um par de chaves pública/privada para criar assinaturas Ed25519. Chaves públicas são pequenas o suficiente para permitir seu envio junto com as assinaturas e codificadas como 64 caracteres hexadecimais ou 52 caracteres de Base32. Elas podem até ser intercambiadas no telefone ou escritas em um pedaço de papel.
ru: **Техническое примечание:** Инъекторы используют пару открытый/закрытый ключ для создания подписей Ed25519; открытые ключи достаточно малы, чтобы их можно было пересылать вместе с подписями, и кодируются в виде 64 шестнадцатеричных символов или 52 символов Base32. Ими можно даже обменяться по телефону или записать на листе бумаги.
tr: Teknik not: İçerik ekleyiciler, Ed25519 imzaları oluşturmak için bir herkese açık ve kişisel anahtar çifti kullanır. Herkese açık anahtarlar, imzalarla birlikte gönderilebilecek kadar küçüktür ve 64 tane onaltılık karakter ya da 52 tane Base32 karakter biçiminde kodlanabilir. Bunlar telefonda konuşarak bile iletilebilir veya bir kağıda yazılabilir.
uk: **Технічна примітка:** Ін'ектори використовують пару з відкритого та закритого ключів для створення підписів Ed25519; відкриті ключі досить малі, щоб їх можна було пересилати разом із підписами, та кодуються у вигляді 64 шістнадцяткових символів або 52 символів Base32. Ними можна навіть обмінятися телефоном або записати на аркуші паперу.
ur: **تکنیکی نوٹ:** انجیکٹر Ed25519 دستخط بنانے کے لیے عوامی/نجی کلید کا جوڑا استعمال کرتے ہیں۔ عوامی کلیديں اتنی چھوٹی ہیں کہ انہیں دستخطوں کے ساتھ بھیجا جا سکتا ہے، اور 64 ہیکساڈیسیمل حروف یا 52 Base32 حروف کے طور پر انکوڈ کیا جاتا ہے۔ ان کا تبادلہ فون پر بھی کیا جا سکتا ہے یا کاغذ کے ٹکڑے پر لکھا جا سکتا ہے۔

source: Content injection
ar: حقن المحتوى
de: Injektion von Inhalten
es: Inyección de contenido
fa: تزریق محتوا
fr: Injection de contenu
my: အကြောင်းအရာကို ထိုးသွင်းခြင်း
pt_br: Injeção de conteúdo
ru: Инъекция контента
tr: İçeriklerin eklenmesi
uk: Ін'єкція контенту
ur: مواد کا انجیکشن

source: Remember that in our example scenario your client had already tried to retrieve content *X* directly from the origin server and from other clients to no avail. The client plays its last Ouinet card and tries to contact a trusted injector to get a signed copy of the content that it can share with other clients.
ar: تذكر أنه في السيناريو الخاص بنا، حاول العميل استرداد المحتوى *X* مباشرةً من الخادم الأصلي ومن العملاء الآخرين دون جدوى. يقوم العميل بلعب ورقته Ouinet الأخيرة ويحاول الاتصال بحاقن موثوق به للحصول على نسخة موقعة من المحتوى يمكنه مشاركتها مع عملاء آخرين.
es: Recuerda que en nuestro escenario de ejemplo tu cliente ya había intentado descargar el contenido *X* directamente del servidor de origen y desde otros clientes, sin resultados. El cliente juega su última carta Ouinet e intenta contactar a un inyector confiable para obtener una copia firmada del contenido, que pueda compartir con otros clientes.
fa: به یاد داشته باشید که در سناریوی مثال ما سرویس‌گیرنده‌ی شما پیش‌تر سعی کرده بود محتوای *X* را مستقیماً از سرور اصلی و از سایر سرویس‌گیرندگان بازیابد اما موفق نشده بود. سرویس‌گیرنده آخرین ورق وینت‌اش را بازی می‌کند و تلاش می‌کند تا با یک injector مورد اعتماد تماس بگیرد تا نسخه‌ای امضاشده از محتوایی را دریافت کند که بتواند با سایر سرویس‌گیرندگان به اشتراک گذاشته شود.
fr: N'oubliez pas que dans notre exemple de scénario, votre client avait déjà essayé de récupérer le contenu *X* directement depuis le serveur d'origine et depuis d'autres clients en vain. Le client joue sa dernière carte Ouinet et tente de contacter un injecteur de confiance pour obtenir une copie signée du contenu qu'il pourra partager avec d'autres clients.
my: ကျွနုပ်တို့ရဲ့ ဥပမာပေးထားသော ဖြစ်စဉ်တွင် သင့်ရဲ့သုံးစွဲသူသည် အကြောင်းအရာ *X*ကို မူရင်းဆာဗာမှ ရယူရန် ကြိုးစားခဲ့ပြီးပြီဖြစ်ပြီး အခြားသော သုံးစွဲသူများထံမှ မရရှိနိုင်တော့သည်ကို သတိပြုရပါမည်။ သုံးစွဲသူသည် နောက်ဆုံး Ouinet ကတ်ကို အသုံးပြုပြီး ယုံကြည်စိတ်ချရသောထိုးသွင်းစက်ကို ဆက်သွယ်ပြီး လက်မှတ်ပါသော အကြောင်းအရာမိတ္တူတစ်စုံကို ရယူနိုင်အောင်ကြိုးစားခြင်းဖြစ်ပါသည်။ သို့မှသာ အကြောင်းအရာမိတ္တူကို အခြားသောသုံးစွဲသူများနှင့် မျှဝေနိုင်မှာ ဖြစ်ပါတယ်။
pt_br: Lembre-se de que em nosso cenário de exemplo seu cliente já havia tentado recuperar o conteúdo *X* diretamente do servidor de origem e a partir de outros clientes sem sucesso. O cliente joga a sua última carta Ouinet e tenta contatar um injector confiável para obter uma cópia assinada do conteúdo que ele pode compartilhar com outros clientes.
ru: Помните, что в нашем примере клиент уже пытался получить контент *X* непосредственно с исходного сервера и от других клиентов, но безуспешно. Клиент разыгрывает свою последнюю карту Ouinet и пытается связаться с доверенным инъектором, чтобы получить подписанную копию контента, которой он может поделиться с другими клиентами.
tr: Örnek senaryomuzda istemcinizin, X içeriğini doğrudan kaynak sunucudan ve diğer istemcilerden alamadığını hatırlayın. İstemci, diğer istemcilerle paylaşabileceği imzalanmış bir kopya almak için güvenilir bir içerik ekleyiciye başvurarak son Ouinet kartını oynar.
uk: Пам'ятайте, що в нашому випадку клієнт вже намагався отримати контент *X* безпосередньо з вихідного сервера та інших клієнтів, але безуспішно. Клієнт розігрує свою останню карту Ouinet і намагається зв'язатися з довіреним ін'єктором, щоб отримати підписану копію контенту, якою він може поділитися з іншими клієнтами.
ur: یاد رکھیں کہ ہماری مثال کے منظر نامے میں آپ کے کلائنٹ نے پہلے ہی اصل سرور اور دوسرے کلائنٹس سے مواد *X* بازیافت کرنے کی کوشش کی تھی کوئی فائدہ نہیں ہوا۔ کلائنٹ اپنا آخری Ouinet کارڈ چلاتا ہے اور مواد کی دستخط شدہ کاپی حاصل کرنے کے لیے ایک قابل اعتماد انجیکٹر سے رابطہ کرنے کی کوشش کرتا ہے جسے وہ دوسرے کلائنٹس کے ساتھ شیئر کر سکتا ہے۔
