Repository: censorship-no/ceno-docs
Catalog: user-manual/*/concepts/how.po
Languages: ar, de, es, fa, fr, my, pt_br, ru, tr, uk, ur

source: How does it work?
ar: كيف يعمل؟
de: Wie funktioniert es?
es: ¿Cómo funciona?
fa: این مرورگر چگونه کار می‌کند؟
fr: Comment ça marche ?
my: ဘယ်လို အလုပ်လုပ်သလဲ။
pt_br: Como funciona?
ru: Как это работает?
tr: Nasıl çalışır?
uk: Як це працює?
ur: یہ کیسے کام کرتا ہے؟

source: This section will explain Ceno and Ouinet operation by going over a series of scenarios. Terminology and concepts important to Ouinet will be introduced (highlighted **in bold letters**) and used afterwards for efficiency and to avoid confusion.
ar: يشرح هذا القسم عمل Ceno و Ouinet من خلال استعراض سلسلة من السيناريوهات. سيتم تقديم المصطلحات والمفاهيم المهمة لـ Ouinet (مميزة **بأحرف غامقة**) قبل استخدامها لاحقًا للتبسيط ولتجنب الالتباس.
ur: یہ سیکشن منظرناموں کے سلسلہ پر جا کر CENO اور Ouinet آپریشن کی وضاحت کرے گا۔ Ouinet کے لیے اہم اصطلاحات اور تصورات کو متعارف کرایا جائے گا (** بڑے حروف میں** نمایاں کیا گیا ہے) اور بعد میں کارکردگی اور الجھن سے بچنے کے لیے استعمال کیا جائے گا۔

source: Accessing content directly
ar: الوصول إلى المحتوى مباشرة
de: Direkter Zugriff auf Inhalte
es: Accediendo directamente al contenido
fa: دسترسی مستقیم به محتوا
fr: Accéder directement au contenu
my: အကြောင်းအရာကို တိုက်ရိုက် ဝင်ရောက်သုံးစွဲခြင်း
pt_br: Acessando conteúdo diretamente
ru: Прямой доступ к контенту
tr: İçeriğe doğrudan erişmek
uk: Прямий доступ до контенту
ur: براہ راست مواد تک رسائی حاصل کرنا

source: Ceno Browser is an example of an application that uses Ouinet technology to retrieve and share Web content. We call such an application a Ouinet **client**. When you use your client (i.e. Ceno) to try to access some content *X*, hosted on a Web server (which we will call *X*'s **origin** server), your client tries to contact the origin server over the Internet either directly or via some other machine configured to contact Web servers on behalf of others (a so-called **proxy** server) and then requests the desired content. This is no different from the way in which any normal Web browser works.
ar: يعتبر متصفح Ceno مثالاً لتتطبيقات التي تستخدم تقنية Ouinet لاسترداد محتوى الويب ومشاركته. نطلق على هذه التطبيقات اسم **عميل** Ouinet. عندما تستخدم عميلك (أي Ceno) لمحاولة الوصول إلى محتوى ما *X* يستضيفه خادم ويب (والذي سنطلق عليه إسم الخادم **الأصلي** لـ *X*)، يحاول عميلك الاتصال بالخادم الأصلي عبر الإنترنت إما مباشرة أو عبر جهاز آخرٍ مهيئٍ للاتصال بخوادم الويب نيابة عن الآخرين (سنطلق على هذا الخادم اسم الخادم **الوكيل**) ثم يطلب المحتوى المرغوب. هذا لا يختلف عن الطريقة التي يعمل بها أي متصفح ويب عادي.
ur: CENO براؤزر ایک ایسی ایپلی کیشن کی ایک مثال ہے جو ویب مواد کو بازیافت کرنے اور شیئر کرنے کے لیے Ouinet ٹیکنالوجی کا استعمال کرتی ہے۔ ہم ایسی ایپلیکیشن کو Ouinet **کلائنٹ** کہتے ہیں۔ جب آپ اپنے کلائنٹ (یعنی CENO) کو کسی ویب سرور پر ہوسٹ کردہ مواد *X* تک رسائی حاصل کرنے کی کوشش کرتے ہیں (جسے ہم *X* کا **اصل ** سرور کہیں گے)، تو آپ کا کلائنٹ اصل سرور سے رابطہ کرنے کی کوشش کرتا ہے۔ انٹرنیٹ پر یا تو براہ راست یا کسی دوسری مشین کے ذریعے دوسروں کی جانب سے ویب سرورز سے رابطہ کرنے کے لیے ترتیب دی گئی ہے (ایک نام نہاد **پراکسی** سرور) اور پھر مطلوبہ مواد کی درخواست کرتا ہے۔ یہ کسی بھی عام ویب براؤزر کے کام کرنے کے طریقے سے مختلف نہیں ہے۔

source: **Technical note:** There is in fact one small gotcha. Since the client acts as an HTTP proxy running on your device, for the client to be able to decrypt and act upon HTTPS content requests, the application using the client (i.e. the Web browser part – like Firefox in Ceno) needs to accept a special certificate issued by the client itself (and only used on your device). Ceno Browser already takes care of setting this certificate up for its private use so that you do not need to worry.
ar: **ملاحظة تقنية:** يوجد في الحقيقة عيب واحد صغير. بما أن العميل يعمل على جهازك كوكيل HTTP، فلكي يتمكن العميل من فك تشفير طلبات محتوى HTTPS و متابعتها، فإن التطبيق الذي يستخدم العميل (أي متصفح الويب - مثل فايرفوكس في Ceno) يحتاج إلى قبول شهادة خاصة صادرة عن العميل نفسه (تُستَخدم فقط على جهازك). يتكلف متصفح Ceno بإعداد هذه الشهادة لاستخدامه الخاص لذا لا داعي للقلق.
ur: **تکنیکی نوٹ:** درحقیقت ایک چھوٹا سا فجائیہ ہے۔ چونکہ کلائنٹ آپ کے ڈیوائس پر چلنے والی HTTP پراکسی کے طور پر کام کرتا ہے، اس لیے کلائنٹ کو ڈیکرپٹ کرنے اور HTTPS مواد کی درخواستوں پر عمل کرنے کے قابل ہونے کے لیے، کلائنٹ کا استعمال کرنے والی ایپلیکیشن (یعنی ویب براؤزر کا حصہ - جیسے CENO میں Firefox) کو کلائنٹ کے ذریعہ جاری کردہ ایک خصوصی سرٹیفکیٹ قبول کرنے کی ضرورت ہے (اور صرف آپ کے ڈیوائس پر استعمال کیا جاتا ہے)۔ CENO براؤزر پہلے سے ہی اس سرٹیفکیٹ کو اپنے نجی استعمال کے لیے ترتیب دینے کا خیال رکھتا ہے تاکہ آپ کو پریشان ہونے کی ضرورت نہ ہو۔

source: However, these direct paths may not be available. For instance, your Internet service provider (ISP) may be blocking access to *X*'s origin server or the proxy because of a state order (even if other traffic is still allowed). As the user of the top left client depicted below, both attempts to reach content *X* (the little document close to its origin server) would fail for you. You may also note the "injector" node on the diagram. We will explain that in a moment.
ar: ومع ذلك، قد لا تكون هذه المسارات المباشرة متاحة. على سبيل المثال، قد يحظر مزود خدمة الإنترنت الخاص بك الوصول إلى الخادم الأصلي لـ *X* أو الوصول إلى الوكيل بسبب أمر حكومي (حتى وإن كانت حركة مرور البيانات الأخرى لا تزال ممكنة). بصفتك مستخدماً للعميل (الأيسر العلوي الموضح أدناه)، ستفشل كلتا المحاولتين للوصول إلى المحتوى *X* (المستند الصغير القريب من الخادم الأصلي). يمكنك أيضًا ملاحظة عقدة "الحاقن" في الرسم التخطيطي. سوف نأتي على شرح ذلك مباشرة.
de: Es kann jedoch sein, dass diese direkten Wege nicht verfügbar sind. So kann beispielsweise Ihr Internetdienstanbieter (ISP) den Zugang zum Ursprungsserver von *X* oder zum Proxy aufgrund einer staatlichen Anordnung blockieren (auch wenn anderer Datenverkehr weiterhin erlaubt ist). Als Benutzer des unten abgebildeten Clients oben links würden beide Versuche, den Inhalt *X* (das kleine Dokument in der Nähe seines Ursprungs-Servers) zu erreichen, für Sie fehlschlagen. Vielleicht bemerken Sie auch den "Injektor"-Knoten im Diagramm. Wir werden das gleich erklären.
es: Sin embargo, estas rutas directas podrían no estar disponibles. Por ejemplo, tu proveedor de servicio de Internet (ISP) podría estar bloqueando el acceso al servidor de origen de *X* o al proxy, debido a una orden estatal (aún si otro tráfico está permitido). Como en el caso del usuario del cliente de arriba a la izquierda ilustrado abajo, ambos intentos de alcanzar el contenido *X* (el pequeño documento cercano a su servidor de origen) fallarían para ti. Puede que también notes el nodo "inyector" en el diagrama. Explicaremos eso en un momento.
fa: با این حال، این راه‌های مستقیم شاید در دسترس نباشند. برای مثال، شرکت ارائه‌دهنده‌ی خدمات اینترنتی (ISP) شما ممکن است دسترسی به سرور اصلی *X* یا پراکسی آن را بر اساس یک دستور دولتی مسدود کند (حتی اگر ترافیک دیگر هنوز مجاز باشد). همچون کاربر سرویس‌گیرنده‌ی بالا سمت چپ که در پایین به تصویر کشیده شده است، هردو تلاش برای دسترسی به محتوای *X* (سند کوچک نزدیک به سرور اصلی آن) برایتان ناکام خواهد ماند. شاید به گره «انژکتور» روی دیاگرام نیز دقت کنید. این را هم‌اینک توضیح خواهیم داد.
fr: Il se peut cependant que ces chemins directs ne soient pas disponibles. Par exemple, votre fournisseur d'accès Internet (FAI) peut bloquer l'accès au serveur d'origine de *X* ou au proxy pour des raisons d'ordre public (même si le reste du trafic est toujours autorisé). De la même manière que pour l'utilisateur du client représenté ci-dessous en haut à gauche, les deux tentatives d'accès au contenu *X* (le petit document proche de son serveur d'origine) vont échouer pour vous. Vous remarquerez également que le nœud "injecteur" est représenté sur le schéma. Nous reviendrons là-dessus plus tard.
my: သို့သော် ဤတိုက်ရိုက်လမ်းကြောင်းများကို မရကောင်းမရနိုင်ပါ။ ဥပမာ- သင့် အင်တာနက် ဝန်ဆောင်မှု ပံ့ပိုးသူ (ISP) သည် အစိုးရ အမိန့်ကြောင့် (အခြားအသွားအလာကို ခွင့်ပြုသေးသည့်တိုင်အောင်) *X* ၏ မူလ ဆာဗာ သို့မဟုတ် ပရောက်စီကို ဝင်ရောက်သုံးစွဲခွင့် ပိတ်ဆို့ထားနိုင်သည်။ အောက်တွင်ဖော်ပြထားသော ဘယ်ဘက်ထိပ်ရှိ လက်ခံစက်ကို သုံးစွဲသူအဖြစ် အကြောင်းအရာ *X* (၎င်း၏ မူလ ဆာဗာအနီးရှိ စာရွက်စာတမ်းငယ်) သို့ ရောက်ရှိရန် ကြိုးပမ်းမှု နှစ်ခုလုံးသည် သင့်အတွက် အောင်မြင်မည် မဟုတ်ပါ။ သင်သည် ပုံပေါ်ရှိ "ထိုးသွင်းဖိုင်" ဆက်သွယ်ရေးပွိုင့်ကိုလည်း သတိပြုမိနိုင်သည်။ ကျွန်ုပ်တို့သည် ခဏအကြာတွင် ထိုအကြောင်းကို ရှင်းပြပါမည်။
pt_br: No entanto, estes caminhos diretos podem não estar disponíveis. Por exemplo, seu provedor de serviço de Internet (ISP) pode estar bloqueando o acesso à origem de *X* ou ao proxy por causa de uma determinação do Estado (mesmo se outros tipos de tráfego continuarem permitidos). Assim como para o usuário do cliente do canto superior esquerdo ilustrado abaixo, ambas as tentativas de alcançar o conteúdo *X* (o pequeno documento perto do servidor de origem dele) iriam falhar para você. Observe, também, o nó "injetor" no diagrama. Explicaremos esse em um instante.
ru: Однако эти прямые пути могут быть недоступны. Например, ваш интернет-провайдер (ISP) может блокировать доступ к исходному серверу *X* или прокси из-за государственного распоряжения (даже если другой трафик все еще разрешен). Как пользователь левого верхнего клиента, изображенного ниже, обе попытки получить доступ к содержимому *X* (маленький документ рядом с исходным сервером) для вас будут неудачными. Вы также можете заметить на диаграмме узел "инъектор". Мы объясним это в ближайшее время.
tr: Fakat bu yöntemler her zaman kullanılamayabilir. Örneğin internet hizmeti sağlayıcınız (ISS) mahkeme kararıyla *X* içeriğinin kaynak sunucusuna ya da vekil sunucuya erişilmesini engelliyor olabilir. Aşağıda görülebileceği gibi sol üstteki istemcinin kullanıcısı olarak her iki *X* (kaynak sunucunun yanındaki küçük belge simgesi) içeriğine erişme girişiminiz de başarısız olur. Şekildeki "içerik ekleyici (injector)" katılımcısı ise ilerleyen bölümde açıklanacaktır.
uk: Однак ці прямі шляхи можуть бути недоступними. Наприклад, ваш інтернет-провайдер (ISP) може блокувати доступ до вихідного сервера *X* або проксі через державне розпорядження (навіть якщо інший трафік все ще дозволено). Як користувач лівого верхнього клієнта, зображеного нижче, обидві спроби отримати доступ до вмісту *X* (маленький документ біля вихідного сервера) для вас будуть невдалими. Ви також можете помітити на діаграмі вузол «ін'єктор». Ми пояснимо це трохи згодом.
ur: تاہم، یہ براہ راست راستے دستیاب نہیں ہوسکتے ہیں۔ مثال کے طور پر، آپ کا انٹرنیٹ سروس فراہم کنندہ (ISP) ریاستی حکم کی وجہ سے *X* کے اصل سرور یا پراکسی تک رسائی کو روک رہا ہے (چاہے دوسری ٹریفک کی اجازت ہو)۔ جیسا کہ اوپر بائیں کلائنٹ کا صارف ذیل میں دکھایا گیا ہے، *X* مواد تک پہنچنے کی دونوں کوششیں (اس کے اصل سرور کے قریب چھوٹی دستاویز) آپ کے لیے ناکام ہو جائیں گی۔ آپ ڈایاگرام پر "انجیکٹر" نوڈ کو بھی نوٹ کر سکتے ہیں۔ ہم ایک لمحے میں اس کی وضاحت کریں گے۔

source: ![Figure: Client cannot reach content directly](images/user-flow-0.svg)
ar: ![الشكل: العميل لا يمكنه الوصول إلى المحتوى مباشرة](images/user-flow-0.svg)
de: ![Abbildung: Client kann Inhalt nicht direkt erreichen](images/user-flow-0.svg)
es: ![Figura: El cliente no puede alcanzar al contenido directamente](images/user-flow-0.svg)
fa: ![شکل: سرویس‌گیرنده نمی‌تواند مستقیماً به محتوا دسترسی داشته باشد](images/user-flow-0.svg)
fr: ![Visuel : Le client ne peut pas atteindre directement le contenu](images/user-flow-0.svg)
my: ![ပုံ- လက်ခံစက်သည် အကြောင်းအရာသို့ တိုက်ရိုက် မရောက်ရှိနိုင်ပါ](images/user-flow-0.svg)
pt_br: ![Figura: Cliente não consegue alcançar o conteúdo diretamente](images/user-flow-0.svg)
ru: ![Рисунок: Клиент не может получить доступ к контенту напрямую](images/user-flow-0.svg)
tr: ![Görsel: İstemci içeriğe doğrudan erişemiyor](images/user-flow-0.svg)
uk: ![Малюнок: Клієнт не може отримати доступ до контенту напряму](images/user-flow-0.svg)
ur: ![تصویر: کلائنٹ براہ راست مواد تک نہیں پہنچ سکتا](images/user-flow-0.svg)

source: With a normal browser you would be out of luck. However, with Ouinet you can ask other clients for their copies of content *X*, should they already have a copy. Let us see how Ouinet performs this request.
ar: في متصفح عادي، لن يحالفك الحظ. لكن في Ouinet يمكنك أن تطلب من العملاء الآخرين نسخة من المحتوى *X* إن توفّرت لديهم هذه النسخة. دعونا نرى كيف يقوم Ouinet بتنفيذ هذا الطلب.
de: Mit einem normalen Browser hätten Sie kein Glück. Mit Ouinet können Sie jedoch andere Clients nach ihren Kopien von Inhalt *X* fragen, falls diese bereits eine Kopie besitzen. Sehen wir uns an, wie Ouinet diese Anfrage durchführt.
es: Con un navegador normal tu suerte se habría acabado. Sin embargo, con Ouinet puedes solicitarles a otros clientes sus copias del contenido *X*, en el caso que la tuvieran. Veamos cómo realiza esta solicitud Ouinet.
fa: با یک مرورگر معمولی شانسی نخواهید داشت. اما، با Ouinet می‌توانید از سرویس‌گیرنده‌های دیگر کپی‌های آن‌ها از محتوای *X* را درخواست کنید، البته اگر آن‌ها پیشاپیش یک کپی از آن داشته باشند. بیایید ببینیم که Ouinet چگونه این درخواست را اجرا می‌کند.
fr: Avec un navigateur classique, vous n'auriez pas de chance. Mais avec Ouinet, vous pouvez demander à d'autres clients leurs copies du contenu *X*, s'ils en possèdent une. Voyons comment Ouinet effectue cette demande.
my: ပုံမှန်ဘရောက်ဇာကို သုံးလျှင် သင် ကံကောင်းမည် မဟုတ်ပါ။ သို့သော် Ouinet ကို သုံးလျှင် အခြားလက်ခံစက်များထံတွင် မိတ္တူရှိပြီးဖြစ်ပါက အကြောင်းအရာ *X* အတွက် ၎င်းတို့၏ မိတ္တူများကို တောင်းခံနိုင်သည်။ ဤတောင်းဆိုမှုကို Ouinet က မည်သို့ စွမ်းဆောင်ကြောင်း ကြည့်ကြရအောင်။
pt_br: Com um navegador comum, você não teria sorte. Contudo, com Ouinet você pode pedir a outros clientes as suas cópias do conteúdo *X*, caso eles já possuam uma cópia. Vejamos como a Ouinet realiza essa solicitação.
ru: При использовании обычного браузера вам не повезло бы. Однако с помощью Ouinet вы можете запросить у других клиентов их копии контента *X*, если у них уже есть копия. Давайте посмотрим, как Ouinet выполняет этот запрос.
tr: Normal bir tarayıcıda şansınız olmayacaktı, fakat Ouinet ile diğer istemcilerde varsa, *X* içeriğinin kopyalarını isteyebilirsiniz. Ouinet bu işlemi nasıl yapar görelim.
uk: При використанні звичайного браузера вам би не пощастило. Однак, за допомогою Ouinet ви можете запросити у інших клієнтів їхні копії контенту *X*, якщо ця копія вже є. Погляньмо, як Ouinet виконує цей запит.
ur: ایک عام براؤزر کے ساتھ آپ کی قسمت ختم ہو جائے گی۔ تاہم، Ouinet کے ساتھ آپ دوسرے کلائنٹس سے ان کے *X* مواد کی کاپیاں مانگ سکتے ہیں، کیا ان کے پاس پہلے سے ایک کاپی موجود ہے۔ آئیے دیکھتے ہیں کہ Ouinet اس درخواست کو کیسے انجام دیتا ہے۔

source: Searching for shared content
ar: البحث عن محتوى تمّت مشاركته
de: Suchen nach freigegebenen Inhalten
es: Buscando contenido compartido
fa: جست‌وجوی محتوای مشترک
fr: Recherche de contenu partagé
my: မျှဝေထားသော အကြောင်းအရာကို ရှာခြင်း
pt_br: Procurando conteúdo compartilhado
ru: Поиск общего контента
tr: Paylaşılan içeriğin aranması
uk: Пошук спільного контенту
ur: مشترکہ مواد کی تلاش

source: The set of all content stored by Ouinet clients is called the **distributed cache**, i.e. a store which sits in no single place. But how can your client find which other clients forming the cache have the desired content?
ar: تسمى المحتويات المخزنة بواسطة عملاء Ouinet **ذاكرة التخزين المؤقت الموزعة**، بمعنى أنه مخزن للبيانات لا يتواجد في مكان فيزيائي واحد فقط. ولكن كيف يمكن لعميلك العثور على المحتوى المطلوب عند العملاء الآخرين الذين يشكلون ذاكرة التخزين المؤقت ؟
de: Die Menge aller Inhalte, die von Ouinet-Clients gespeichert werden, wird als **verteilter Cache** bezeichnet, d.h. ein Speicher, der sich an keinem einzigen Ort befindet. Aber wie kann Ihr Client herausfinden, welche anderen Clients, die den Cache bilden, den gewünschten Inhalt haben?
es: El conjunto de todo el contenido almacenado por clientes Ouinet es llamado **caché distribuida**, esto es, un almacenamiento ubicado en múltiples lugares. ¿Pero cómo puede encontrar tu cliente qué otros clientes integrando a la caché tienen el contenido deseado?
fa: مجموعه‌ی تمام محتوای ذخیره‌شده از سوی سرویس‌گیرندگان Ouinet **کش توزیع‌شده** نامیده می‌شود، یعنی یک کش که در هیچ جای واحدی قرار ندارد. اما سرویس‌گیرنده‌ی شما چگونه می‌تواند بفهمد که کدام سرویس‌گیرندگان دیگر سازنده‌ی این کش، آن محتوای دلخواه را در اختیار دارند؟
fr: L'ensemble des contenus stockés par les clients Ouinet est appelé **cache distribué**, autrement dit un stockage qui ne se trouve pas dans un seul et même endroit. Mais comment votre client peut-il trouver les autres clients formant le cache qui disposent du contenu désiré ?
my: Ouinet လက်ခံစက်များက သိုလှောင်ထားသည့် အကြောင်းအရာအားလုံး၏ အစုံလိုက်ကို **ဖြန့်ချိထားသော ယာယီသိမ်းဆည်းထားသည့် မှတ်ဉာဏ်** ဟု ခေါ်သည်။ ဆိုလိုသည်မှာ ၎င်းသည် နေရာတစ်ခုတည်းတွင် ရှိမနေသည့် သိုလှောင်ရာနေရာ ဖြစ်သည်။ သို့သော် ယာယီသိမ်းဆည်းထားသော မှတ်ဉာဏ်ကို ဖြစ်ပေါ်စေသည့် အခြားလက်ခံစက်များမှ မည်သည့်စက်တွင် သင်အလိုရှိသော အကြောင်းအရာ ရှိကြောင်း သင့်လက်ခံစက်က မည်သို့ ရှာတွေ့မည်နည်း။
pt_br: O conjunto de todo o conteúdo armazenado por clientes Ouinet é chamado **cache distribuído**, isto é, um armazenamento que não reside em um único lugar. Mas como o seu cliente pode encontrar quais outros clientes que compõe o cache possuem o conteúdo desejado?
ru: Совокупность всего контента, хранимого клиентами Ouinet, называется **распределенным кэшем**, т.е. хранилищем, которое не находится в одном месте. Но как ваш клиент может найти, какие другие клиенты, образующие кэш, имеют необходимый контент?
tr: Ouinet istemcilerinin depoladığı tüm içeriklere, tek bir yerde bulunmadığından **dağıtılmış ön bellek** denir. İstemciniz, istenilen içeriğin ön belleği oluşturan diğer istemcilerde bulunduğunu nasıl öğrenebilir?
uk: Сукупність всього контенту, що зберігається клієнтами Ouinet, називається **розподіленим кешем**, тобто сховищем, яке НЕ розташоване в одному місці. Але як ваш клієнт розуміє, які інші клієнти, що створюють кеш, мають витребуваний контент?
ur: Ouinet کلائنٹس کے ذریعہ ذخیرہ کردہ تمام مواد کے سیٹ کو **تقسیم شدہ کیش** کہا جاتا ہے، یعنی ایک اسٹور جو کسی ایک جگہ پر نہیں بیٹھتا ہے۔ لیکن آپ کا کلائنٹ کیسے تلاش کر سکتا ہے کہ کیش بنانے والے دوسرے کلائنٹس کے پاس مطلوبہ مواد ہے؟
