Repository: censorship-no/ceno-docs
Catalog: user-manual/*/concepts/how.po
Languages: ar, de, es, fa, fr, my, pt_br, ru, tr, uk, ur

source: In the figure below you can see a possible outcome of that operation: the client first tries to contact the injector directly (e.g. using an Internet address that it got from the injector swarm), but sadly it is already blocked by your ISP; fortunately, the bridge swarm shows the Internet addresses for two other clients which are still able to reach an injector. Your client opens a tunnel to the injector through one of these clients, so the injector gets the request for content *X* from your client, and asks its origin server for it.
ar: في الشكل أدناه، يمكنك رؤية النتيجة المحتملة لهذه العملية: يحاول العميل أولاً الاتصال بالحاقن مباشرة (على سبيل المثال، باستخدام عنوان الإنترنت الذي حصل عليه من سرب الحاقن)، ولكن للأسف قام مزود خدمة الإنترنت الخاص بك بحظره ؛ لحسن الحظ، يعرض سرب الجسر عناوين الإنترنت لعملاء آخرين لا يزالون قادرين على الوصول إلى حاقن. يفتح عميلك نفقًا إلى الحاقن من خلال أحد هؤلاء العملاء، وبالتالي يحصل الحاقن على طلب المحتوى *X* من عميلك، ويطلب ذلك من الخادم الأصلي.
es: En la figura de abajo puedes ver un posible resultado de esa operación: el cliente intenta primero contactar al inyector directamente (ej.: usando una dirección de Internet que obtuvo del enjambre de inyectores), pero, tristemente, ya está bloqueada por tu ISP; afortunadamente, el enjambre de puentes muestra las direcciones de Internet de otros dos clientes que aún son capaces de alcanzar a un inyector. Tu cliente abre un túnel al inyector a través de uno de estos clientes, por lo que el inyector obtiene la solicitud por el contenido *X* desde tu cliente, y se lo solicita a su servidor de origen.
fa: در شکل زیر می‌توانید یک نتیجه‌ی ممکن از آن عملیات را ببینید: سرویس‌گیرنده نخست سعی می‌کند مستقیماً با injector تماس بگیرد (برای مثال، با استفاده از یک نشانی اینترنتی که آن را از انبوه injectorها گرفته است)، بلکه به طرز غم‌انگیزی پیشاپیش توسط شرکت ارائه‌دهنده‌ی خدمات اینترنتی یا ISP شما مسدود شده است؛ متأسفانه، انبوه پل‌ها نشانی‌های اینترنتی را برای دو سرویس‌گیرنده‌ای نشان می‌دهد که هنوز قادر به دستیابی به یک injector هستند. سرویس‌گیرنده‌ی شما تونلی را از طریق این سرویس‌گیرندگان به روی injector می‌گشاید، بنابراینinjector درخواستِ محتوای *X* را از سرویس‌گیرنده‌ی شما می‌گیرد، و آن را از سرور اصلی‌اش طلب می‌کند.
fr: Dans la figure ci-dessous, vous pouvez voir un résultat possible de cette opération : le client essaie d'abord de contacter directement l'injecteur (par exemple, en utilisant une adresse Internet qu'il a obtenue de l'essaim d'injecteurs), mais malheureusement, il est déjà bloqué par votre FAI ; heureusement, l'essaim de passerelles affiche les adresses Internet de deux autres clients qui sont encore en mesure d'atteindre un injecteur. Votre client ouvre un tunnel vers l'injecteur via l'un de ces clients, de sorte que l'injecteur reçoit la demande de contenu *X* de votre client et la demande à son serveur d'origine.
my: အောက်ပါပုံတွင် ထိုလုပ်ဆောင်ချက်၏ ဖြစ်နိုင်ခြေရလဒ်ကို သင်မြင်တွေ့နိုင်ပါသည် - သုံးစွဲသူသည် ထိုးသွင်းစက်ကို တိုက်ရိုက်ဆက်သွယ်ရန် ပထမဆုံး ကြိုးစားပါသည် (ဥပမာ၊ ထိုးသွင်းစက်စာရင်းမှ ရရှိလာသော အင်တာနက်လိပ်စာများကို အသုံးပြုခြင်း)၊ သို့သော် စိတ်မကောင်းစရာမှာ ထိုအင်တာနက်လိပ်စာသည် သင့်ရဲ့ အင်တာနက်ပေးသူမှ ပိတ်ထားပြီးဖြစ်နေပါသည်။ ကံကောင်းစွာဖြင့် ပေါင်းကူးလက်ခံစက်စာရင်းက ထိုးသွင်းစက်ကို ရနိုင်သော တခြားသုံးစွဲသူနှစ်ယောက်ကို အင်တာနက်စာမျက်နှာလိပ်စာအား ပြပေးပါသည်။ သင့်ရဲ့ သုံးစွဲသူက တခြားသောသုံးစွဲသူတစ်ယောက်ထံမှတစ်ဆင့်ထိုးသွင်းစက်ကို ချိတ်ဆက်လှိုဏ်ခေါင်းမှတစ်ဆင့် ဖွင့်ပေးပြီးတဲ့အခါ သင်တို့ရဲ့ သုံးစွဲသူဆီကနေ ပါဝင်တဲ့ အကြောင်းအရာ *X* ကို ထိုးသွင်းစက်က တောင်းဆိုပြီး ထိုအကြောင်းအရာကို မူလဆာဗာမှ တောင်းပေးပါသည်။
pt_br: Na figura abaixo, você pode ver um possível resultado dessa operação: o cliente primeiro tenta contatar o injetor diretamente (exemplo, usando o endereço de Internet que ele obteve do swarm injetor), mas infelizmente ele está bloqueado pelo seu ISP. Por sorte, o swarm ponte exibe os endereços de Internet para dois outros clientes que ainda conseguem alcançar um injetor. Seu cliente abre um túnel para o injetor através de um desses clientes, de modo que o injetor obtém a solicitação para o conteúdo *X* advinda do seu cliente e pede tal conteúdo ao servidor de origem.
ru: На рисунке ниже показан возможный результат этой операции: клиент сначала пытается связаться с инъектором напрямую (например, используя интернет-адрес, который он получил от узла инъекторов), но, к сожалению, он уже заблокирован вашим провайдером; к счастью, узел мостов показывает интернет-адреса двух других клиентов, которые все еще могут связаться с инъектором. Ваш клиент открывает туннель к инъектору через одного из этих клиентов, поэтому инъектор получает запрос на контент *X* от вашего клиента и запрашивает его у своего исходнгого сервера.
tr: Aşağıdaki şekilde, bu işlemin olası bir sonucunu görebilirsiniz: İstemci önce içerik ekleyiciye doğrudan ulaşmaya çalışır (örneğin, içerik ekleyici havuzundan aldığı bir internet adresini kullanır). Ancak ne yazık ki internet hizmeti sağlayıcısı tarafından engellenmiştir. Neyse ki, köprü havuzu, içerik ekleyiciye erişebilen iki farklı istemcinin internet adreslerini gösterir. İstemciniz, bu istemcilerden biri üzerinden içerik ekleyiciye bir geçit açar. Böylece içerik ekleyici, istemciden X içeriği isteğini alır ve kaynak sunucudan bunu isteyebilir.
uk: На малюнку нижче показаний можливий результат цієї операції: клієнт спочатку намагається зв'язатися з ін'єктором безпосередньо (наприклад, використовуючи інтернет-адресу, яку він отримав від «рою ін'єкторів»), але, на жаль, він вже заблокований вашим провайдером; на щастя, рій мостів показує інтернет-адреси двох інших клієнтів, які здатні зв'язатися з ін'єктором. Ваш клієнт відкриває тунель до ін'єктора через одного з цих клієнтів, тому ін'єктор отримує запит на контент *X* від вашого клієнта та запитує його у вихідного сервера.
ur: نیچے دی گئی تصویر میں آپ اس آپریشن کا ممکنہ نتیجہ دیکھ سکتے ہیں: کلائنٹ پہلے انجیکٹر سے براہ راست رابطہ کرنے کی کوشش کرتا ہے (مثال کے طور پر انٹرنیٹ ایڈریس کا استعمال کرتے ہوئے جو اسے انجیکٹر بھیڑ سے ملا ہے)، لیکن افسوس کی بات یہ ہے کہ اسے آپ کے ISP نے پہلے ہی بلاک کر دیا ہے۔ خوش قسمتی سے، پل بھیڑدو دیگر کلائنٹس کے انٹرنیٹ ایڈریس دکھاتا ہے جو اب بھی انجیکٹر تک پہنچنے کے قابل ہیں۔ آپ کا کلائنٹ ان کلائنٹس میں سے ایک کے ذریعے انجیکٹر کے لیے ایک سرنگ کھولتا ہے، لہذا انجیکٹر کو آپ کے کلائنٹ سے مواد *X* کی درخواست ملتی ہے، اور اس کے لیے اپنے اصل سرور سے پوچھتا ہے۔

source: ![Figure: Client reaches for injector](images/user-flow-2.svg)
ar: ![الشكل: العميل يحاول الوصول إلى الحاقن](images/user-flow-2.svg)
de: ! [Abbildung: Client greift zum Injektor] (Bilder/User-Flow-2.svg)
es: ![Figura: El cliente alcanza al inyector](images/user-flow-2.svg)
fa: ![شکل: سرویس‌گیرنده به injector دست می‌یابد](images/user-flow-2.svg)
fr: ![Figure : Le client atteint l'injecteur](images/user-flow-2.svg)
my: ![ပုံ - သုံးစွဲသူမှ ထိုးသွင်းစက်ထံ ရောက်ရှိလာပုံ](images/user-flow-2.svg)
pt_br: ![Figura: Cliente alcança o injector](images/user-flow-2.svg)
ru: ![Рисунок: Клиент обращается к инъектору](images/user-flow-2.svg)
tr: ![Görsel: İstemcinin içerik ekleyiciye erişmesi](images/user-flow-2.svg)
uk: ![Малюнок: Клієнт звертається до ін'єктора](images/user-flow-2.svg)
ur: ![تصویر: کلائنٹ انجیکٹر تک پہنچ جاتا ہے](images/user-flow-2.svg)

source: As content *X* is received by the injector, it signs it with its key, adds the signature to the content and sends it back to your client via the tunnel it arrived from (say, through the client sitting beyond the blocking). Once the content reaches your client, it does three things:
ar: عندما يستقبل الحاقن المحتوى *X*، فإنه يوقعه بمفتاحه ويضيف التوقيع إلى المحتوى ويرسله مرة أخرى إلى عميلك عبر النفق الذي وصل منه (على سبيل المثال، من خلال عميل يقع خارج الحظر). بمجرد وصول المحتوى إلى عميلك، يقوم بثلاثة أشياء:
de: Wenn der Injektor den Inhalt *X* empfängt, signiert er ihn mit seinem Schlüssel, fügt die Signatur dem Inhalt hinzu und sendet ihn über den Tunnel, über den er gekommen ist, an Ihren Client zurück (z. B. über den Client, der hinter der Blockierung sitzt). Sobald der Inhalt Ihren Client erreicht, führt er drei Dinge aus:
es: A medida que el contenido *X* es recibido por el inyector, lo firma con su clave, añade la firma al contenido y lo envía hacia tu cliente a través del túnel por el que arribó (digamos, a través del cliente que está más allá del bloqueo). Una vez que el contenido alcanza a tu cliente, hace tres cosas:
fa: در همان حال که محتوای *X* از سوی injector دریافت می‌شود، این محتوا را با کلیدش امضا می‌کند، امضا را به محتوا می‌افزاید و آن را از طریق تونلی که از آن درآمده به سرویس‌گیرنده‌تان پس فرستاده می‌شود (مثلاً از طریق قرارگرفتن سرویس‌گیرنده فراتر از انسداد). همین که محتوا به سرویس‌گیرنده‌تان رسید، این سه کار را انجام می‌دهد:
fr: Lorsque le contenu *X* est reçu par l'injecteur, il le signe avec sa clé, ajoute la signature au contenu et le renvoie à votre client via le tunnel d'où il est arrivé (par exemple, via le client assis au-delà du blocage). Une fois que le contenu atteint votre client, il fait trois choses :
my: အကြောင်းအရာ * X * ကိုထိုးသွင်းစက်မှ လက်ခံရရှိသည်နှင့်တစ်ပြိုင်နက် ထိုးသွင်းစက်သည် ၎င်း၏သော့နှင့်အမှတ်အသားပြုလုပ်ပြီး အကြောင်းအရာထဲသို့လက်မှတ်ကိုထည့်သည်။ ထိုးသွင်းစက်သည် ပြန်လည်ရောက်ရှိလာသော အကြောင်းအရာ*X*ကို ချိတ်ဆက်လိုဏ်ခေါင်းမှတဆင့် သင်၏သုံးစွဲသူထံ ပြန်ပို့သည် (ပိတ်ဆို့ခြင်းကို ကျော်လွန်လျက် ရှိနေသော သုံးစွဲသူဟု ဆိုကြပါစို့)။ အကြောင်းအရာသည် သင်၏သုံးစွဲသူထံ တစ်ခါမျှရောက်ပြီးသည်နှင့်တစ်ပြိုင်နက် ၎င်းသည်အချက်သုံးချက်ကိုလုပ်ဆောင်သည်။
pt_br: Conforme o conteúdo *X* é recebido pelo injetor, este o assina com sua chave, adiciona a assinatura ao conteúdo e o devolve ao seu cliente pelo túnel de onde ele veio (digamos, através do cliente localizado além do bloqueio). Uma vez que o conteúdo alcança o seu cliente, ele realiza três ações:
ru: Когда инъектор получает контент *X*, он подписывает его своим ключом, добавляет подпись к контенту и отправляет его обратно вашему клиенту через туннель, по которому он пришел (скажем, через клиента, сидящего за пределами блокировки). Как только содержимое достигает вашего клиента, он делает три вещи:
tr: İçerik ekleyici, *X* içeriğini aldığında, bunu anahtarını kullanarak imzalar, imzayı içeriğe ekler ve geçit üzerinden gönderir (örneğin, engelleme arkasındaki istemci ile). İçerik istemcinize ulaştığında, üç şey yapılır:
uk: Коли ін'єктор отримує контент *X*, він підписує його своїм ключем, додає підпис до контенту і відправляє його назад вашому клієнту через тунель, яким він прийшов (скажімо, через клієнта, що перебуває за межами території блокування). Як тільки вміст досягає вашого клієнта, він робить три речі:
ur: جیسا کہ مواد *X* انجیکٹر کو موصول ہوتا ہے، یہ اپنی کلید کے ساتھ اس پر دستخط کرتا ہے، مواد میں دستخط شامل کرتا ہے اور اسے آپ کے کلائنٹ کو اس سرنگ کے ذریعے واپس بھیج دیتا ہے جہاں سے یہ آیا تھا (کہیں، بلاکنگ سے باہر بیٹھے کلائنٹ کے ذریعے)۔ مواد آپ کے کلائنٹ تک پہنچنے کے بعد، یہ تین چیزیں کرتا ہے:

source: It delivers it to you (in the case of Ceno, it shows the content on the browser).
ar: يقوم بتوصيله لك (في حالة Ceno، فإنه يعرض المحتوى في المتصفح).
ur: یہ آپ کو فراہم کرتا ہے (CENO کی صورت میں، یہ براؤزر پر موجود مواد کو دکھاتا ہے)۔

source: It saves the content on your device for further seeding to other clients. It will stay there for a configurable amount of time, or until you decide to clear all stored content.
ar: يحفظ المحتوى على جهازك ليوزعه لاحقًا لعملاء آخرين. سيبقى هناك لفترة زمنية قابلة للتهيئة، أو حتى تقرر مسح كل المحتوى المخزّن.
de: Es speichert die Inhalte auf Ihrem Gerät, um sie an andere Clients weiterzugeben. Sie verbleiben dort für eine konfigurierbare Zeitspanne oder bis Sie sich entscheiden, alle gespeicherten Inhalte zu löschen.
es: Guarda el contenido en tu dispositivo para su ulterior sembrado a otros clientes. Permanecerá allí por un periodo de tiempo configurable, o hasta que decidas limpiar todo el contenido almacenado.
fa: این محتوا را برای بذرپاشی بعدی به سرویس‌گیرندگان دیگر روی دستگاه‌تان ذخیره می‌کند. این محتوا برای مدت زمانی قابل‌تنظیم در آن‌جا باقی خواهد ماند، یا تا زمانی که شما تصمیم بگیرید تا تمام محتوای ذخیره‌شده را پاک کنید.
fr: Il enregistre le contenu sur votre appareil pour un partage ultérieur avec d'autres clients. Il y restera pendant une durée configurable ou jusqu'à ce que vous décidiez d'effacer tout le contenu stocké.
my: ထိုးသွင်းစက်သည် အခြားသော သုံးစွဲသူများကို အကြောင်းအရာများ ဆက်လက်မျှဝေနိုင်ရန် ၄င်းတို့ကို သင့်စက်ပေါ်တွင်သိမ်းထားသည်။ အကြောင်းအရာများသည် သတ်မှတ်ထားသော အချိန်အတိုင်းအတာတစ်ခုအထိ သို့မဟုတ် သိမ်းထားသော အကြောင်းအရာများအားလုံးကို ဖျက်ပစ်လိုက်ရန် သင်ဆုံးဖြတ်သောအချိန်အထိ သင့်စက်ပေါ်တွင် ရှိနေပါလိမ့်မည်။
pt_br: Salva o conteúdo no seu dispositivo a fim de semear para outros clientes no futuro. Ele ficará lá por um intervalo de tempo configurável, ou até que você decida limpar todo o conteúdo armazenado.
ru: Он сохраняет контент на вашем устройстве для последующей передачи другим клиентам. Он будет храниться там в течение настраиваемого периода времени или до тех пор, пока вы не решите очистить весь сохраненный контент.
tr: İçerik diğer istemcilere gönderilmek üzere aygıtınıza kaydedilir. Ayarlanabilir bir süre boyunca ya da kaydedilmiş içerikler silinene kadar tutulur.
uk: Він зберігає контент на вашому пристрої для подальшої передачі іншим клієнтам. Він буде зберігатися там впродовж визначеного періоду часу (це можна налаштувати) або доти, доки ви не вирішите очистити весь збережений контент.
ur: یہ آپ کے ڈیوائس پر موجود مواد کو دوسرے کلائنٹس کے لیے مزید سیڈنگ کے لیے محفوظ کرتا ہے۔ یہ وہاں ایک قابل ترتیب وقت تک رہے گا، یا جب تک آپ تمام ذخیرہ شدہ مواد کو صاف کرنے کا فیصلہ نہیں کرتے۔

source: It announces in the distributed cache index that it is in possession of a copy of that content, so that other clients can find it.
ar: يعلن في فهرس ذاكرة التخزين المؤقت الموزعة أنه بمتلك نسخة من هذا المحتوى، بحيث يستطيع للعملاء الآخرين العثور عليها.
de: Er meldet im verteilten Cache-Index, dass er im Besitz einer Kopie dieses Inhalts ist, so dass andere Clients ihn finden können.
es: Anuncia en el índice de la caché distribuida que está en posesión de una copia de ese contenido, de manera que otros clientes puedan encontrarlo.
fa: این در نمایه‌ی کش توزیع‌شده اعلام می‌کند که یک نسخه از آن محتوا را در اختیار دارد، طوری که سایر سرویس‌گیرندگان بتوانند آن را بیابند.
fr: Il annonce dans l'index de cache distribué qu'il est en possession d'une copie de ce contenu, afin que d'autres clients puissent le trouver.
my: ထိုးသွင်းစက်သည် အကြောင်းအရာမိတ္တူတစ်စုံပိုင်ဆိုင်ကြောင်း၊ ထို့ကြောင့် အခြားသော သုံးစွဲသူများမှ ရှာတွေ့နိုင်ကြောင်းကို ဖြန့်ချိထားသော ယာယီမှတ်ဥာဏ်အညွှန်းကိန်းထဲတွင် ကြေညာလိုက်သည်။
pt_br: Anuncia no índex do cache distribuído que possui uma cópia daquele conteúdo, assim outros clientes podem encontrá-lo.
ru: Он объявляет в индексе распределенного кэша, что у него есть копия этого контента, чтобы другие клиенты могли его найти.
tr: Diğer istemcilerin bulabilmesi için içeriğin kopyasının bulunduğu dağıtılmış ön bellek dizinine duyurulur.
uk: Він оголошує в індексі розподіленого кеша, що має копію цього контенту, щоб інші клієнти могли його знайти.
ur: یہ تقسیم شدہ کیش انڈیکس میں اعلان کرتا ہے کہ اس مواد کی ایک کاپی اس کے پاس ہے، تاکہ دوسرے کلائنٹس اسے تلاش کر سکیں۔

source: The whole combined operation of retrieval, signing, storage and announcement is what we call **content injection**, as shown in the figure below.
ar: العملية المركبة للاسترجاع والتوقيع والتخزين والإعلان هي ما نسميه **حقن المحتوى**، كما هو موضح في الشكل أدناه.
de: Der gesamte kombinierte Vorgang des Abrufens, Signierens, Speicherns und Ankündigens wird als **Inhaltsinjektion** bezeichnet, wie in der folgenden Abbildung dargestellt.
es: La operación combninada completa de descarga, firmado, almacenamiento y anuncio es lo que llamamos **inyección de contenido**, como se muestra en la figura de abajo.
fa: کل عملیات مرکب بازیابی، امضا، ذخیره‌کردن و اعلام همان چیزی است که ما آن را **تزریق محتوا** می‌نامیم، همان‌طور که در شکل زیر نشان داده شده است.
fr: Il annonce dans l'index de cache distribué qu'il est en possession d'une copie de ce contenu, donc que d'autres clients puissent le trouver.
my: ပြန်ထုတ်ခြင်း၊ လက်မှတ်ထိုးခြင်း၊ သိမ်းဆည်းနေရာနှင့် ကြေညာချက် အစရှိသည်တို့ ပေါင်းစပ်ထားသော လုပ်ဆောင်ချက်တစ်ခုလုံးကို ကျွန်ုပ်တို့က **အကြောင်းအရာကို ထိုးသွင်းခြင်း** ဟုခေါ်သည်။ အောက်ဖော်ပြပါပုံတွင် ကြည့်ပါ။
pt_br: Toda a operação combinada de recuperação, assinatura, armazenamento e anúncio é o que chamamos **injeção de conteúdo**, como mostrado na figura abaixo.
ru: Вся совокупность операций по извлечению, подписанию, хранению и объявлению является тем, что мы называем **инъекцией контента**, как показано на рисунке ниже.
tr: Aşağıda içeriklerin alınması, imzalanması, kaydedilmesi ve duyurulması işlemlerinin tümünü kapsayan **içerik ekleme** işlemini görebilirsiniz.
uk: Уся сукупність операцій з вилучення, підписання, зберігання та оголошення є тим, що ми називаємо **ін'єкцією контенту**, як це показано на малюнку нижче.
ur: بازیافت، دستخط کرنے، ذخیرہ کرنے اور اعلان کے پورے مشترکہ عمل کو ہم **مواد کا انجیکشن** کہتے ہیں، جیسا کہ نیچے دی گئی تصویر میں دکھایا گیا ہے۔

source: ![Figure: Client receives signed content from injector](images/user-flow-3.svg)
ar: ![الشكل: تلقي العميل محتوى موقّعًا من الحاقن](images/user-flow-3.svg)
es: ![Figura: El cliente recibe contenido firmado del inyector](images/user-flow-3.svg)
fa: ![شکل: سرویس‌گیرنده محتوای امضاشده را از injector دریافت می‌کند](images/user-flow-3.svg)
fr: ![Figure : Le client reçoit le contenu signé de l'injecteur](images/user-flow-3.svg)
my: ![ပုံ - ထိုးသွင်းစက်မှ လက်မှတ်ထိုးပြီးသော အကြောင်းအရာများကို သုံးစွဲသူမှ လက်ခံရရှိပုံ](images/user-flow-3.svg)
pt_br: ![Figura: Cliente recebe conteúdo assinado do injetor](images/user-flow-3.svg)
ru: ![Рисунок: Клиент получает подписанный контент от инъектора](images/user-flow-3.svg)
tr: ![Görsel: İstemci içerik ekleyiciden imzalanmış içerik alıyor](images/user-flow-3.svg)
uk: ![Малюнок: Клієнт отримує підписаний контент від ін'єктора](images/user-flow-3.svg)
ur: ![تصویر: کلائنٹ کو انجیکٹر سے دستخط شدہ مواد موصول ہوتا ہے](images/user-flow-3.svg)

source: Browsing under complete blocking
ar: التصفح خلال الحظر الشامل
es: Navegando bajo bloqueo completo
fa: مرورگری تحت مسدود بودن کامل
fr: Navigation sous blocage complet
my: အပြည့်အဝ ပိတ်ဆို့ခံထားရခြင်းတွင် အင်တာနက်စာမျက်နှာများအား ရှာဖွေခြင်း
pt_br: Navegando sob bloqueio total
ru: Просмотр страниц при полной блокировке
tr: Tam engelleme uygulandığında gezinme
uk: Перегляд сторінок при повному блокуванні
ur: مکمل بلاکنگ کے تحت براؤزنگ

source: Please note that the mechanism described above still requires that *some path exists* across blocking and towards the rest of the Internet. But sometimes that path will also be missing: think about complete international disconnections, natural disasters, or simply excessive congestion of the few existing paths (due to everybody trying to go across them). This is where the real power of the distributed cache comes into play.
ar: يرجى الملاحظة أن الآلية الموضحة أعلاه لا تزال تتطلب *وجود بعض المسارات* خلال الحظر نحو بقية الإنترنت. لكن في بعض الأحيان تكون حتى هذه المسارات مفقودة: فكر في الانقطاع الشامل للاتصال الدولي بالإنترنت، أو الكوارث الطبيعية، أو ببساطة الازدحام في المسارات القليلة الموجودة (بسبب محاولة الجميع عبورها). هنا تتجلى القوة الحقيقية لذاكرة التخزين المؤقت الموزعة.
de: Bitte beachten Sie, dass der oben beschriebene Mechanismus immer noch voraussetzt, dass *ein Weg über die Sperrung und zum Rest des Internets existiert*. Aber manchmal wird dieser Pfad auch fehlen: Denken Sie an komplette internationale Verbindungsabbrüche, Naturkatastrophen oder einfach eine übermäßige Überlastung der wenigen vorhandenen Pfade (weil jeder versucht, sie zu benutzen). Hier kommt die wahre Stärke des verteilten Cache ins Spiel.
es: Por favor nota que el mecanismo descripto arriba aún requiere que *exista alguna ruta* a través del bloqueo y hacia el resto de Internet. Pero a veces, esa ruta también faltará: piensa acerca de desconexiones internacionales completas, desastres naturales, o simplemente, congestión excesiva de las pocas rutas existentes (debido a que todos están intentando usarlas). Aquí es donde el poder real de la caché distribuida empieza a jugar.
fa: لطفاً توجه کنید که سازوکار توصیف‌شده در بالا همچنان نیازمند آن است که برای عبور از انسداد *مسیری در میان باشد* که به‌سوی بقیه‌ی اینترنت گشوده باشد. اما گاهی آن مسیر نیز در میان نخواهد بود؛ به قطعی‌های کامل بین‌المللی، فاجعه‌های طبیعی، یا صرفاً تراکم و ازدحام مفرط چند مسیر موجود (به علت تلاش همه برای رفتن در امتدادشان) فکر کنید. این همان جایی است که قدرت واقعی کش توزیع‌شده وارد بازی می‌شود.
fr: Veuillez noter que le mécanisme décrit ci-dessus nécessite toujours qu'*un chemin existe* à travers le blocage et vers le reste de l'Internet. Mais parfois, ce chemin sera également absent : pensez à des déconnexions internationales complètes, à des catastrophes naturelles ou simplement à une congestion excessive des quelques chemins existants (en raison du fait que tout le monde essaie de les traverser). C'est là que la véritable puissance du cache distribué entre en jeu.
pt_br: Por favor, observe que o mecanismo descrito acima ainda demanda que *exista algum caminho* que atravesse o bloqueio em direção ao resto da Internet. Mas algumas vezes este caminho também estará em falta: pense em desconexões internacionais totais, desastres naturais ou simplesmente congestionamento excessivo dos poucos caminhos existentes (devido a todas as pessoas tentarem passar por eles). É neste momento que o poder do cache distribuído entra em ação.
ru: Обратите внимание, что описанная выше схема по-прежнему требует, чтобы *некоторый путь существовал* через блокировку и к остальной части Интернета. Но иногда этот путь может отсутствовать: подумайте о полном международном отключении, стихийных бедствиях или просто чрезмерной перегрузке немногих существующих путей (из-за того, что все пытаются пройти через них). Именно здесь и проявляется реальная сила распределенного кэша.
tr: Yukarıda açıklanan yöntemler için engelleme dışında kalan ve internetin geri kalanına erişilebilen *bazı yolların olması* gerektiğini unutmayın. Bazı durumlarda bu yollar da olmayabilir: Uluslararası bağlantı kesintileri, doğal afetler veya az olan yolların aşırı kullanılması (herkesin aynı içeriğe erişmeye çalışması) gibi durumları düşünebilirsiniz. Dağıtılmış ön belleğin gerçek gücü bu gibi durumlarda ortaya çıkar.
uk: Будь ласка, зверніть увагу, що описана вище схема, як і раніше, вимагає, щоб *існував шлях* крізь блокування і до решти інтернету. Але іноді цього шляху може не бути: візьміть до уваги повне міжнародне відключення, стихійні лиха або просто надмірне навантаження небагатьох наявних шляхів (з огляду на те, що всі намагаються скористатися ними). Саме тут і проявляється дійсна сила розподіленого кешу.
ur: براہ کرم نوٹ کریں کہ اوپر بیان کردہ طریقہ کار اب بھی اس بات کا تقاضا کرتا ہے کہ بلاک کرنے اور باقی انٹرنیٹ کی طرف *کچھ راستہ موجود* ہو۔ لیکن بعض اوقات وہ راستہ بھی غائب ہو جائے گا: مکمل بین الاقوامی رابطہ منقطع ہونے، قدرتی آفات، یا صرف چند موجودہ راستوں کی ضرورت سے زیادہ بھیڑ کے بارے میں سوچیں (ہر کوئی ان کو عبور کرنے کی کوشش کر رہا ہے)۔ یہ وہ جگہ ہے جہاں تقسیم شدہ کیش کی اصل طاقت کام میں آتی ہے۔
