Repository: censorship-no/ceno-docs
Catalog: user-manual/*/concepts/how.po
Languages: ar, de, es, fa, fr, my, pt_br, ru, tr, uk, ur

source: Your client need not know their Internet addresses in advance; instead, it performs a lookup in the **injector swarm** (another term from P2P file sharing), a single-entry distributed index similar to the distributed cache index which yields the addresses of currently available injectors.
ar: لا يحتاج عميلك إلى معرفة عناوين الإنترنت الخاصة بها مسبقًا؛ بدلاً من ذلك، يقوم بإجراء بحث في **سرب الحاقنات** (مصطلح آخر من عالم مشاركة الملفات عبر تقنية نظير لنظير)، وهو فهرس موزّع بمدخل واحد مشابه لفهرس ذاكرة التخزين المؤقت الموزع الذي ينتج عناوين الحاقنات المتاحة حاليًا.
de: Ihr Client muss deren Internetadressen nicht im Voraus kennen; stattdessen führt er eine Suche im **Injektorschwarm** (ein weiterer Begriff aus dem P2P-Filesharing) durch, einem verteilten Index mit nur einem Eintrag, ähnlich dem verteilten Cache-Index, der die Adressen der aktuell verfügbaren Injektoren liefert.
es: Tu cliente no necesita saber sus direcciones de Internet con anticipación; en vez de eso, reliza una búsqueda en el **enjambre de inyectores** (otro término de la compartición de archivos P2P), un índice distribuido de entrada única similar al índice de la caché distribuida, el cual suministra las direcciones de los inyectores disponibles en este momento.
fa: سرویس‌گیرنده‌ی شما لازم نیست نشانی‌های اینترنتی‌اش را از قبل بشناسد؛ در عوض، یک جست‌وجو را در **انبوه injectors** اجرا می‌کند (اصطلاح دیگری از اشتراک فایل P2P)، یک نمایه‌ی تک‌مدخلی توزیع‌شده همانند کش توزیع‌شده که نشانی‌های injectors اینک در دسترس را فراهم می‌کند.
fr: Votre client n'a pas besoin de connaître ses adresses Internet à l'avance ; à la place, il effectue une recherche dans **l'essaim d'injecteurs** (un autre terme du partage de fichiers P2P), un index distribué à entrée unique similaire à l'index de cache distribué qui donne les adresses des injecteurs actuellement disponibles.
my: သင့် လက်ခံစက် အနေဖြင့် ထိုးသွင်းစက်များ၏ အင်တာနက် လိပ်စာများကို ကြိုသိထားရန် မလိုပါ။ ထို့အစား သင့်လက်ခံစက်က ချိတ်ဆက်လိုသည့် အချိန်တွင် **ထိုးသွင်းစက်စာရင်း** (P2P ဖိုင်မှမျှဝေခြင်း မှ အခေါ်အဝေါ်) မှ ချိတ်ဆက်နိုင်မည့် ထိုးသွင်းစက် လိပ်စာများကို သွားရောက် ရှာဖွေ လိမ့်မည်။ ထိုးသွင်းစက် စာရင်းဆိုသည်မှာ ဖြန့်ချီထားသော ယာယီ မှတ်ဉာဏ် အညွှန်းကဲ့သို့ပင် တစ်ကြိမ်လျှင်စာရင်းတစ်ခု အဖြစ် ဖြန့်ချီထားသည့် အညွှန်းပင်ဖြစ်သည်။
pt_br: Seu cliente não precisa saber seus endereços de Internet com antecedência; ao invés disso, ele realiza uma busca no **injetor swarm** (outro termo de compartilhamento de arquivos P2P), um índex distribuído de entrada única similar ao índex do cache distribuído que fornece os endereços dos injetores disponíveis no momento.
ru: Вашему клиенту не нужно заранее знать их интернет-адреса; вместо этого он выполняет поиск в **узле инъекторов** (еще один термин из P2P-файлообмена), однозаходном распределенном индексе, похожем на индекс распределенного кэша, который выдает адреса доступных в данный момент инъекторов.
tr: İstemciniz, içerik ekleyicilerin adreslerini önceden bilmek zorunda değildir. Bunun yerine, var olan içerik ekleyicilerin adreslerinin bulunduğu dağıtılmış bir dizin olan **içerik ekleyici havuzuna** (P2P dosya paylaşımından bir başka terim) bir sorgulama yapar.
uk: Вашому клієнту не потрібно заздалегідь знати їхню інтернет-адресу; натомість клієнт виконує пошук у **рої ін'єкторів** (ще один термін з P2P-файлообміну), розподіленому індексі, схожому на індекс розподіленого кешу, що видає адреси доступних ін'єкторів.
ur: آپ کے کلائنٹ کو پہلے سے ان کے انٹرنیٹ پتے جاننے کی ضرورت نہیں ہے۔ اس کے بجائے، یہ **انجیکٹر بھیڑ** (P2P فائل شیئرنگ کی ایک اور اصطلاح) میں ایک تلاش کرتا ہے، تقسیم شدہ کیش انڈیکس کی طرح ایک واحد اندراج تقسیم شدہ انڈیکس جو فی الحال دستیاب انجیکٹرز کے پتے حاصل کرتا ہے۔

source: Finally, even if your client may not be able to reach any injector, some other clients may. When a client is able to reach an injector and believes itself to be reachable by other clients, it becomes a **bridge** client and adds its own Internet address to the **bridge swarm**, another single-entry distributed index.
ar: أخيرًا، حتى إذا لم يتمكن عميلك من الوصول إلى أي حاقن، فقد يقوم بعض العملاء الآخرين بذلك. عندما يكون العميل قادراً على الوصول إلى حاقن ويعتقد أنه يمكن الوصول إليه من قبل عملاء آخرين، فإنه يصبح عميلاً **جسراً** ويضاف عنوان الإنترنت الخاص به إلى **سرب الجسر**، وهو فهرس آخر موزع بمدخل واحد.
de: Auch wenn Ihr Client keinen Injektor erreichen kann, so können es doch einige andere Clients. Wenn ein Client in der Lage ist, einen Injektor zu erreichen und glaubt, dass er für andere Clients erreichbar ist, wird er zu einem **Bridge**-Client und fügt seine eigene Internetadresse dem **Bridge-Schwarm** hinzu, einem weiteren verteilten Index mit einem Eintrag.
es: Finalmente, aún si tu cliente no fuera capaz de alcanzar ningún inyector, algunos otros clientes podrían. Cuando un cliente es capaz de alcanzar un inyector y cree que es alcanzable por otros clientes, se transforma en un cliente **puente**, y agrega su propia dirección de Internet al **enjambre de puentes**, otro índice distribuido de entrada única.
fa: سرانجام، حتی اگر سرویس‌گیرنده‌ی شما شاید نتواند به هیچ injector دسترسی پیدا کند، برخی سرویس‌گیرنده‌های دیگر شاید به آن‌ها دست پیدا کنند. وقتی یک سرویس‌گیرنده قادر به دست‌یابی به یک injector است و خودش را در دسترس سایر سرویس‌گیرنده‌ها می‌پندارد، این یک سرویس‌گیرنده‌ی **پل** می‌شود و نشانی اینترنتی خودش را به **انبوه پل** می‌افزاید، که یک نمایه‌ی تک‌مدخلی توزیع‌شده‌ی دیگر است.
fr: Enfin, même si votre client n'est peut-être pas en mesure d'atteindre un injecteur, certains autres clients le peuvent. Lorsqu'un client est capable d'atteindre un injecteur et se croit joignable par d'autres clients, il devient un client **passerelle** et ajoute sa propre adresse Internet à la **passerelle-essaim**, un autre index distribué à entrée unique.
my: နောက်ဆုံး အချက်မှာ သင့်လက်ခံစက် အနေဖြင့် မည်သည့် ထိုးသွင်းစက် ကိုမျှ ချိတ်ဆက်ခြင်း မပြုနိုင်သည့်တိုင် အခြား လက်ခံစက်များ မှ ချိတ်ဆက်နိုင် လိမ့်မည်။ လက်ခံစက် တစ်ခုမှ ထိုးသွင်းစက်တစ်ခုကို ချိတ်ဆက် နိုင်သည်နှင့် အခြားလက်ခံစက်များသည် ထိုလက်ခံစက်ကို လက်လှမ်းမီသည်ဟု ကောက်ချက်ဆွဲနိုင်သည်။ ထိုသို့သော လက်ခံစက်ကို **ပေါင်းကူး** လက်ခံစက်ဟု ခေါ်ပြီး ၎င်း၏ လိပ်စာသည် **ပေါင်းကူးလက်ခံစက်စာရင်း** ထဲသို့ ရောက်သွားသည်။ ထိုစာရင်းသည်လည်း တစ်ကြိမ်လျှင် စာရင်းတစ်ခုအဖြစ် ဖြန့်ချီ ထားသော အညွှန်းပင်ဖြစ်သည်။
pt_br: Por fim, mesmo que seu cliente possa não ser capaz de alcançar qualquer injetor, alguns outros clientes podem. Quando um cliente é capaz de alcançar um injetor e acredita ser ele mesmo alcançável por outros clientes, ele se torna um cliente **ponte** e adiciona seu próprio endereço de Internet ao **swarm ponte**, outro índex distribuído de entrada única.
ru: Наконец, даже если ваш клиент не может связаться с инъектором, некоторые другие клиенты могут это сделать. Если клиент может связаться с инъектором и считает себя доступным для других клиентов, он становится клиентом **моста** и добавляет свой собственный интернет-адрес в **мост узла**, еще один распределенный индекс с одним входом.
tr: Son olarak, istemciniz hiçbir içerik ekleyiciye erişemese bile, başka istemciler erişebilir. Bir istemci, bir içerik ekleyiciye erişebildiğinde ve kendisine diğer istemciler tarafından erişilebildiği belirlendiğinde bir **köprü** istemcisi olur ve kendi internet adresini başka bir dağıtılmış dizin olan **köprü havuzuna** ekler.
uk: Нарешті, навіть якщо ваш клієнт не може зв'язатися з ін'єктором, деякі інші клієнти можуть це зробити. Якщо клієнт здатний зв'язатися з ін'єктором й ідентифікує себе як доступний для інших клієнтів, він стає **мостом** і додає свою власну інтернет-адресу в **рій мостів**. Це ще один розподілений індекс.
ur: آخر میں، یہاں تک کہ اگر آپ کا کلائنٹ کسی انجیکٹر تک نہیں پہنچ سکتا، تو کچھ دوسرے کلائنٹ ہو سکتے ہیں۔ جب ایک کلائنٹ کسی انجیکٹر تک پہنچنے کے قابل ہوتا ہے اور اپنے آپ کو دوسرے کلائنٹس کے ذریعے قابل رسائی سمجھتا ہے، تو یہ ایک **پل** کلائنٹ بن جاتا ہے اور اپنا انٹرنیٹ ایڈریس **پل بھیڑ** میں شامل کرتا ہے، ایک اور واحد اندراج تقسیم شدہ انڈیکس۔

source: So your client can look for such an address, connect to the bridge behind it and tell it to establish another connection to an injector on its behalf, creating a **tunnel** between your client and the injector. Then a connection can be established between them inside of the tunnel.
ar: لذلك يمكن لعميلك البحث عن عنوان مثل هذا، والاتصال بالجسر التابع له وإخباره بإنشاء اتصال آخر بحاقن نيابة عنه، وإنشاء **نفق** بين العميل والحاقن. حينها يمكن إنشاء اتصال بينهما داخل النفق.
de: Ihr Client kann also nach einer solchen Adresse suchen, sich mit der dahinter liegenden Bridge verbinden und diese anweisen, in seinem Namen eine weitere Verbindung zu einem Injektor herzustellen, wodurch ein **Tunnel** zwischen Ihrem Client und dem Injektor entsteht. Innerhalb des Tunnels kann dann eine Verbindung zwischen den beiden aufgebaut werden.
es: Por lo que tu cliente puede buscar tal dirección, conectar al puente tras ella, y decirle que establezca otra conexión a un inyector de su parte, creando un **túnel** entre tu cliente y el inyector. Luego, una conexión puede ser establecida entre ellos dentro del túnel.
fa: پس سرویس‌گیرنده‌ی شما می‌تواند به دنبال چنین نشانی‌ای بگردد، به پل پشت آن وصل شود و به آن بگوید که ارتباط دیگری را با یک injector به نیابت از آن برقرار سازد، و این‌چنین یک **تونل** بین سرویس‌گیرنده‌ی شما و injector ایجاد کند. سپس ارتباطی بین آن‌ها درون این تونل می‌تواند برقرار گردد.
fr: Ainsi, votre client peut rechercher une telle adresse, se connecter au pont derrière et lui dire d'établir une autre connexion à un injecteur en son nom, créant un **tunnel** entre votre client et l'injecteur. Ensuite, une connexion peut être établie entre eux à l'intérieur du tunnel.
my: သင့်လက်ခံစက် အနေဖြင့် ပေါင်းကူးလက်ခံစက်၏ လိပ်စာကိုရှာဖွေ ချိတ်ဆက်ကာ ထိုးသွင်းစက်ကို ချိတ်ဆက်ပေးရန် ညွှန်ကြားနိုင်သည်။ ထိုအခါ သင့်လက်ခံစက်နှင့် ထိုးသွင်းစက်အကြား **ချိတ်ဆက်လိုဏ်ခေါင်း** ပေါ်လာကာ ကွန်နက်ရှင် ချိတ်ဆက်နိုင်မည် ဖြစ်သည်။
pt_br: Assim, seu cliente pode procurar por tal endereço, conectar-se à ponte por trás e dizer a ela para estabelecer outra conexão com um injetor em seu nome, criando um **túnel** entre o seu cliente e o injetor. Uma conexão pode, então, ser estabelecida entre eles dentro do túnel.
ru: Таким образом, ваш клиент может найти такой адрес, подключиться к мосту за ним и сказать ему установить другое соединение с инъектором от его имени, создав **туннель** между вашим клиентом и его инъектором. Затем между ними может быть установлено соединение внутри туннеля.
tr: İstemciniz böyle bir adresi arayarak, arkasındaki köprüye bağlanabilir ve kendi adına bir içerik ekleyiciye başka bir bağlantı kurmasını söyleyebilir. Böylece istemcinizle içerik ekleyici arasında bir **geçit** oluşturur. Ardından bu geçit kullanılarak aralarında bir bağlantı kurulabilir.
uk: Таким чином, ваш клієнт може знайти таку адресу, підключитися до мосту і дати йому команду встановити з'єднання з ін'єктором від його імені, створивши тунель між вашим клієнтом і його ін'єктором. Потім між ними може бути встановлене з'єднання усередині тунелю.
ur: لہذا آپ کا کلائنٹ ایسا پتہ تلاش کرسکتا ہے، اس کے پیچھے والے پل سے جڑ سکتا ہے اور اسے کہہ سکتا ہے کہ وہ اپنی طرف سے انجیکٹر سے دوسرا کنکشن قائم کرے، جس سے آپ کے کلائنٹ اور انجیکٹر کے درمیان **سرنگ** بن جائے۔ پھر سرنگ کے اندر ان کے درمیان رابطہ قائم کیا جا سکتا ہے۔

source: Please note that since client-to-injector connections are encrypted, bridges are not able to see the information flowing between them.
ar: يرجى الملاحظة أنه نظراً لكون الاتصالات بين العميل والحاقن مشفرة، فإن الجسور غير قادرة على رؤية المعلومات المتدفقة بينهما عبرها.
de: Da die Verbindungen zwischen Client und Injektor verschlüsselt sind, können die Brücken die zwischen ihnen fließenden Informationen nicht einsehen.
es: Por favor ten en cuenta que ya que las conexiones cliente a inyector están cifradas, los puentes no son capaces de ver la información fluyendo entre ellos.
fa: لطفاً توجه کنید که چون ارتباطات سرویس‌گیرنده-با-injector رمزگذاری‌شده‌اند، پل‌ها قادر به مشاهده‌ی اطلاعات در جریان بین آن‌ها نیستند.
fr: Veuillez noter que les connexions client-injecteur étant cryptées, les ponts ne sont pas en mesure de voir les informations circulant entre eux.
my: လက်ခံစက်နှင့် ထိုးသွင်းစက် အကြားချိတ်ဆက်မှုမှာ ကုဒ်ဖြင့် ပြောင်းလဲထားသည့် အတွက် ပေါင်းကူးလက်ခံစက်များ အနေဖြင့် ၎င်းတို့အကြား သတင်းအချက်အလက်စီးဆင်းမှုကို မြင်တွေ့ရမည်မဟုတ်ပါ။
pt_br: Por favor, observe que devido às conexões entre cliente e injetor serem criptografadas, pontes não são capazes de ver a informação circulando entre eles.
ru: Обратите внимание, что поскольку соединения между клиентом и инъектором шифруются, мосты не могут видеть информацию, проходящую между ними.
tr: İstemciyle içerik ekleyici arasındaki bağlantılar şifrelendiğinden, köprülerin aradaki bilgi akışını göremeyeceğini unutmayın.
uk: Будь ласка, зверніть увагу, що оскільки з'єднання між клієнтом та ін'єктором шифруються, мости не можуть бачити інформацію, що проходить між ними.
ur: براہ کرم نوٹ کریں کہ چونکہ کلائنٹ سے انجیکٹر کنکشنز کو خفیہ کیا گیا ہے، اس لیے پل ان کے درمیان بہنے والی معلومات کو دیکھنے کے قابل نہیں ہیں۔

source: An injector can behave like a normal (though extra available) proxy server, and this is indeed what Ouinet clients (including Ceno Browser) do currently when trying to access content over a proxy. In this case, the injector will neither see the actual information flowing between your client and the origin server (unless it is a plain, unencrypted HTTP connection itself).
ar: يمكن أن يتصرف الحاقن كخادم وكيل عادي (لكن متاح أكثر)، وهذا بالفعل ما يفعله عملاء Ouinet (بما في ذلك متصفح Ceno) حاليًا عند محاولة الوصول إلى المحتوى عبر وكيل. في هذه الحالة، لن يرى الحاقن المعلومات المتدفقة بين العميل والخادم الأصلي (طالما لم يكن الاتصال ببروتوكول HTTP وغير مشفر).
ur: ایک انجیکٹر ایک عام (اگرچہ اضافی دستیاب ہے) پراکسی سرور کی طرح برتاؤ کر سکتا ہے، اور درحقیقت یہ وہی ہے جو Ouinet کلائنٹس (بشمول CENO براؤزر) فی الحال کسی پراکسی پر مواد تک رسائی حاصل کرنے کی کوشش کرتے ہیں۔ اس صورت میں، انجیکٹر نہ تو آپ کے کلائنٹ اور اصل سرور کے درمیان بہتی ہوئی اصل معلومات کو دیکھے گا (جب تک کہ یہ ایک سادہ، غیر خفیہ کردہ HTTP کنکشن نہ ہو)۔

source: But there exist other tools allowing you to reach proxies in stringent network interference conditions so, what is so special about Ouinet injectors?
ar: ولكن توجد أدوات أخرى تتيح لك الوصول إلى وكلاء في الظروف القاهرة للتلاعب بالشبكة والتضييق على استخدامها، فما الذي يميز حاقنات Ouinet؟
de: Aber es gibt auch andere Tools, mit denen Sie Proxys unter strengen Netzstörungsbedingungen erreichen können. Was ist also das Besondere an den Ouinet-Injektoren?
es: Pero existen otras herramientas que te permiten alcanzar proxys en condiciones severas de interferencia de red, entonces, ¿qué tienen de especial los inyectores Ouinet?
fa: اما ابزارهای دیگری وجود دارند که به شما اجازه می‌دهند تا به پروکسی‌ها در شرایط اختلال شدید شبکه دسترسی پیدا کنید، پس Ouinet injectors چه ویژگی خاصی دارند؟
fr: Mais il existe d'autres outils permettant d'atteindre des proxys dans des conditions d'interférence réseau strictes alors, quelle est la particularité des injecteurs Ouinet ?
my: သို့သော် အင်တာနက် နက်ဝေါ့ခ်များ ပိတ်ဆို့ခံရသည့် အခြေအနေများတွင် ပရောက်စီများသို့ ချိတ်ဆက်နိုင်သည့် အခြားနည်းလမ်းများလည်း ရှိသည်ဖြစ်ရာ Ouinet ထိုးသွင်းစက်များက ၎င်းတို့ထက် မည်သည့်နေရာများတွင် ပိုမိုသာလွန်သနည်း။
pt_br: Porém existem outras ferramentas permitindo que você alcance proxies em condições de severa interferência na rede. Então, o que é tão especial nos injetores da Ouinet?
ru: Но существуют ли другие инструменты, позволяющие достигать прокси в условиях жестких сетевых помех, так что же особенного в инъекторах Ouinet?
tr: Daha sıkı ağ engelleme koşullarında vekil sunuculara erişmeyi sağlayan başka araçlar zaten var. Ouinet içerik ekleyicilerini bu kadar özel kılan şey nedir?
uk: Хоча існують інші інструменти, що дозволяють отримати доступ до проксі-серверів в умовах жорсткого мережевого втручання. Що ж такого особливого в ін'єкторах Ouinet?
ur: لیکن ایسے دوسرے ٹولز موجود ہیں جو آپ کو سخت نیٹ ورک مداخلت کے حالات میں پراکسی تک پہنچنے کی اجازت دیتے ہیں تو، Ouinet انجیکٹر کے بارے میں کیا خاص بات ہے؟

source: Trusting shared content
ar: الثقة في المحتوى الذي تمت مشاركته
de: Vertrauen in gemeinsame Inhalte
es: Confiando en el contenido compartido
fa: اعتماد به محتوای اشتراکی
fr: Faire confiance au contenu partagé
my: မျှဝေထားသည့် အကြောင်းအရာများ၏ ယုံကြည်စိတ်ချရမှု
pt_br: Confiando no conteúdo compartilhado
ru: Доверие к общему контенту
tr: Paylaşılan içeriğe güvenilmesi
uk: Довіра до спільного контенту
ur: مشترکہ مواد پر بھروسہ کرنا

source: Well, the point is that an injector does not just retrieve content on behalf of your client, it also allows you to *share that content with others at a later time, even when there is no longer access to the injector or most of the Internet*.
ar: حسنًا، النقطة المهمة هي أن الحاقن لا يسترد المحتوى نيابة عن عميلك فحسب، بل يسمح لك أيضًا بـ *مشاركة هذا المحتوى مع الآخرين في وقت لاحق، حتى عندما لا يكون هناك وصول إلى الحاقن أو إلى معظم الإنترنت*.
de: Nun, der Punkt ist, dass ein Injektor nicht nur Inhalte im Namen Ihres Kunden abruft, sondern es Ihnen auch ermöglicht, *diese Inhalte zu einem späteren Zeitpunkt mit anderen zu teilen, selbst wenn kein Zugang mehr zum Injektor oder zum größten Teil des Internets besteht*.
es: Bien, el punto es que un inyector no solo descarga contenido de parte de tu cliente, también te permite *compartir ese contenido con otros con posterioridad, aún cuando no haya más acceso al inyector o a la mayoría de Internet*.
fa: خب، نکته این است که یک injector تنها محتوا را از طرف سرویس‌گیرنده‌ی شما بازیابی نمی‌کند، بلکه همچنین به شما امکان می‌دهد تا *آن محتوا را بعداً با دیگران نیز به اشتراک بگذارید، حتی وقتی که دیگر دسترسی به آن injector یا بیشتر بخش‌های اینترنت وجود نداشته نباشد*.
fr: Eh bien, le fait est qu'un injecteur ne se contente pas de récupérer du contenu pour le compte de votre client, il vous permet également de * partager ce contenu avec d'autres ultérieurement, même lorsqu'il n'y a plus d'accès à l'injecteur ou à la majeure partie d'Internet. *.
my: ထိုးသွင်းစက်၏ အဓိကအားသာချက်မှာ သင့်လက်ခံစက် အစား အကြောင်းအရာကို ရှာဖွေချိတ်ဆက်ပေးရုံသာမက ထိုအကြောင်းအရာ များကို ထိုးသွင်းစက် (သို့မဟုတ်) အင်တာနက်နှင့် ချိတ်ဆက်မထားချိန်တွင်ပင် အခြားသူများလိုအပ်လာလျှင် မျှဝေပေးရန် ခွင့်ပြုခြင်းပင်ဖြစ်သည်။
pt_br: Bem, o ponto é que um injetor não apenas recupera conteúdo em nome do seu cliente, ele também permite a você *compartilhar aquele conteúdo com outros posteriormente, mesmo quando não há mais acesso ao injetor ou à maior parte da Internet*.
ru: Дело в том, что инъектор не просто получает контент от имени вашего клиента, он также позволяет вам *делиться этим контентом с другими в более позднее время, даже когда доступа к инъектору или большей части Интернета больше нет*.
tr: Önemli olan nokta şudur. Bir içerik ekleyici yalnızca istemciniz adına içerik almakla kalmaz. İçerik ekleyiciye veya internetin çoğuna artık erişilemese bile o içeriği daha sonra başkalarıyla paylaşmanızı sağlar.
uk: Справа в тому, що ін'єктор не просто отримує контент від імені вашого клієнта, він також дозволяє вам ділитися цим контентом з іншими й надалі, коли доступ до ін'єктора або більшої частини інтернету вже закритий.
ur: ٹھیک ہے، بات یہ ہے کہ انجیکٹر صرف آپ کے کلائنٹ کی جانب سے مواد کو بازیافت نہیں کرتا ہے، یہ آپ کو *اس مواد کو بعد میں دوسروں کے ساتھ بھی شیئر کرنے کی اجازت دیتا ہے، یہاں تک کہ جب انجیکٹر یا زیادہ تر انٹرنیٹ تک رسائی نہ ہو*.
