Repository: censorship-no/ceno-docs
Catalog: user-manual/*/concepts/how.po
Languages: ar, de, es, fa, fr, my, pt_br, ru, tr, uk, ur

source: Clients offering some particular content over the distributed cache are said to be **seeding** it or to be their *seeders* (these terms come from the P2P file-sharing world). Going back to our example scenario, there are two clients seeding some content. Unfortunately, one is seeding content *Y* and the other one content *Z*, so your client would find no entries for content *X* in the distributed cache index, as depicted below:
ar: يسمى العملاء الذين يقدمون محتوى معين عبر ذاكرة التخزين المؤقت الموزعة **موزعين** أو أنهم *يوزعون* (تأتي هذه المصطلحات من عالم مشاركة الملفات عبر تقنية نظير لنظير). لنعد إلى سيناريو مثالنا، هناك عميلان يوزعان محتوى ما. لسوء الحظ، أحدهما يبث المحتوى *Y* والآخر المحتوى *Z*، لذلك لن يجد العميل أي إدخالات للمحتوى *X* في فهرس ذاكرة التخزين المؤقت الموزعة، كما هو موضح أدناه:
de: Clients, die bestimmte Inhalte über den verteilten Zwischenspeicher anbieten, werden als **seeding** oder *seeders* bezeichnet (diese Begriffe stammen aus der Welt des P2P-Filesharing). Um auf unser Beispielszenario zurückzukommen: Es gibt zwei Clients, die bestimmte Inhalte anbieten. Leider verbreitet der eine den Inhalt *Y* und der andere den Inhalt *Z*, so dass Ihr Client keine Einträge für den Inhalt *X* im verteilten Cache-Index finden würde, wie unten dargestellt:
es: De los clientes que ofrecen algún contenido en particular sobre la caché distribuida se dice que están **sembrándolo**, o que son sus *sembradores* (estos términos vienen del mundo de la compartición de archivos P2P). Volviendo a nuestro escenario de ejemplo, hay dos clientes sembrando algún contenido. Desafortunadamente, uno está sembrando el contenido *Y* y el otro el contenido *Z*, por lo que tu cliente no encontraría entradas para el contenido *X* en el índice de la caché distribuida, como se ilustra abajo:
fa: سرویس‌گیرنده‌هایی که محتوای خاصی را روی کش توزیع‌شده پیشنهاد می‌دهند به‌اصطلاح آن را **دانه‌پاشی** می‌کنند یا **دانه‌پاش‌ها**ی آن‌ها هستند (این اصطلاح‌ها از دنیای اشتراک فایل همتا-به-همتا گرفته شده‌اند). اگر بخواهیم به سناریوی مثال‌مان بازگردیم، دو سرویس‌گیرنده هستند که محتوایی را دانه‌پاشی می‌کنند. متأسفانه، یکی از آن‌ها محتوای *Y* را و دیگری محتوای *Z* را دانه‌پاشی می‌کنند، بنابراین سرویس‌گیرنده‌ی شما هیچ مدخلی برای محتوای *X* در نمایه‌ی کش توزیع‌شده نخواهد یافت، همان‌طور که در پایین به تصویر کشیده شده است:
fr: Les clients offrant un contenu particulier sur le cache distribué sont censés le **semer** ou être leurs *seeders* (ces termes proviennent du monde du partage de fichiers P2P). Pour en revenir à notre exemple de scénario, deux clients ensemencent du contenu. Malheureusement, l'un ensemence le contenu *Y* et l'autre le contenu *Z*, de sorte que votre client ne trouvera aucune entrée pour le contenu *X* dans l'index de cache distribué, comme illustré ci-dessous :
my: ဖြန့်ချိထားသော ယာယီမှတ်ဉာဏ် မှတဆင့် ဝက်ဘ် အကြောင်းအရာတစ်ခုကို ထိန်းသိမ်းပေးသည့် လက်ခံစက်များကို **seeding လုပ်ခြင်း** (သို့မဟုတ်) *seeders* ဟုခေါ်သည်။ (ထိုအခေါ်အဝေါ်များသည် P2P ဖိုင်မျှဝေခြင်းမှ ဆင်းသက်လာသည်။) အထက်တွင် ဖော်ပြခဲ့သည့် ဥပမာကို ပြန်ကြည့်လျှင် အကြောင်းအရာအချို့ကို ထိန်းသိမ်းပေးသည့် လက်ခံစက်နှစ်ခု ရှိနေသည်။ ကံမကောင်းစွာဖြင့် ထိန်သိမ်းထားသည့် အကြောင်း အရာတစ်ခုမှာ "Y" ဖြစ်နေပြီး အခြားတစ်ခုမှာ"Z" ဖြစ်နေသည်။ ထို့ကြောင့် သင့်လက်ခံစက်မှ ရှာဖွေနေသော အကြောင်းအရာ "X" ကို ဖြန့်ချိထားသော ယာယီမှတ်ဉာဏ်တွင် ရှာဖွေမရနိုင်သည်ကို ဤသို့တွေ့ရမည်။
pt_br: Diz-se que os clientes oferecendo algum conteúdo específico sobre o cache distribuído o estão **semeando**, ou que são *semeadores* dele (esses termos advém do universo de compartilhamento P2P de arquivos). Retornando ao nosso cenário de exemplo, há dois clientes semeando algum conteúdo. Infelizmente, um está semeando o conteúdo *Y* e outro o conteúdo *Z*, de forma que o seu cliente não encontraria entradas para o conteúdo *X* no índex do cache distribuído, como ilustrado abaixo:
ru: Клиенты, предлагающие определенный контент через распределенный кэш, называются **раздающими** его или *получателями* (эти термины пришли из мира P2P-файлообмена). Возвращаясь к нашему примеру, можно сказать, что есть два клиента, передающие некоторый контент. К сожалению, один из них выкладывает контент *Y*, а другой - контент *Z*, поэтому ваш клиент не найдет записей для контента *X* в индексе распределенного кэша, как показано ниже:
tr: Dağıtılmış ön bellek üzerinden belirli bir içerik sunan istemcilerin **gönderiyor** ya da *gönderici* olduğu söylenir (bu terimler eşler arası dosya paylaşım dünyasından gelir). Örnek senaryomuza geri dönersek, bazı içerikleri gönderen iki istemci var. Ne yazık ki, biri *Y* içeriğini, diğeri ise *Z* içeriğini gönderiyor. Bu yüzden istemciniz aşağıda gösterildiği gibi dağıtılmış ön bellek dizininde *X* içeriği için herhangi bir kayıt bulamaz:
uk: Клієнти, що пропонують певний контент через розподілений кеш, називаються **роздавальними** контент або *сідами* (ці терміни прийшли зі світу P2P-файлообміну). Повертаючись до нашого прикладу, можна сказати, що є два клієнти, які роздають певний контент. На жаль, один із них викладає контент *Y*, а інший — контент *Z*, тому ваш клієнт не знайде записів для контенту *X* в індексі розподіленого кешу, як показано нижче:
ur: تقسیم شدہ کیش پر کچھ خاص مواد پیش کرنے والے کلائنٹس کے بارے میں کہا جاتا ہے کہ وہ **سیڈنگ** ہیں یا ان کے *سیڈرز* ہیں (یہ اصطلاحات P2P فائل شیئرنگ کی دنیا سے آتی ہیں)۔ ہمارے مثال کے منظر نامے پر واپس جائیں تو، وہاں دو کلائنٹ ہیں جو کچھ مواد سیڈ کر رہے ہیں۔ بدقسمتی سے، ایک مواد *Y* اور دوسرا مواد *Z* سیڈ کر رہا ہے، لہذا آپ کے مؤکل کو تقسیم شدہ کیش انڈیکس میں مواد *X* کے لیے کوئی اندراج نہیں ملے گا، جیسا کہ ذیل میں دکھایا گیا ہے:

source: ![Figure: Content not found in the distributed cache](images/user-flow-1.svg)
ar: ![الشكل: المحتوى غير موجود في ذاكرة التخزين المؤقت الموزعة](images/user-flow-1.svg)
de: ![Abbildung: Inhalt im verteilten Cache nicht gefunden](images/user-flow-1.svg)
es: ![Figura: Contenido no encontrado en la caché distribuida](images/user-flow-1.svg)
fa: ![شکل: محتوا در کش توزیع‌شده پیدا نشد](images/user-flow-1.svg)
fr: ![Figure : Contenu introuvable dans le cache distribué](images/user-flow-1.svg)
my: ![Figure: ဖြန့်ချီထားသောယာယီမှတ်ဉာဏ်အတွင်း သင်ရှာဖွေသော အကြောင်းအရာ မရှိပါ](images/user-flow-1.svg)
pt_br: ![Figura: Conteúdo não encontrado no cache distribuído](images/user-flow-1.svg)
ru: ![Рисунок: Контент не найден в распределенном кэше](images/user-flow-1.svg)
tr: ![Görsel: İçerik dağıtılmış ön bellekte bulunamıyor](images/user-flow-1.svg)
uk: ![Малюнок: Контент не знайдений у розподіленому кеші](images/user-flow-1.svg)
ur: ![تصویر: تقسیم شدہ کیش میں مواد نہیں ملا](images/user-flow-1.svg)

source: Fortunately, Ouinet offers a way to retrieve such content and furthermore make it available to other clients in the distributed cache. Please read on to learn how.
ar: لحسن الحظ، يوفر Ouinet طريقة لاسترداد هذا المحتوى علاوة على إتاحته للعملاء الآخرين في ذاكرة التخزين المؤقت الموزعة. من فضلك تابع القراءة لتتعلم كيف يتم ذلك.
de: Glücklicherweise bietet Ouinet eine Möglichkeit, solche Inhalte abzurufen und sie darüber hinaus im verteilten Cache für andere Clients verfügbar zu machen. Lesen Sie bitte weiter, um zu erfahren, wie.
es: Afortunadamente, Ouinet ofrece una manera de descargar tal contenido, y aún más, hacerlo disponible a otros clientes en la caché distribuida. Por favor, sigue leyendo para aprender cómo..
fa: خوشبختانه، Ouinet راهی برای بازیابی محتوایی ازاین‌دست پیش کشیده است و افزون‌ براین آن را در دسترس سرویس‌گیرندگان دیگر در کش توزیع‌شده نیز قرار می‌دهد. لطفاً به خواندن ادامه دهید تا بفهمید چگونه.
fr: Heureusement, Ouinet offre un moyen de récupérer ce contenu et de le rendre disponible à d'autres clients dans le cache distribué. Veuillez lire la suite pour savoir comment.
my: Ouinet တွင်ထိုသို့ရှာဖွေမရသည့် အကြောင်းအရာများကို ရှာဖွေနိုင်ရန် နှင့် အခြားလက်ခံစက်များမှ ယင်းအကြောင်းအရာများကို ဖြန့်ချိထားသော ယာယီမှတ်ဉာဏ်တွင် ရှာဖွေနိုင်သည့် နည်းလမ်းကို ထည့်သွင်းထားသည်။
pt_br: Felizmente, a Ouinet oferece uma maneira de recuperar tal conteúdo e posteriormente o disponibiliza para outros clientes no cache distribuído. Por favor, continue lendo para aprender como.
ru: К счастью, Ouinet предлагает способ получить такой контент и, более того, сделать его доступным для других клиентов в распределенном кэше. Пожалуйста, ознакомьтесь с инструкцией.
tr: Neyse ki Ouinet, bu tür içeriği almak ve dağıtılmış ön bellekteki diğer istemcilerin kullanımına sunmak için bir yol sunuyor. Nasıl yapılacağını öğrenmek için okumayı sürdürün.
uk: На щастя, Ouinet пропонує спосіб отримати такий контент і, більш того, зробити його доступним для інших клієнтів у розподіленому кеші. Будь ласка, ознайомтесь із інструкцією.
ur: خوش قسمتی سے، Ouinet اس طرح کے مواد کو بازیافت کرنے کا ایک طریقہ پیش کرتا ہے اور اس کے علاوہ اسے تقسیم شدہ کیش میں دوسرے کلائنٹس کے لیے بھی دستیاب کرتا ہے۔ یہ جاننے کے لیے براہ کرم پڑھیں.

source: Sharing new content
ar: مشاركة محتوى جديد
de: Neue Inhalte teilen
es: Compartiendo contenido nuevo
fa: اشتراکِ محتوای جدید
fr: Partage de nouveau contenu
my: အကြောင်းအရာသစ်များကို မျှဝေခြင်း
pt_br: Compartilhando conteúdo novo
ru: Обмен новым контентом
tr: Yeni içeriğin paylaşılması
uk: Обмін новим контентом
ur: نئے مواد کا اشتراک کرنا

source: Proxies on steroids
ar: وكلاء تحت تأثير المنشطات
de: Proxys auf Steroiden
es: Proxys en esteroides
fa: پروکسی‌های تقویت‌شده
fr: Proxies sous stéroïdes
my: ထူးကဲစွမ်းရည်ရှိသည့် ပရောက်စီများ
pt_br: Proxies em esteroides
ru: Прокси на стероидах
tr: Hormonlu vekil sunucular
uk: Проксі на стероїдах
ur: سٹیرائڈز پر پراکسی

source: In Ouinet, there are special kinds of proxy servers called **injectors** which sit in the (hopefully) free side of the Internet and try very hard to stay reachable despite blocking measures:
ar: في Ouinet، توجد أنواع خاصة من الخوادم الوكيلة تسمى **الحاقنات** والتي توجد في الجانب الحرّ من الإنترنت (نأمل ذلك) وتحاول جاهدة أن تظل قابلة لقبول الطلبات على الرغم من محاولات حجبها وحظرها:
de: In Ouinet gibt es spezielle Arten von Proxy-Servern, die **Injektoren** genannt werden, die auf der (hoffentlich) freien Seite des Internets sitzen und sich sehr bemühen, trotz Sperrmaßnahmen erreichbar zu bleiben:
es: En Ouinet, hay clases especiales de servidores proxy, llamados **inyectores**, que están (ojalá) en el lado libre de Internet, e intentan con todas sus fuerzas permanecer alcanzables a pesar de las medidas de bloqueo:
fa: درOuinet، انواع خاصی از سرورهای پروکسی به نام **injectors** وجود دارند که در بخش آزاد اینترنت قرار گرفته‌اند (دست‌کم امیدواریم چنین باشد) و سرسختانه می‌کوشند تا به‌رغم اقدامات مسدودگرانه در دسترس همگان باقی بمانند:
fr: Dans Ouinet, il existe des types spéciaux de serveurs proxy appelés ** injecteurs ** qui se trouvent du côté (espérons-le) libre d'Internet et s'efforcent de rester joignables malgré les mesures de blocage :
my: Ouinet တွင် အထူးပရောက်စီ အမျိုးအစားများ ဖြစ်သည့် **ထိုးသွင်းစက်များ** ပါဝင်သည်။ ၎င်းတို့ကို အင်တာနက်၏ လွတ်လပ်သော အခြမ်းတွင် အထိုင်ချထားသည့် အတွက် ပိတ်ဆို့မှုနည်းလမ်းများသုံးသည့်တိုင် အသုံးပြုသူများမှ ၎င်းတို့ကို လက်လှမ်းမီစေမည် ဖြစ်သည်။
pt_br: Na Ouinet, existem alguns tipos especiais de servidores proxy chamados **injetores**, os quais ocupam (espera-se) a parte livre da Internet e tentam fortemente continuar alcançáveis apesar de medidas de bloqueio:
ru: В Ouinet существуют специальные виды прокси-серверов, называемые **инъекторами**, которые находятся в (надеюсь) свободной части Интернета и очень стараются оставаться доступными, несмотря на меры блокировки:
tr: Ouinet üzerinde, **içerik ekleyici** adında internetin (büyük olasılıkla) özgür tarafında duran ve yasaklamalar sırasında bile erişilebilir olmaya çalışan özel vekil sunucuları vardır:
uk: В Ouinet існують спеціальні види проксі-серверів, які називаються **ін'єкторами**, що перебувають (будемо сподіватися) у вільній частині інтернету і намагаються залишатися доступними, незважаючи на блокування:
ur: Ouinet میں، خاص قسم کے پراکسی سرورز ہیں جنہیں **انجیکٹر** کہا جاتا ہے جو انٹرنیٹ کے (امید ہے کہ) فری سائیڈ میں بیٹھتے ہیں اور روکنے کے اقدامات کے باوجود قابل رسائی رہنے کی بہت کوشش کرتے ہیں:

source: First of all, connections between clients and injectors are encrypted (using standard SSL/TLS like in HTTPS) to avoid attackers from identifying injectors by eavesdropping on web traffic.
ar: في البداية، يتم تشفير الاتصالات بين العملاء والحاقنات (باستخدام SSL/TLS المعتاد كما هو الحال في HTTPS) لتجنب تحديد الحاقنات من طرف المهاجمين عن طريق التنصت على حركة مرور الويب.
de: Zunächst einmal werden die Verbindungen zwischen den Clients und den Injektoren verschlüsselt (unter Verwendung des Standard-SSL/TLS wie bei HTTPS), um zu verhindern, dass Angreifer die Injektoren durch Abhören des Webverkehrs identifizieren können.
es: En primer lugar, las conexiones entre clientes e inyectores están cifradas (usando SSL/TLS estándar, como en HTTPS) para evitar que los atacantes identifiquen a los inyectores espiando el tráfico web.
fa: پیش از هرچیز، ارتباطات بین سرویس‌گیرنده‌ها و injectors* رمزنگاری شده‌اند (با استفاده از SSL/TLS استاندارد مانند HTTPS) تا مانع شناسایی injectors توسط مهاجمان به‌وسیله‌ی شنود ترافیک وب شوند.
fr: Tout d'abord, les connexions entre les clients et les injecteurs sont cryptées (à l'aide du standard SSL/TLS comme dans HTTPS) pour éviter que les attaquants n'identifient les injecteurs en écoutant le trafic Web.
my: ဝက်ဘ်လမ်းကြောင်း အတွင်း ထိုးသွင်းစက်များကို ရှာဖွေတိုက်ခိုက်မှုများကို ရှောင်လွှဲနိုင်ရန် လက်ခံစက်နှင့် ထိုးသွင်းစက်များ အကြားရှိ ချိတ်ဆက်မှုများအားလုံးကို (HTTPS ရှိ SSL/TLS များကိုသုံးပြီး) ကုဒ်ဖြင့် ပြောင်းလဲထားသည်။
pt_br: Em primeiro lugar, as conexões entre clientes e injetores são criptografadas (usando padrões SSL/TLS como no HTTPS) para evitar que atacantes identifiquem injetores ao espionarem o tráfego web.
ru: Во-первых, соединения между клиентами и инъекторами шифруются (с использованием стандартного SSL/TLS, как в HTTPS), чтобы злоумышленники не смогли идентифицировать инъекторов путем прослушки веб-трафика.
tr: Öncelikle saldırganların internet trafiğini izleyerek içerik ekleyicileri belirlemesinden kaçınmak için istemciler ve içerik ekleyiciler arasındaki bağlantılar (HTTPS üzerindeki gibi SSL/TLS kullanılarak) şifrelenir.
uk: По-перше, з'єднання між клієнтами та ін'єкторами шифруються (з використанням стандартного SSL/TLS, як у HTTPS), щоб зловмисники не змогли ідентифікувати ін'єктори шляхом прослуховування веб-трафіку.
ur: سب سے پہلے، کلائنٹس اور انجیکٹرز کے درمیان روابط کو خفیہ کیا جاتا ہے (معیاری SSL/TLS کا استعمال کرتے ہوئے جیسے HTTPS میں) تاکہ حملہ آوروں کو ویب ٹریفک پر چھپ کر انجیکٹر کی شناخت کرنے سے بچایا جا سکے۔

source: By the way, injector certificates are shipped in Ceno Browser, allowing it to detect attackers trying to impersonate injectors.
ar: بالمناسبة، يتم شحن شهادات الحاقنات في متصفح Ceno، مما يسمح له باكتشاف المهاجمين الذين يحاولون انتحال شخصية الحاقنات.
ur: ویسے، انجیکٹر سرٹیفکیٹ CENO براؤزر میں بھیجے جاتے ہیں، جس سے یہ حملہ آوروں کا پتہ لگانے کی اجازت دیتا ہے جو انجیکٹر کی نقالی کرنے کی کوشش کر رہے ہیں۔

source: If encryption was not sufficient, connections to injectors can use special obfuscation techniques (like I2P and Tor's Pluggable Transports) to make identification even more difficult.
ar: إذا لم يكن التشفير كافياً، يمكن أن تستخدم الاتصالات للحاقنات تقنيات تعمية خاصة (مثل I2P و وسائل النقل القابلة للتوصيل لتور) لجعل التعرف عليها (بهدف ترشيحها) أكثر صعوبة.
de: Wenn die Verschlüsselung nicht ausreicht, können Verbindungen zu Injektoren spezielle Verschleierungstechniken verwenden (wie I2P und Tor's Pluggable Transports), um die Identifizierung noch schwieriger zu machen.
es: Si el cifrado no fuera suficiente, las conexiones a inyectores pueden usar técnicas especiales de ofuscación (como I2P y los Transportes Conectables de Tor), para hacer a la identificación aún más dificultosa.
fa: اگر رمزنگاری کافی نبود، برای ارتباطات با injectors می‌توانند از تکنیک‌های مبهم‌سازی ویژه استفاده کنند (مثل I2P و PTها یا ترابری‌های سرپوش‌دار Tor) تا شناسایی را از آن هم دشوارتر کنند.
fr: Si le cryptage n'était pas suffisant, les connexions aux injecteurs peuvent utiliser des techniques d'obscurcissement spéciales (comme I2P et les transports enfichables de Tor) pour rendre l'identification encore plus difficile.
my: ကုဒ်ဖြင့် ပြောင်းလဲခြင်း တစ်ခုတည်းနှင့် မလုံလောက်ပါက (I2P နှင့် Tor's Pluggable Transports ကဲ့သို့) ချိတ်ဆက်မှုများကို ရှုပ်ထွေးအောင်လုပ်ပြီး ထိုးသွင်းစက်များကို ရှာရခက်စေသည့် နည်းလမ်းများကို အသုံးပြုနိုင် ပါသည်။
pt_br: Se a criptografia não foi o suficiente, as conexões com os injetores podem usar técnicas especiais de ofuscamento (como I2P e os Transportes Plugáveis do Tor) para tornar a identificação ainda mais difícil.
ru: Если шифрования недостаточно, соединения с инъекторами могут использовать специальные методы обфускации (например, I2P и подключаемые транспорты Tor), чтобы еще больше затруднить идентификацию.
tr: Şifreleme yeterli değilse, içerik ekleyicilerine yapılan bağlantılar tanımlanmalarını daha da zorlaştırmak için özel gizleme (I2P ya da Tor Değiştirilebilir Taşıyıcıları gibi) yöntemleri kullanır.
uk: Якщо шифрування недостатньо, з'єднання з ін'єкторами можуть використовувати спеціальні методи обфускації (наприклад, I2P і підключені транспорти Tor) для ускладнення ідентифікації.
ur: اگر خفیہ کاری کافی نہیں تھی تو، انجیکٹروں کے کنکشن شناخت کو مزید مشکل بنانے کے لیے خصوصی مبہم تکنیک (جیسے I2P اور Tor's Pluggable Transports) استعمال کر سکتے ہیں۔

source: Even if an injector was identified and access to it was blocked by your ISP, there are several of them and it does not matter which one your client contacts over the Internet.
ar: حتى إذا تم التعرف على حاقن ما وحظر مزفر خدمة الإنترنت الخاص بك الوصول إليه، فهناك العديد من الحاقنات على الشبكة، ولا يهم بأي منها يتصل عميلك عبر الإنترنت.
de: Selbst wenn ein Injektor identifiziert und der Zugang zu ihm von Ihrem Internetanbieter blockiert wurde, gibt es mehrere von ihnen, und es spielt keine Rolle, welchen Ihr Kunde über das Internet kontaktiert.
es: Aún si un inyector fuera identificado y el acceso a él fuera bloqueado por tu ISP, hay varios de ellos, y no importa a cuál contacta tu cliente sobre Internet.
fa: حتی اگر شرکت ارائه‌دهنده‌ی خدمات اینترنت شما یک injector را شناسایی کرد و دسترسی به آن را مسدود کرد، تعداد زیادی از آن‌ها وجود دارد و اهمیتی ندارد که سرویس‌گیرنده‌ی شما با کدام یک از آن‌ها روی اینترنت ارتباط برقرار می‌کند.
fr: Même si un injecteur a été identifié et que l'accès à celui-ci a été bloqué par votre FAI, il en existe plusieurs et peu importe celui que votre client contacte par Internet.
my: သင့် ISP (အင်တာနက် ဝန်ဆောင်မှု ပေးသူ) မှ ထိုးသွင်းစက်တစ်ခုကို ရှာဖွေတွေ့ပြီး ထိုထိုးသွင်းစက်နှင့်ချိတ်ဆက်မှုကို ပိတ်ဆို့မှုလုပ်ခံရသည့်တိုင် စိတ်ပူစရာမလိုပါ။ အခြားသင်ချိတ်ဆက်နိုင်သည့် ထိုးသွင်းစက်များစွာရှိနေပြီး လက်ခံစက်နှင့် မည်သည့် ထိုးသွင်းစက် ချိတ်ဆက်မည်ဆိုသည်ကို ဂရုပြုစရာမလိုပါ။
pt_br: Ainda que um injetor tenha sido identificado e tido seu acesso bloqueado por seu ISP, há diversos deles e não importa qual o seu cliente contate pela Internet.
ru: Даже если инъектор был идентифицирован и доступ к нему был заблокирован вашим провайдером, их существует несколько, и не имеет значения, с каким из них ваш клиент связывается через Интернет.
tr: Bir içerik ekleyici tanımlanmış ve erişimi internet hizmeti sağlayıcınız tarafından engellenmiş olsa bile, birden fazla farklı içerik ekleyici vardır ve istemcinizin hangisiyle iletişim kurduğu önemli değildir.
uk: Навіть якщо ін'єктор був ідентифікований і доступ до нього заблокував ваш провайдер, працюють кілька ін'єкторів, і не має значення, з яким саме ваш клієнт зв'язується через інтернет.
ur: یہاں تک کہ اگر ایک انجیکٹر کی شناخت کی گئی تھی اور آپ کے ISP کے ذریعہ اس تک رسائی کو مسدود کردیا گیا تھا، ان میں سے کئی ہیں اور اس سے کوئی فرق نہیں پڑتا ہے کہ آپ کا کلائنٹ انٹرنیٹ پر کس سے رابطہ کرتا ہے۔

source: Some or all injectors may be blocked, but then the set of injectors can vary over time (with new ones being added).
ar: قد يتم حظر بعض أو كل الحاقنات، ولكن يمكن أن تتغير مجموعة الحاقنات مع مرور الوقت (مع إضافة حاقنات جديدة).
de: Einige oder alle Injektoren können blockiert sein, aber dann kann der Satz von Injektoren im Laufe der Zeit variieren (wobei neue hinzugefügt werden).
es: Algunos o todos los inyectores podrían ser bloqueados, pero el conjunto de inyectores puede variar a través del tiempo (añadiéndose nuevos).
fa: ممکن است بعضی یا تمام injectors مسدود شوند، اما در آن صورت مجموعه‌ی injectors می‌توانند در گذر زمان تغییر کنند (و injectors جدیدی به آن‌ها افزوده شوند).
fr: Certains ou tous les injecteurs peuvent être bloqués, mais le jeu d'injecteurs peut alors varier dans le temps (avec l'ajout de nouveaux).
my: ထိုးသွင်းစက် အချို့ (သို့မဟုတ်) အားလုံးသည် ပိတ်ဆို့ခြင်း ခံနိုင်သော်လည်း အားလုံး တချိန်တည်း ပိတ်ဆို့ခံရခြင်းထက် အလှည့်ကျ ပိတ်ခံခြင်းသာ ဖြစ်နိုင်ပါသည် (တပြိုင်နက်တည်းပင် ထိုးသွင်းစက် အသစ် တွေလည်း ထပ်ရှိလာပါမည်)။
pt_br: Alguns ou todos os injetores podem ser bloqueados mas, nesse caso, o conjunto de injetores pode variar ao longo do tempo (com adição de novos).
ru: Некоторые или все инъекторы могут быть заблокированы, но тогда группа инъекторов может меняться с течением времени (с добавлением новых).
tr: İçerik ekleyicilerinin bazıları veya tümü engellenmiş olabilir ancak bu içerik ekleyiciler listesi zamanla değişebilir (yenileri eklenir).
uk: Деякі, або навіть усі ін'єктори можуть бути заблоковані, але тоді група ін'єкторів може змінюватися з часом (з додаванням нових).
ur: کچھ یا تمام انجیکٹرز کو بلاک کیا جا سکتا ہے، لیکن پھر انجیکٹرز کا سیٹ وقت کے ساتھ مختلف ہو سکتا ہے (نئے انجیکٹرز شامل کیے جانے کے ساتھ)۔
