Repository: censorship-no/ceno-docs
Catalog: user-manual/*/concepts/how.po
Languages: ar, de, es, fa, fr, my, pt_br, ru, tr, uk, ur

source: We want CENO and Ouinet usage to scale and provide as much content to as many people as possible, so we do want you to be able to receive content from people you do not know. To enable you to accept such content, Ouinet uses **content signing**: your client is configured to trust content that is signed using a special key owned by injectors. Whenever a client tells an injector to retrieve some Web content for sharing, the injector gets it from the origin server, uses the key to sign it, and returns the signed content to the client.
es: Queremos que el uso de CENO y Ouinet se expanda y provea tanto contenido para tantas personas como sea posible, por lo que queremos que seas capaz de recibir contenido de personas que no conoces. Para lograr que aceptes tal contenido, Ouinet usa la **firma de contenido**: tu cliente está configurado para confiar en el contenido que está firmado usando una clave especial propia de los inyectores. En cualquier momento en que un cliente le dice a un inyector que descargue algún contenido Web para compartir, el inyector lo obtiene desde el servidor de origen, usa la clave para firmarlo, y retorna el contenido firmado al cliente.
fa: ما می‌خواهیم کاربرد CENO و Ouinet محتوای هرچه بیشتری را برای مردم هرچه بیشتری تا حد امکان مقیاس و فراهم کند، بنابراین ما می‌خواهیم شما بتوانید محتوا را از مردمی که نمی‌شناسید دریافت کنید. برای این‌که شما را قادر کنیم چنین محتوایی را دریافت کنید، Ouinet از **امضای محتوا** استفاده می‌کند: سرویس‌گیرنده‌ی شما طوری تنظیم می‌شود که به محتوایی اعتماد کند که با استفاده از یک کلید خاص متعلق به injector امضا می‌شود. هرگاه که یک سرویس‌گیرنده به یک injector می‌گوید تا محتوایی از وب را برای اشتراک بازیابی کند، injector آن را از سرور اصلی می‌گیرد، از کلید برای امضای آن استفاده می‌کند، و محتوای ثبت‌شده را به سرویس‌گیرنده بازمی‌گرداند.
fr: Nous voulons que l'utilisation de CENO et Ouinet évolue et fournisse du contenu au plus grand nombre de personnes possible, nous voulons donc que vous puissiez recevoir du contenu de personnes que vous ne connaissez pas. Pour vous permettre d'accepter ce contenu, Ouinet utilise la **signature de contenu** : votre client est configuré pour faire confiance au contenu signé à l'aide d'une clé spéciale détenue par les injecteurs. Chaque fois qu'un client demande à un injecteur de récupérer du contenu Web pour le partager, l'injecteur l'obtient du serveur d'origine, utilise la clé pour le signer et renvoie le contenu signé au client.
my: ကျွန်ုပ်တို့၏ အဓိက ရည်ရွယ်ချက်မှာ CENO နှင့် Ouinet အသုံးပြုသူများများထံ အကြောင်းအရာများများကို ပံ့ပိုးပေးရန် ဖြစ်ရာ သူစိမ်းများမှ မျှဝေသည့် အကြောင်းအရာများကို သင့် အနေဖြင့် စိတ်ချလက်ချ လက်ခံသုံးစွဲနိုင်ရန် လိုအပ်သည်။ ထိုသို့ လက်ခံသုံးစွဲနိုင်ရန် Ouinet အနေဖြင့် **အကြောင်းအရာများတွင်လက်မှတ်ထိုးခြင်း** နည်းလမ်းကို အသုံးပြုပါသည်။ မျှဝေထားသည့် အကြောင်းအရာများတွင် ထိုးသွင်းစက်များက ၎င်းတို့ ၏ကိုယ်ပိုင် သော့များဖြင့် ထိုးထားသည့် လက်မှတ်များကို သင်၏ လက်ခံစက်မှ စစ်ဆေးခြင်းဖြင့် ယုံကြည်ရသည့် အကြောင်းအရာ ဟုတ်/မဟုတ်ကို သိရှိနိုင်သည်။ ထိုးသွင်းစက် ရှိ ဝက်ဘ် အကြောင်းအရာများကို မျှဝေရန် အတွက် လက်ခံစက်မှ ရှာဖွေသည့် အကြိမ်တိုင်းတွင် ထိုးသွင်းစက် သည် မူလ ဆာဗာမှ အကြောင်းအရာကို ရယူသည်။ ထို့နောက် သော့ကိုသုံးကာ လက်မှတ်ထိုးပြီး လက်ခံစက်ထံသို့ လက်မှတ်ထိုးထားသည့် အကြောင်းအရာကို ပေးပို့သည်။
pt_br: Queremos que o uso do CENO e da Ouinet escale e ofereça o máximo de conteúdo para o máximo de pessoas possível. Portanto, queremos que você consiga receber conteúdo de pessoas desconhecidas. Para possibilitar que você aceite tal conteúdo, a Ouinet utiliza a **assinatura de conteúdo**: seu cliente é configurado para confiar em conteúdo assinado usando uma chave especial pertencente aos injetores. A qualquer momento que um cliente diga a um injetor para recuperar algum conteúdo Web para compartilhamento, o injetor o obtém do servidor de origem, usa a chave para assiná-lo e retorna o conteúdo assinado para o cliente.
ru: Мы хотим, чтобы использование CENO и Ouinet масштабировалось и предоставляло как можно больше контента как можно большему числу людей, поэтому мы хотим, чтобы вы могли получать контент от незнакомых вам людей. Чтобы вы могли принимать такое содержимое, Ouinet использует **подписывание контента**: ваш клиент настроен на доверие к контенту, который подписан с помощью специального ключа, принадлежащего инъекторам. Каждый раз, когда клиент говорит инъектору получить веб-контент для обмена, инъектор получает его с исходного сервера, использует ключ для подписи и возвращает подписанный контент клиенту.
uk: Ми хочемо, щоб використання CENO та Ouinet масштабувалося і надавало якомога більше контенту якомога більшій кількості людей. Тому ми хочемо, щоб ви могли отримувати контент від незнайомих вам людей. Щоб ви могли приймати такий контент, Ouinet використовує **підписування контенту**: ваш клієнт налаштований на довіру до контенту, підписаного за допомогою спеціального ключа, що належить ін'єкторам. Щоразу, коли клієнт каже ін'єктору отримати веб-контент, ін'єктор отримує його з вихідного сервера, використовує ключ для підпису та повертає підписаний контент клієнту.

source: Different injectors may have different keys, so you can choose which injectors to trust. Picture it like this: you may trust a document signed by a *notary public* from your country, no matter who gave it to you (national or foreigner), while you would not be required to accept a document signed by a notary from another country. CENO Browser is already configured to trust a set of injectors run by eQualitie.
de: Verschiedene Injektoren können unterschiedliche Schlüssel haben, so dass Sie wählen können, welchen Injektoren Sie vertrauen. Stellen Sie sich das so vor: Sie können einem Dokument vertrauen, das von einem *Notar* aus Ihrem Land unterzeichnet wurde, unabhängig davon, wer es Ihnen ausgehändigt hat (Inländer oder Ausländer), während Sie nicht verpflichtet wären, ein Dokument zu akzeptieren, das von einem Notar aus einem anderen Land unterzeichnet wurde. CENO Browser ist bereits so konfiguriert, dass er einer Reihe von Injektoren vertraut, die von eQualitie betrieben werden.
fr: Différents injecteurs peuvent avoir des clés différentes, vous pouvez donc choisir les injecteurs auxquels faire confiance. Imaginez-le comme ceci : vous pouvez faire confiance à un document signé par un *notaire public* de votre pays, peu importe qui vous l'a remis (national ou étranger), alors que vous ne seriez pas obligé d'accepter un document signé par un notaire d'un autre pays. Le navigateur CENO est déjà configuré pour faire confiance à un ensemble d'injecteurs gérés par eQualitie.
pt_br: Injetores diferentes podem ter diferentes chaves, então você pode escolher em quais injetores confiar. Imagine desta forma: você pode confiar em um documento assinado por um *notário público* do seu país, independentemente de quem lhe deu (nacional ou estrangeiro), ao mesmo tempo, não seria exigido que aceitasse um documento assinado por um notário de outro país. O Navegador CENO já está configurado para confiar em um conjunto de injetores gerenciados pela eQualitie.

source: It delivers it to you (in the case of CENO, it shows the content on the browser).
es: Te lo entrega (en el caso de CENO, muestra el contenido en el navegador).
fa: این، آن را به دست شما می‌رساند (در مورد CENO، این محتوا را روی مرورگر نشان می‌دهد).
fr: Il vous le livre (dans le cas de CENO, il affiche le contenu sur le navigateur).
my: အကြောင်းအရာကို သင့်ထံသို့ ပို့ဆောင်ပေးသည်။ (CENO တွင် ဖြစ်ခဲ့လျှင် ၄င်းသည် အကြောင်းအရာကို browser တွင် ဖော်ပြသည်)
pt_br: Entrega o conteúdo para você (no caso do CENO, o conteúdo é exibido no navegador).
ru: Он передает его вам (в случае с CENO он показывает контент в браузере).
uk: Він передає його вам (у випадку із CENO він показує контент у браузері).

source: At that moment a second person using CENO Browser also tries to get that content. Access to the origin server or to anything beyond your region is impossible, so CENO checks the distributed cache index for that content and it finds that your device is seeding it. CENO gets your Internet address from the index, connects to it and requests the content as shown below.
de: In diesem Moment versucht eine zweite Person, die den CENO Browser verwendet, ebenfalls, diesen Inhalt zu erhalten. Da ein Zugriff auf den Ursprungsserver oder auf irgendetwas außerhalb Ihrer Region nicht möglich ist, prüft CENO den verteilten Cache-Index auf diesen Inhalt und stellt fest, dass Ihr Gerät ihn weiterleitet. CENO entnimmt dem Index Ihre Internetadresse, stellt eine Verbindung zu ihr her und fordert den Inhalt wie unten dargestellt an.
fr: À ce moment-là, une deuxième personne utilisant le navigateur CENO essaie également d'obtenir ce contenu. L'accès au serveur d'origine ou à quoi que ce soit au-delà de votre région est impossible, donc CENO vérifie l'index de cache distribué pour ce contenu et il constate que votre appareil l'ensemence. CENO obtient votre adresse Internet à partir de l'index, s'y connecte et demande le contenu comme indiqué ci-dessous.
pt_br: Nesse momento, uma segunda pessoa usando o Navegador CENO também tenta obter tal conteúdo. O acesso ao servidor de origem ou a qualquer coisa para além de sua região é impossível, então o CENO verifica o índex do cache distribuído para aquele conteúdo e descobre que seu dispositivo o está semeando. O CENO obtém seu endereço de Internet pelo índex, conecta-se a ele e solicita o conteúdo conforme mostrado abaixo.

source: Now that second device also holds a copy of content *X*, so it announces this in the distributed cache index, thus becoming a seeder. If a third person interested in that content uses CENO Browser to retrieve it, CENO will now see *two* addresses in the index for the content: your device's and that of the second user. If the content is heavy (e.g. a video), this third device may try to get half of it from each of the other devices (as shown below), thus speeding up the download and reducing the traffic they use.
de: Dieses zweite Gerät besitzt nun ebenfalls eine Kopie von Inhalt *X* und meldet dies im Index des verteilten Caches, wodurch es zum Verteiler wird. Wenn eine dritte Person, die an diesem Inhalt interessiert ist, CENO Browser verwendet, um ihn abzurufen, sieht CENO nun *zwei* Adressen im Index für den Inhalt: die Ihres Geräts und die des zweiten Benutzers. Wenn der Inhalt sehr umfangreich ist (z. B. ein Video), kann dieses dritte Gerät versuchen, die Hälfte des Inhalts von jedem der anderen Geräte abzurufen (siehe unten), wodurch der Download beschleunigt und der Datenverkehr reduziert wird.
fr: Maintenant, ce deuxième périphérique contient également une copie du contenu *X*, il l'annonce donc dans l'index de cache distribué, devenant ainsi un semeur. Si une troisième personne intéressée par ce contenu utilise le navigateur CENO pour le récupérer, CENO verra désormais *deux* adresses dans l'index du contenu : celle de votre appareil et celle du deuxième utilisateur. Si le contenu est lourd (par exemple une vidéo), ce troisième appareil peut essayer d'en obtenir la moitié de chacun des autres appareils (comme indiqué ci-dessous), accélérant ainsi le téléchargement et réduisant le trafic qu'ils utilisent.
pt_br: Agora que o segundo dispositivo também detém uma cópia do conteúdo *X*, ele então anuncia isso no índex de cache distribuído e, por consequência, torna-se um semeador. Caso uma terceira pessoa interessada nesse conteúdo use o Navegador CENO para recuperá-lo, o CENO a partir de então verá no índex *dois* endereços para o conteúdo: o do seu dispositivo e o do segundo usuário. Se o conteúdo é pesado (por exemplo, um vídeo), o terceiro dispositivo pode tentar obter metade dele a partir de cada um dos outros dispositivos (como mostrado abaixo), assim acelerando o download e reduzindo o tráfego usado por eles.

source: Finally, the situation may get even worse, and all commercial and state network infrastructure may be shut down. In this case, Ouinet and CENO Browser also have some support for *device-to-device* sharing of content between two clients sitting on the same local network (e.g. connected to the same Wi-Fi access point), even if the network has no access to others.
de: Schließlich kann sich die Situation sogar noch verschlimmern, und die gesamte kommerzielle und staatliche Netzinfrastruktur kann abgeschaltet werden. In diesem Fall unterstützen Ouinet und CENO Browser auch die gemeinsame Nutzung von Inhalten von Gerät zu Gerät zwischen zwei Clients, die sich im selben lokalen Netzwerk befinden (z. B. mit demselben Wi-Fi-Zugangspunkt verbunden sind), selbst wenn das Netzwerk keinen Zugang zu anderen hat.
fr: Enfin, la situation pourrait encore s'aggraver et toutes les infrastructures de réseau commerciales et étatiques pourraient être fermées. Dans ce cas, Ouinet et CENO Browser prennent également en charge le partage de contenu * appareil à appareil * entre deux clients assis sur le même réseau local (par exemple, connectés au même point d'accès Wi-Fi), même si le réseau a pas d'accès aux autres.
pt_br: Por fim, a situação pode ficar ainda pior e toda a infraestrutura comercial e estatal de rede pode ser desligada. Neste caso, a Ouinet e o Navegador CENO também possuem algum suporte para compartilhamento *dispositivo para dispositivo* de conteúdo entre dois clientes situados em uma mesma rede local (por exemplo, conectados o mesmo ponto de acesso WiFi), mesmo que a rede não possua acesso a outras.

source: The CENO Browser is an example of an application that uses Ouinet technology to retrieve and share Web content. We call such an application a Ouinet **client**. When you use your client (i.e. CENO) to try to access some content *X*, hosted on a Web server (which we will call *X*'s **origin** server), your client tries to contact the origin server over the Internet either directly or via some other machine configured to contact Web servers on behalf of others (a so-called **proxy** server) and then requests the desired content. This is no different from the way in which any normal Web browser works.
es: EL Navegador CENO es un ejemplo de una aplicación que usa la tecnología Ouinet para descargar y compartir contenido Web. Llamamos a tal aplicación un **cliente** Ouinet. Cuando usas tu cliente (ej., CENO) para intentar acceder a algún contenido *X*, alojado en un servidor Web (al que llamaremos servidor de **origen** de *X*), tu cliente intenta contactar al servidor de origen a través de Internet, directamente o bien vía alguna otra máquina configurada para contactar servidores Web de parte de otros (un así llamado servidor **proxy**), y luego solicita el contenido deseado. Esto no es diferente de la manera en que funciona cualquier navegador Web normal.
my: CENO ဘရောက်ဇာသည် ဝက်ဘ်အကြောင်းအရာကို ပြန်ထုတ်ရန်နှင့် မျှဝေရန် Ouinet နည်းပညာ အသုံးပြုသည့် အက်ပလီကေးရှင်း ဥပမာတစ်ခု ဖြစ်သည်။ ကျွန်ုပ်တို့သည် ထိုကဲ့သို့သော အက်ပလီကေးရှင်းကို Ouinet **လက်ခံစက်** ဟု ခေါ်သည်။ သင်သည် ဝက်ဘ်ဆာဗာတစ်ခု (ကျွန်ုပ်တို့က *X* ၏ **မူလ** ဆာဗာဟု ခေါ်ပါမည်) တွင် လက်ခံထားသည့် အကြောင်းအရာ *X* ကို ဝင်ရောက်သုံးစွဲဖို့ ကြိုးစားရန် သင့်လက်ခံစက် (ဆိုလိုသည်မှာ CENO) ကို အသုံးပြုသောအခါ သင့်လက်ခံစက်သည် အင်တာနက် သုံး၍ မူလ ဆာဗာကို တိုက်ရိုက်ဖြစ်စေ၊ အခြားစက်များကိုယ်စား ဝက်ဘ်ဆာဗာများကို ဆက်သွယ်ရန် စီစဉ်သတ်မှတ်ထားသော အခြားစက်တစ်ခုခု (**ပရောက်စီ** ဆာဗာဟု ခေါ်သည်) မှတစ်ဆင့်ဖြစ်စေ ဆက်သွယ်ရန် ကြိုးစားပြီး အလိုရှိသော အကြောင်းအရာကို တောင်းဆိုသည်။ ယင်းသည် ပုံမှန် ဝက်ဘ်ဘရောက်ဇာတစ်ခု အလုပ်လုပ်ပုံနှင့် ကွဲပြားမှု မရှိပါ။
ru: Браузер CENO является примером приложения, использующего технологию Ouinet для получения и обмена веб-контентом. Мы называем такое приложение **клиентом Ouinet**. Когда вы используете свой клиент (т.е. CENO) для доступа к некоторому контенту *X*, размещенному на веб-сервере (который мы будем называть **исходным** сервером *X*), ваш клиент пытается связаться с исходным сервером через Интернет либо напрямую, либо через какой-то другой компьютер, настроенный для связи с веб-серверами от имени других (так называемый **прокси** сервер), а затем запрашивает нужный контент. Это ничем не отличается от того, как работает любой обычный веб-браузер.
uk: Браузер CENO є різновидом програми, що використовує технологію Ouinet для отримання та обміну веб-контентом. Ми називаємо таку програму **клієнтом Ouinet**. Коли ви використовуєте свій клієнт (тобто CENO) для доступу до деякого контенту *X*, розміщеного на веб-сервері (який ми називатимемо **вихідним** сервером *X*), ваш клієнт намагається зв'язатися з вихідним сервером через інтернет або безпосередньо, або через інший комп'ютер, налаштований для зв'язку з веб-серверами від імені інших (так званий **проксі** сервер), а потім запитує потрібний контент. Це нічим не відрізняється від того, як працює будь-який звичайний веб-браузер.

source: **Technical note:** There is in fact one small gotcha. Since the client acts as an HTTP proxy running on your device, for the client to be able to decrypt and act upon HTTPS content requests, the application using the client (i.e. the Web browser part – like Firefox in CENO) needs to accept a special certificate issued by the client itself (and only used on your device). The CENO Browser already takes care of setting this certificate up for its private use so that you do not need to worry.
es: **Nota técnica:** De hecho, hay una pequeña sorpresa. Ya que el cliente actúa como un proxy HTTP ejecutándose en tu dispositivo, para que éste sea capaz de descifrar y actuar sobre solicitudes de contenido HTTPS, la aplicación que está usando al cliente (en este caso, la parte del navegador Web – como Firefox en CENO) necesita aceptar un certificado especial emitido por el cliente mismo (y usado solamente en tu dispositivo). El Navegador CENO se hace cargo de configurar este certificado para su uso privado, por lo que no necesitas preocuparte.
my: **နည်းပညာဆိုင်ရာ မှတ်ချက်-** တကယ်တမ်းတွင် အနည်းငယ် အံ့အားသင့်စရာတစ်ခု ရှိပါသည်။ လက်ခံစက်သည် သင့်စက်တွင် လုပ်ဆောင်နေသည့် HTTP ပရောက်စီတစ်ခုအဖြစ် ဆောင်ရွက်သောကြောင့် လက်ခံစက်အနေဖြင့် ကုဒ်ဖြေရန်နှင့် HTTPS အကြောင်းအရာ တောင်းဆိုမှုများကို တုံ့ပြန်ဆောင်ရွက်ရန် လက်ခံစက် (ဆိုလိုသည်မှာ CENO ရှိ Firefox ကဲ့သို့ ဝက်ဘ်ဘရောက်ဇာ အစိတ်အပိုင်း) ကို အသုံးပြုနေသော အက်ပလီကေးရှင်းသည် လက်ခံစက်ကိုယ်တိုင်က ထုတ်ပေးသည့် (သင့်စက်ပေါ်တွင်သာ အသုံးပြုသော) အထူး အသိအမှတ်ပြုလက်မှတ်ကို လက်ခံရန် လိုအပ်သည်။ CENO ဘရောက်ဇာသည် ဤအသိအမှတ်ပြုလက်မှတ်ကို သီးသန့်အသုံးပြုရန်အတွက် ပြင်ဆင်သတ်မှတ်ခြင်းကို တာဝန်ယူပြီး ဖြစ်သောကြောင့် သင် စိတ်ပူရန် မလိုအပ်ပါ။
ru: **Техническое примечание:** На самом деле есть одна небольшая загвоздка. Поскольку клиент действует как HTTP-прокси, запущенный на вашем устройстве, для того, чтобы клиент мог расшифровывать и выполнять запросы HTTPS-контента, приложение, использующее клиент (т.е. часть веб-браузера - например, Firefox в CENO), должно принять специальный сертификат, выпущенный самим клиентом (и используемый только на вашем устройстве). Браузер CENO уже позаботился об установке этого сертификата для частного использования, так что вам не нужно беспокоиться.
uk: **Технічна примітка:** Насправді є один невеликий нюанс. Оскільки клієнт діє як HTTP-проксі, запущений на вашому пристрої, для того, щоб клієнт міг розшифровувати та виконувати запити HTTPS-контенту, додаток, що використовує клієнт (тобто веб-браузер, наприклад, Firefox в CENO), має прийняти спеціальний сертифікат, випущений самим клієнтом (який використовується лише на пристрої). Браузер CENO вже подбав про встановлення такого сертифіката, тому вам не потрібно хвилюватися.

source: Also, the CENO Browser does not announce the URL of every single resource it holds: with any modern page having tens or hundreds of components (images, style sheets, scripts…), that would create a lot of traffic. Instead, resources are grouped under the URL of the page pulling them, and only that URL is announced. This is done with the help of an *ad hoc* browser extension (described later on).
es: A su vez, el Navegador CENO no anuncia el URL de cada recurso único que contiene: ya que cualquier página moderna tiene decenas o cientos de componentes (imágenes, hojas de estilo, scripts…), eso crearía un gran cantidad de tráfico. Por lo tanto, los recursos son agrupados bajo el URL de la página que los referencia, y solo ese URL es anunciado. Esto se hace con la ayuda de una extensión *ad hoc* del navegador (descripta más adelante).
my: ထို့အပြင် CENO ဘရောက်ဇာသည် ၎င်းကိုအသုံးပြု၍ ဝင်ရောက်ထားသော ရင်းမြစ်တိုင်း၏ URL ကို မကြေငြာပါ။ အဘယ်ကြောင့် ဆိုသော် ထိုရင်းမြစ်များတွင် (ပုံရိပ်များ၊ စတိုင်စာမျက်နှာများနှင့် စာညွှန်းများ..) စသည့် အစိတ်အပိုင်း ဆယ်ချီ၊ ရာချီ ဖွဲ့စည်းထားသော ဝက်ဘ်စာ မျက်နှာများပါဝင်နေရာ ၎င်းတို့သည် အင်တာနက် လမ်းကြောင်း ပိတ်ဆို့မှုများကို ဖြစ်ပေါ်စေသောကြောင့်ပင်။ ထို့အစား ရင်းမြစ်များကို ဆွဲထုတ်ရန် သုံးထားသည့် သက်ဆိုင်ရာ URL အောက်တွင် အဖွဲ့လိုက်စုစည်းထားပြီး ထို URL ကိုသာ ကြေငြာပေးသည်။ ယင်း လုပ်ဆောင်ချက်ကို * ယာယီ* ဘရောက်ဇာ အဆက် (နောက်တွင်ရှင်းလင်းထား) ၏ အကူအညီဖြင့် လုပ်ဆောင်သည်။
ru: Кроме того, Браузер CENO не объявляет URL каждого отдельного ресурса, который он содержит: при наличии на любой современной странице десятков или сотен компонентов (изображений, таблиц стилей, скриптов...) это создало бы большой трафик. Вместо этого ресурсы группируются под URL страницы, на которой они находятся, и объявляется только этот URL. Это делается с помощью расширения браузера *ad hoc* (описано ниже).
uk: Крім того, браузер CENO не анонсує URL кожного ресурсу, який він роздає: з огляду на наявність на будь-якій сучасній сторінці десятків або сотень компонентів (зображень, таблиць стилів, скриптів...) це створило б великий трафік. Натомість ресурси групуються під URL-адресу сторінки, на якій вони розташовані, і оголошується лише URL-адреса. Це робиться за допомогою розширення браузера *ad hoc* (наведено нижче).

source: By the way, injector certificates are shipped in the CENO Browser, allowing it to detect attackers trying to impersonate injectors.
es: Dicho sea de paso, los certificados de los inyectores vienen en conjunto con el Navegador CENO, permitiéndole detectar a los atacantes que están intentando hacerse pasar por inyectores.
my: ထိုးသွင်းစက်များ၏ အသိအမှတ်ပြု လက်မှတ်များကို CENO ဘရောက်ဇာ အတွင်း ထည့်ထားသည့်အတွက် ထိုးသွင်းစက် ပုံစံဟန်ဆောင်၍ တိုက်ခိုက်မှုများကို ဖော်ထုတ် ရှောင်လွှဲနိုင်ပါသည်။
ru: Кстати, сертификаты инъекторов поставляются в Браузере CENO, что позволяет ему обнаруживать злоумышленников, пытающихся выдать себя за инъекторов.
uk: До речі, сертифікати ін'єкторів направляються у браузер CENO, що дозволяє йому виявляти зловмисників, які намагаються видати себе за ін'єкторів.
