Repository: censorship-no/ceno-docs
Catalog: user-manual/*/concepts/how.po
Languages: ar, de, es, fa, fr, my, pt_br, ru, tr, uk, ur

source: In any Web browser, to access content *X* it needs to know its [Uniform Resource Locator][Uniform Resource Locator] (URL), that is the address in the browser's location bar, e.g. `https://example.com/foo/x`. From that URL, a normal browser would infer that it has to contact the Web server called `example.com` using the HTTP protocol (the language used to exchange Web resources) over SSL/TLS (a security layer over TCP, the Internet's rules for programs to talk to each other) and request the resource `/foo/x`.
ar: للوصول إلى المحتوى *X*، يحتاج أي متصفح ويب إلى معرفة [محدد موقع الموارد الموحد][محدد موقع الموارد الموحد] (URL)، وهو العنوان الموجود في شريط موقع المتصفح، على سبيل المثال `https://example.com/foo/x`. من عنوان URL هذا، يستنتج المتصفح العادي أنه عليه الاتصال بخادم الويب المسمى `example.com` باستخدام بروتوكول HTTP (اللغة المستخدمة لتبادل موارد الويب) عبر بروتوكول SSL/TLS (طبقة أمان عبر بروتوكول TCP، الذي يحدد قواعد الإنترنت للبرامج للتحدث مع بعضها البعض) وطلب المصدر `/foo/x`.
de: Jeder Webbrowser benötigt für den Zugriff auf Inhalt *X* dessen [Uniform Resource Locator][Uniform Resource Locator] (URL), d. h. die Adresse in der Adressleiste des Browsers, z. B. `https://example.com/foo/x`. Aus dieser URL würde ein normaler Browser ableiten, dass er den Webserver mit dem Namen `example.com` unter Verwendung des HTTP-Protokolls (die Sprache, die für den Austausch von Webressourcen verwendet wird) über SSL/TLS (eine Sicherheitsschicht über TCP, die Regeln des Internets für die Kommunikation von Programmen untereinander) kontaktieren und die Ressource `/foo/x` anfordern muss.
fa: در هر مرورگر وب، برای دسترسی به محتوای *X* مرورگر باید URL یا [مکان‌یاب یک‌شکل](https://en.wikipedia.org/wiki/Uniform_Resource_Locator) آن را بشناسد، که همان نشانی در مستطیل آدرس مرورگر است، مثلاً `https://example.com/foo/x`. از آن URL، یک مرورگر معمولی پی خواهد برد که باید با استفاده از پروتکل HTTP (زبان به‌کاررفته برای مبادله‌ی منابع وب) روی SSL/TLS (یک لایه‌ی امنیتی روی TCP، قواعد اینترنت برای برنامه‌ها تا با یکدیگر مکالمه کنند) با یک سرور وب به اسم `example.com` تماس بگیرد و منبع `/foo/x` را درخواست کند.
fr: Dans tout navigateur web, pour accéder au contenu *X*, il faut connaitre son [localisateur uniforme de ressources][Uniform Resource Locator] (URL), à savoir l'adresse figurant dans la barre d'adresse du navigateur, comme par exemple `https://example.com/foo/x`. À partir de cette URL, un navigateur classique en déduirait qu'il doit contacter le serveur web appelé `example.com` en utilisant le protocole HTTP (le langage utilisé pour échanger des ressources web) sur SSL/TLS (une couche de sécurité sur TCP, les règles Internet permettant aux programmes se communiquer entre eux) et demander la ressource `/foo/x`.
my: မည်သည့် ဝက်ဘ် ဘရောက်ဇာတွင်မဆို အကြောင်းအရာ *X* ကို ဝင်ရောက်သုံးစွဲရန် ၎င်းသည် ဘရောက်ဇာ၏ တည်နေရာဘားရှိ လိပ်စာဖြစ်သည့် ၎င်း၏ [ကွဲလွဲခြင်းမရှိသော ရင်းမြစ် တည်နေရာရှာစနစ်][ကွဲလွဲခြင်းမရှိသော ရင်းမြစ် တည်နေရာရှာစနစ်] (URL)၊ ဥပမာ- `https://example.com/foo/x`ကို သိရန် လိုအပ်သည်။ ထို URL မှတစ်ဆင့် ပုံမှန် ဘရောက်ဇာသည် SSL/TLS (ပရိုဂရမ်များ တစ်ခုနှင့်တစ်ခု ဆက်သွယ်နိုင်ရန် အင်တာနက်၏ စည်းမျဉ်းများဖြစ်သည့် TCP သုံးသော လုံခြုံရေးအလွှာ) ဖြင့် HTTP ပရိုတိုကော (ဝက်ဘ် ရင်းမြစ်များကို ဖလှယ်ရာတွင် သုံးသည့် ဘာသာစကား) ကို အသုံးပြု၍ `example.com`ဟုခေါ်သည့် ဝက်ဘ် ဆာဗာကို ဆက်သွယ်ပြီး ရင်းမြစ် `/foo/x` ကို တောင်းဆိုရမည် ဖြစ်ကြောင်း ဆုံးဖြတ်ပါမည်။
pt_br: Em qualquer navegador Web, para acessar o conteúdo *X* ele precisa saber o [Localizador Uniforme de Recursos][Localizador Uniforme de Recursos](URL) de tal conteúdo, que é o endereço na barra de localização do navegador - por exemplo, `https://example.com/foo/x`. A partir dessa URL, um navegador comum deduziria que precisa entrar em contato com o servidor Web chamado `example.com`, usando o protocolo HTTP (a linguagem usada para intercambiar recursos Web) em cima do SSL/TLS (uma camada de segurança em cima do TCP, as regras da Internet para que programas conversem uns com os outros) e solicitar o recurso `/foo/x`.
ru: В любом веб-браузере для доступа к контенту *X* необходимо знать его [Унифицированный указатель ресурса][Унифицированный указатель ресурса] (URL), то есть адрес в строке местоположения браузера, например, `https://example.com/foo/x`. Из этого URL обычный браузер сделает вывод, что он должен связаться с веб-сервером под названием `example.com`, используя протокол HTTP (язык, используемый для обмена веб-ресурсами) через SSL/TLS (уровень безопасности поверх TCP, правила Интернета для общения программ друг с другом) и запросить ресурс `/foo/x`.
tr: İnternet tarayıcılarında *X* içeriğine erişmek için [Tekdüzen Kaynak Bulucu][Uniform Resource Locator] (URL) adresinin bilinmesi gerekir. Bu adres tarayıcınızın adres çubuğunda bulunur. Örneğin`https://orneksite.com/deneme/a`. Tarayıcılar bu adresten `orneksite.com` sunucusuna SSL/TLS (programların birbiriyle iletişimi için kullanılan TCP iletişim kuralının üzerine eklenmiş bir güvenlik katmanı) üzerinden HTTP iletişim kuralı ile ulaşmaları ve `/deneme/a` kaynağını istemeleri gerektiğini çıkarır.
uk: У будь-якому веб-браузері для доступу до контенту *X* необхідно знати його [Уніфікований локатор ресурсу][Уніфікований локатор ресурсу] (URL), тобто адресу в адресному рядку браузера, наприклад `https://example.com/foo/ x`. З цього URL звичайний браузер зробить висновок, що він повинен зв'язатися з веб-сервером під назвою `example.com`, використовуючи протокол HTTP (мова, яка використовується для обміну веб-ресурсами) через SSL/TLS (рівень безпеки в TCP, правила інтернету спілкування програм один з одним) і запросити ресурс `/foo/x`.
ur: کسی بھی ویب براؤزر میں، مواد *X* تک رسائی حاصل کرنے کے لیے اسے اس کے [یونیفارم ریسورس لوکیٹر][Uniform Resource Locator] (URL) کو جاننے کی ضرورت ہے، جو کہ براؤزر کے لوکیشن بار میں پتہ ہے، جیسے `https://example.com/foo/x`۔ اس URL سے، ایک عام براؤزر اس بات کا اندازہ لگائے گا کہ اسے SSL/TLS (TCP پر ایک حفاظتی پرت، انٹرنیٹ کے قواعد پر HTTP پروٹوکول (ویب وسائل کے تبادلے کے لیے استعمال ہونے والی زبان) کا استعمال کرتے ہوئے `example.com` نامی ویب سرور سے رابطہ کرنا ہے۔ پروگراموں کو ایک دوسرے سے بات کرنے کے لیے) اور وسیلہ `/foo/x` کی درخواست کریں۔

source: Ouinet looks for the content in a different way. It uses an index not unlike that of a book: in Ouinet's **distributed cache index** you look up the whole URL of the content and get a list of clients holding a copy of it. The index itself is distributed, with clients in charge of announcing what content they have to others. Actually, only a *hint* on each URL is announced, so that someone spying your device's traffic cannot tell which content you have, but someone looking for a particular content can follow the hints towards your client.
ar: يبحث Ouinet عن المحتوى بطريقة مختلفة. فهو يستخدم فهرساً لا يختلف عن فهرس الكتاب: في **فهرس ذاكرة التخزين المؤقت الموزع** الخاص بـ Ouinet، يمكنك البحث عن عنوان URL الكامل للمحتوى والحصول على قائمة بالعملاء الذين لديهم نسخة منه. يتم توزيع الفهرس نفسه مع العملاء المسؤولين عن الإعلان عن المحتوى الذي لديهم للآخرين. في الواقع، يتم الإعلان فقط عن *تلميح* لكل عنوان URL، بحيث لا يتمكن أي شخص يتجسس على حركة مرور جهازك من معرفة المحتوى الذي لديك، ولكن يمكن للشخص الذي يبحث عن محتوى معين اتباع التلميحات ليصل إلى عميلك.
de: Ouinet sucht die Inhalte auf eine andere Weise. Es verwendet einen Index, der dem eines Buches nicht unähnlich ist: Im **verteilten Cache-Index** von Ouinet wird die gesamte URL des Inhalts nachgeschlagen und eine Liste der Clients erstellt, die eine Kopie des Inhalts besitzen. Der Index selbst wird verteilt, wobei die Clients dafür zuständig sind, anderen mitzuteilen, welche Inhalte sie besitzen. Eigentlich wird nur ein *Hinweis* zu jeder URL bekannt gegeben, so dass jemand, der den Datenverkehr Ihres Geräts ausspäht, nicht feststellen kann, welche Inhalte Sie haben, aber jemand, der nach einem bestimmten Inhalt sucht, kann den Hinweisen zu Ihrem Client folgen.
es: Ouinet busca al contenido de una manera diferente. Usa un índice parecido al de un libro: en el **índide de la caché distribuida** de Ouinet buscas al URL completo del contenido, y obtienes una lista de clientes que tienen una copia del mismo. El índice en sí mismo está distribuido, con los clientes haciéndose cargo de anunciar a otros qué contenido tienen. En realidad, solamente es anunciada una *pista* sobre cada URL, por lo que alguien espiando el tráfico en tu dispositivo no puede decir qué contenido tienes, pero alguien buscando un contenido particular puede seguir las pistas hacia tu cliente.
fa: Ouinet به شیوه‌ای متفاوت به دنبال محتوا می‌گردد. این نرم‌افزار از نمایه‌ای استفاده می‌کند که به نمایه‌ی یک کتاب بی‌شباهت نیست: در **نمایه‌ی کش توزیع‌شده**ی Ouinet شما کل URL محتوا را می‌جویید و لیستی از سرویس‌گیرندگان دارای یک کپی از آن به دست می‌آورید. خود نمایه توزیع‌شده است، و سرویس‌گیرندگان وظیفه دارند به دیگران اعلام کنند که چه محتوایی را دارند. در واقع، فقط یک *اشاره* به هر URL اعلام می‌شود، طوری که کسی که ترافیک دستگاه شما را جاسوسی می‌کند نمی‌تواند بفهمد که شما چه محتوایی را دارید، اما کسی که به دنبال محتوایی خاص است می‌تواند اشاره‌ها به‌سوی سرویس‌گیرنده‌ی شما را دنبال کند.
fr: Ouinet recherche le contenu de façon différente. Il utilise un index semblable à celui d'un livre : dans l'**index du cache distribué** de Ouinet, on recherche une URL complète de contenu et on obtient une liste des clients qui en détiennent une copie. L'index lui-même est distribué, les clients étant chargés d'annoncer aux autres le contenu dont ils disposent. En réalité, seul un *indice* de chaque URL est annoncé, de sorte que quelqu'un qui espionne le trafic de votre appareil ne peut pas savoir quel contenu vous détenez, mais quelqu'un qui cherche un contenu particulier peut suivre les indices vers votre client.
my: Ouinet သည် အကြောင်းအရာကို မတူညီသော နည်းလမ်းဖြင့် ရှာဖွေသည်။ ၎င်းသည် စာအုပ်အညွှန်းနှင့် ဆင်တူသော အညွှန်းကို အသုံးပြုသည်- Ouinet ၏ **ဖြန့်ချိထားသော ယာယီသိမ်းဆည်းထားသည့် မှတ်ဉာဏ်အညွှန်း** တွင် သင်သည် အကြောင်းအရာ၏ URL တစ်ခုလုံးကို ရှာကြည့်သောအခါ ၎င်း၏ မိတ္တူ ရှိသော လက်ခံစက် စာရင်းကို ရရှိသည်။ အညွှန်းကို အခြားသူများအတွက် ၎င်းတို့တွင် မည်သည့်အကြောင်းအရာ ရှိကြောင်း ကြေညာထားသည့် လက်ခံစက်များထံ ဖြန့်ချိထားသည်။ တကယ်တမ်းတွင် URL တစ်ခုစီအတွက် *သဲလွန်စ* တစ်ခုကိုသာ ကြေညာထားသည်။ ဤသို့ဖြင့် သင့်စက်၏ အသွားအလာကို လျှို့ဝှက်စွာ စောင့်ကြည့်နေသူသည် သင့်တွင် မည်သည့်အကြောင်းအရာရှိသည်ကို မပြောနိုင်သော်လည်း တိကျသော အကြောင်းအရာ ရှာနေသူသည် သဲလွန်စများကို လိုက်၍ သင့်လက်ခံစက်ထံ ရောက်နိုင်သည်။
pt_br: Ouinet procura o conteúdo de uma forma diferente. Ela usa um índex não muito diferente do de um livro: no **índex de cache distribuído** você procura o URL completo do conteúdo e obtém uma lista de clientes mantendo uma cópia dele. O índex em si é distribuído, com clientes encarregados de anunciar quais conteúdos eles possuem para outros. Na verdade, somente uma *dica* de cada URL é anunciada, de modo que alguém espionando o tráfego de seu dispositivo não é capaz de identificar qual conteúdo você possui, mas alguém procurando por um conteúdo específico pode seguir as dicas em direção ao seu cliente.
ru: Ouinet ищет контент по-другому. Он использует индекс, не похожий на книжный: в **распределенном кэш-индексе Ouinet** вы просматриваете весь URL-адрес контента и получаете список клиентов, у которых есть его копия. Сам индекс является распределенным, причем клиенты сами сообщают другим о том, какой контент у них есть. На самом деле, объявляется только *подсказка* на каждом URL, так что кто-то, следящий за трафиком вашего устройства, не может определить, какой контент у вас есть, но тот, кто ищет конкретный контент, может следовать подсказкам к вашему клиенту.
tr: Ouinet ise içeriği farklı şekilde arar. Kitaptan farksız olan bir dizin kullanır. Ouinet **dağıtılmış ön bellek dizini** üzerinde içeriğin tam adresini arayarak kopyasının bulunduğu istemcilerin listesini edinir. Bu dizinin kendisi de dağıtılmıştır ve istemciler hangi içeriğin başkları tarafından kullanıma sunulduğunu duyururlar. Aslında her adres ile ilgili olarak yalnızca bir *ipucu* duyurulur. Böylece aygıtınızın trafiğini izleyen birisi hangi içeriğe eriştiğini bilemez. Fakat belirli bir içeriği arayan kişi bu ipuçlarını kullanarak istemcinizi bulabilir.
uk: Ouinet шукає вміст інакше. Він використовує індекс, схожий на книжковий: у **розподіленому індексі кеша** Ouinet ви шукаєте повну URL-адресу контенту та отримуєте список клієнтів, у яких є його копія. Сам індекс є розподіленим, при чому клієнти самі повідомляють іншим, який саме контент вони мають. Насправді, пропонується тільки *підказка* про кожну URL-адресу, тому той, хто стежить за трафіком вашого пристрою, не може визначити, який контент у вас є. Однак той, хто шукає конкретний контент, може орієнтуватися на підказку і знайти ваш клієнт .
ur: Ouinet مواد کو مختلف انداز میں تلاش کرتا ہے۔ یہ کتاب کے برعکس انڈیکس کا استعمال کرتا ہے: Ouinet کے **تقسیم شدہ کیش انڈیکس** میں آپ مواد کا پورا URL تلاش کرتے ہیں اور اس کی ایک کاپی رکھنے والے کلائنٹس کی فہرست حاصل کرتے ہیں۔ انڈیکس خود تقسیم کیا جاتا ہے، کلائنٹس کے ساتھ یہ اعلان کرنے کے ذمہ دار ہوتے ہیں کہ ان کے پاس کون سا مواد ہے جو دوسروں کے لیے ہے۔ درحقیقت، ہر URL پر صرف ایک *اشارہ* کا اعلان کیا جاتا ہے، تاکہ کوئی آپ کے ڈیوائس کے ٹریفک کی جاسوسی کرنے والا یہ نہ بتا سکے کہ آپ کے پاس کون سا مواد ہے، لیکن کوئی خاص مواد تلاش کرنے والا آپ کے کلائنٹ کے اشارے پر عمل کر سکتا ہے۔

source: **Technical note:** One way the index is implemented is using [BitTorrent][BitTorrent]'s [Distributed Hash Table][Distributed Hash Table] (DHT) to get the addresses (IP and port) of the clients with the content. The DHT uses a [Cryptographic hash function][Cryptographic hash function] to compute the table key from the content's URL and some other parameters as the injector key (see below), so that several indexes can coexist.
ar: **ملاحظة تقنية:** إحدى الطرق التي يتم بها تنفيذ الفهرس هي استخدام [جدول التجزئة الموزّع][جدول التجزئة الموزّع] (DHT) الخاص بـ [بت تورنت][بت تورنت] للحصول على عناوين (IP والمنفذ) العملاء الذين يتوفر لديهم المحتوى. يستخدم DHT [دالة التجزئة المعماة][دالة التجزئة المعماة] لإنشاء مفتاح الجدول من عنوان URL الخاص بالمحتوى وبعض الإعدادات الأخرى كمفتاح الحاقن (انظر أدناه)، بحيث يمكن أن تتعايش عدة فهارس.
de: **Technischer Hinweis:** Eine Möglichkeit, den Index zu implementieren, besteht darin, die [Distributed Hash Table][Distributed Hash Table] (DHT) von [BitTorrent][BitTorrent] zu verwenden, um die Adressen (IP und Port) der Clients mit den Inhalten zu erhalten. Die DHT verwendet eine [kryptografische Hash-Funktion][kryptografische Hash-Funktion], um den Tabellenschlüssel aus der URL des Inhalts und einigen anderen Parametern als Injektorschlüssel zu berechnen (siehe unten), so dass mehrere Indizes nebeneinander bestehen können.
fa: **نکته‌ی فنی:** یک راه پیاده‌سازی نمایه استفاده از [جدول درهم‌سازی توزیع‌شده][Distributed Hash Table]ی [بیت‌تورنت][BitTorrent] (DHT) برای دریافت نشانی‌های (IP و درگاه) سرویس‌گیرندگان با محتوا است. DHT از یک [تابع درهم‌سازی رمزی][Cryptographic hash function] برای محاسبه‌ی کلید جدول از URL محتوا و برخی پارامترهای دیگر مانند کلید انژکتور است (به پایین بنگرید)، طوری که چندین نمایه بتوانند همزمان وجود داشته باشند.
fr: **Note technique :** L'index est notamment mis en place grâce à la [table de hachage distribuée][Distributed Hash Table] (DHT) de [BitTorrent][BitTorrent] pour obtenir les adresses (IP et port) des clients possédant le contenu. La DHT utilise une [fonction de hachage cryptographique][Cryptographic hash function] pour calculer la clé de table à partir de l'URL du contenu et d'autres paramètres comme la clé de l'injecteur (voir ci-dessous), de sorte que plusieurs index puissent coexister.
my: **နည်းပညာဆိုင်ရာမှတ်ချက်** ဤအညွှန်းကို အကောင်အထည်ဖော်နိုင်သည့် နည်းလမ်းတစ်ခုမှာ [BitTorrent][BitTorrent]၏ [ခွဲဖြန့်ထားသော ဒေတာတည်ဆောက်ပုံ ဇယား][ခွဲဖြန့်ထားသော ဒေတာတည်ဆောက်ပုံ ဇယား] (DHT) ကို အသုံးပြုပြီး လက်ခံစက်နှင့် အကြောင်းအရာများ၏ လိပ်စာ (အိုင်ပီနှင့် port) တို့ကို ရယူခြင်း ဖြစ်သည်။ DHT က [၀ှက်စာအဖြစ် ပြောင်းလဲအလုပ်လုပ်သော နည်းပညာ][၀ှက်စာအဖြစ် ပြောင်းလဲအလုပ်လုပ်သော နည်းပညာ] ကို အသုံးပြု၍ အကြောင်းအရာ၏ URL နှင့် ထိုးသွင်းသော့ (အောက်တွင်ကြည့်) ကဲ့သို့ အခြား သတ်မှတ်ကိန်းများမှတဆင့် ဇယားသော့ကို တွက်ထုတ်သည်။ သို့မှသာ ညွှန်ကိန်း အမျိုးမျိုး သည် အတူတကွ ရှိနေနိုင်မည်ဖြစ်သည်။
pt_br: **Nota técnica:** Uma forma pela qual o índex é implementado é com uso da [Tabela Hash Distribuída][Tabela Hash Distribuída] do [BitTorrent][BitTorrent] (DHT) para obter o endereço (IP e porta) dos clientes com o conteúdo. O DHT usa uma [Função criptográfica hash][Função criptográfica hash] para computar a chave da tabela a partir do conteúdo da URL e alguns outros parâmetros tais como a chave do injetor (veja abaixo), de modo que diversos índexes podem coexistir.
ru: **Техническое примечание:** Один из способов реализации индекса - использование [распределённой хэш-таблицы][распределённой хэш-таблицы][протокола BitTorrent][протокола BitTorrent] (DHT) для получения адресов (IP и порт) клиентов с контентом. DHT использует [криптографическую хеш-функцию][криптографическую хеш-функцию] для вычисления ключа таблицы из URL контента и некоторых других параметров в качестве ключа инъектора (см. ниже), так что несколько индексов могут сосуществовать.
tr: **Teknik not:** Dizinin oluşturulması için [BitTorrent][BitTorrent] [Dağıtılmış Karma Tablosu][Distributed Hash Table] (DHT) kullanılarak içeriğin bulunduğu istemcilerin adresleri (IP ve bağlantı noktası) alınır. DHT dizinlerin birlikte var olması için [şifrelenmiş karma işleviyle][Cryptographic hash function] içeriğin adresi ve içerik ekleyici anahtarı (aşağıya bakın) gibi diğer ölçütleri kullanarak tablo anahtarını hesaplar.
uk: **Технічна примітка:** Один із способів реалізації індексу — використання [розподіленої хеш-таблиці][розподіленої хеш-таблиці] [протоколу BitTorrent][протоколу BitTorrent] (DHT) для отримання адрес (IP та порту) клієнтів з контентом. DHT використовує [криптографічну хеш-функцію][криптографічну хеш-функцію] для обчислення ключа таблиці з URL контенту та деяких інших параметрів як ключ ін'єктора (дивіться нижче), так що кілька індексів можуть співіснувати.
ur: **تکنیکی نوٹ:** انڈیکس کو لاگو کرنے کا ایک طریقہ یہ ہے کہ [BitTorrent][BitTorrent] کی [تقسیم شدہ ہیش ٹیبل][Distributed Hash Table] (DHT) کا استعمال کرتے ہوئے کلائنٹس کے ایڈریس (IP اور پورٹ) مواد کے ساتھ حاصل کریں۔ DHT مواد کےURL سے ٹیبل کلید اور انجیکٹر کلید (نیچے دیکھیں) کے طور پر کچھ دوسرے پیرامیٹرز کی گنتی کرنے کے لیے ایک [کرپٹوگرافک ہیش فنکشن][Cryptographic hash function] کا استعمال کرتا ہے، تاکہ کئی اشاریہ ایک ساتھ رہ سکیں۔

source: Also, Ceno Browser does not announce the URL of every single resource it holds: with any modern page having tens or hundreds of components (images, style sheets, scripts…), that would create a lot of traffic. Instead, resources are grouped under the URL of the page pulling them, and only that URL is announced. This is done with the help of an *ad hoc* browser extension (described later on).
ar: أيضًا، لا يعلن متصفح Ceno عن عنوان URL كل مورد لديه: تحتوي الصفحات الحديثة على عشرات أو مئات المكونات (صور و أوراق الأنماط و البرامج النصية...)، من شأن ذلك أن يخلق الكثير من حركة مرور البيانات. بدلاً من ذلك، يتم تجميع الموارد ضمن عنوان URL للصفحة التي تسحبها، ويتم الإعلان عن عنوان URL هذا فقط. يتم ذلك بمساعدة امتداد المتصفح *ad hoc* (سيتم وصفه لاحقًا).
ur: اس کے علاوہ، CENO براؤزر اپنے پاس موجود ہر ایک وسائل کے URL کا اعلان نہیں کرتا: کسی بھی جدید صفحہ کے ساتھ جس میں دسیوں یا سینکڑوں اجزاء ہوتے ہیں (تصاویر، سٹائل شیٹس، سکرپٹ…)، جو بہت زیادہ ٹریفک پیدا کرے گا۔ اس کے بجائے، وسائل کو صفحہ کے URL کے تحت گروپ کیا جاتا ہے جو انہیں کھینچتا ہے، اور صرف اس URL کا اعلان کیا جاتا ہے۔ یہ ایک *ایڈہاک* براؤزر ایکسٹینشن کی مدد سے کیا جاتا ہے (بعد میں بیان کیا جائے گا)۔
