Repository: censorship-no/ceno-docs
Catalog: user-manual/*/concepts/how.po
Languages: ar, de, es, fa, fr, my, pt_br, ru, tr, uk, ur

source: An injector can behave like a normal (though extra available) proxy server, and this is indeed what Ouinet clients (including the CENO Browser) do currently when trying to access content over a proxy. In this case, the injector will neither see the actual information flowing between your client and the origin server (unless it is a plain, unencrypted HTTP connection itself).
es: Un inyector puede comportarse como un servidor proxy normal (aunque extra disponible), y esto es efectivamente lo que hacen actualmente los clientes Ouinet (incluyendo al Navegador CENO) cuando tratan de acceder contenido a través de un proxy. En este caso, el inyector tampoco verá información real fluyendo entre tu cliente y el servidor de origen (a menos que en sí misma sea una conexión HTTP común, no cifrada).
my: ထို့အပြင် ထိုးသွင်းစက် တစ်ခုကို ပုံမှန် ပရောက်စီဆာဗာ အဖြစ်လည်း အသုံးပြုနိုင်သည်။ အမှန်တွင်လည်း (CENO ဘရောက်ဇာ အပါအဝင်) Ouinet လက်ခံစက်များက အကြောင်းအရာတစ်ခုကို ပရောက်စီ မှတဆင့် ဝင်ရောက်ရန် ကြိုးပမ်းသည့်အခါ ထိုးသွင်းစက်ကို ပုံမှန် ပရောက်စီဆာဗာ အဖြစ် သုံးသည်။ ထိုကဲ့သို့ အခြေအနေတွင် ထိုးသွင်းစက်သည် လက်ခံစက်နှင့် မူလဆာဗာ အကြား (မူလဆာဗာသည်ကုဒ်ဖြင့် ပြောင်းလဲထားခြင်း မရှိသည့် http ချိတ်ဆက်မှုမဟုတ်ပါက) သတင်းအချက်အလက် စီးဆင်းမှုကို သိရှိနိုင်မည်မဟုတ်ပါ။
ru: Инъектор может вести себя как обычный (хотя и дополнительно доступный) прокси-сервер, и это действительно то, что клиенты Ouinet (включая CENO Browser) делают в настоящее время при попытке получить доступ к контенту через прокси. В этом случае инъектор не будет видеть фактическую информацию, проходящую между вашим клиентом и исходным сервером (если только это не обычное, незашифрованное HTTP-соединение).
uk: Ін'єктор може поводитися як звичайний проксі-сервер (але з підвищеною доступністю), і це саме те, що клієнти Ouinet (включно з браузером CENO) роблять в момент, коли намагаються отримати доступ до контенту через проксі. У цьому випадку ін'єктор не буде бачити фактичну інформацію, що проходить між вашим клієнтом і вихідним сервером (якщо це тільки не звичайне, незашифроване HTTP-з'єднання).

source: Different injectors may have different keys, so you can choose which injectors to trust. Picture it like this: you may trust a document signed by a *notary public* from your country, no matter who gave it to you (national or foreigner), while you would not be required to accept a document signed by a notary from another country. The CENO Browser is already configured to trust a set of injectors run by eQualitie.
es: Diferentes inyectores podrían tener diferentes claves, por lo que puedes elegir en qué inyectores confiar. Imagínatelo así: podrías confiar en un documento firmado por un *notario público* de tu país, sin importar quién te lo dió (nacional o extranjero), mientras que no te sería requerido aceptar un documento firmado por un notario de otro país. El Navegador CENO ya está configurado para confiar en un conjunto de inyectores administrados por eQualitie.
my: မတူညီသော ထိုးသွင်းစက်များသည် မတူညီသောသော့များရှိနိုင်သောကြောင့် မည်သည့်ထိုးသွင်းစက်ကို ယုံကြည်သင့်သည်ကို သင်ရွေးချယ်နိုင်ပါသည်။ ယခုအကြောင်းအရာကို ဤကဲ့သို့ ပုံဖော်စဉ်းစားကြည့်ပါ။ သင်သည် သင့်နိုင်ငံမှ လက်မှတ်ပါသော နိုတြီစာစောင်ကို ယုံကြည်တယ်။ နိုင်ငံသား(ဒါမှမဟုတ်) နိုင်ငံခြားသား၊ မည်သူ့ထံမှမဆို ရစေကာမူ သင်ယုံကြည်ပါတယ်။ အခြားတစ်ဖက်တွင်မူ တခြားနိုင်ငံလက်မှတ်ပါသော နိုတြီကို သင်လက်မခံပါ။ CENO ဘရောက်ဇာသည် eQualitie မှ ပြုလုပ်ထားသော ယုံကြည်စိတ်ချရေသာ ထိုးသွင်းစက်များကို စီစဉ်ထားပြီးဖြစ်ပါတယ်။
ru: У разных инъекторов могут быть разные ключи, поэтому вы можете выбирать, каким инъекторам доверять. Представьте это так: вы можете доверять документу, подписанному *нотариусом* из вашей страны, независимо от того, кто вам его выдал (гражданин или иностранец), в то время как вы не обязаны принимать документ, подписанный нотариусом из другой страны. Браузер CENO уже настроен на доверие к набору инъекторов под управлением eQualitie.
uk: У різних ін'єкторів можуть бути різні ключі, тому ви можете обирати яким ін'єкторам довіряти. Уявіть це так: ви можете довіряти документу, підписаному нотаріусом з вашої країни, незалежно від того, хто вам його видав (громадянин або іноземець), але ви не зобов'язані приймати документ, підписаний нотаріусом з іншої країни. Браузер CENO вже налаштований на довіру до набору ін'єкторів під керуванням eQualitie.

source: At that moment a second person using the CENO Browser also tries to get that content. Access to the origin server or to anything beyond your region is impossible, so CENO checks the distributed cache index for that content and it finds that your device is seeding it. CENO gets your Internet address from the index, connects to it and requests the content as shown below.
es: En ese momento, una segunda persona usando el Navegador CENO también intenta obtener ese contenido. El acceso al servidor de origen o a cualquier cosa más allá de tu región es imposible, por lo que CENO comprueba el índice de la caché distribuida por ese contenido, y encuentra que tu dispositivo está sembrándolo. CENO obtiene tu dirección de Internet del índice, se conecta a él y solicita el contenido como se muestra abajo.
ru: В этот момент второй человек, использующий Браузер CENO, также пытается получить этот контент. Доступ к исходному серверу или к чему-либо за пределами вашего региона невозможен, поэтому CENO проверяет индекс распределенного кэша для этого контента и обнаруживает, что ваше устройство передает его. CENO получает ваш интернет-адрес из индекса, подключается к нему и запрашивает контент, как показано ниже.
uk: У цей момент інша людина, яка використовує браузер CENO, намагається отримати цей контент. Доступ до вихідного сервера або чогось за межами вашого регіону неможливий, тому CENO перевіряє індекс розподіленого кеша для цього контенту і виявляє, що ваш пристрій передає його. CENO отримує вашу інтернет-адресу з індексу, підключається до нього і запитує контент, як це показано нижче.

source: Now that second device also holds a copy of content *X*, so it announces this in the distributed cache index, thus becoming a seeder. If a third person interested in that content uses the CENO Browser to retrieve it, CENO will now see *two* addresses in the index for the content: your device's and that of the second user. If the content is heavy (e.g. a video), this third device may try to get half of it from each of the other devices (as shown below), thus speeding up the download and reducing the traffic they use.
es: Ahora que un segundo dispositivo también tiene una copia del contenido *X*, anuncia esto en el índice de la caché distribuida, transformándose entonces en un sembrador. Si una tercera persona interesada en ese contenido usa al Navegador CENO para descargarlo, CENO ahora verá *dos* direcciones en el índice para el contenido: tu dispositivo y el del segundo usuario. Si el contenido es pesado (ej.: un vídeo), este tercer dispositivo podría intentar obtener la mitad del mismo desde cada uno de los otros dispositivos (como se muestra abajo), acelerando entonces la descarga y reduciendo el tráfico que usan.
ru: Теперь второе устройство также имеет копию контента *X*, поэтому оно объявляет об этом в индексе распределенного кэша, становясь таким образом раздающим. Если третье лицо, заинтересованное в этом контенте, использует Браузер CENO для его получения, CENO теперь будет видеть *два* адреса в индексе для контента: адрес вашего устройства и адрес второго пользователя. Если контент тяжелый (например, видео), это третье устройство может попытаться получить его половину с каждого из других устройств (как показано ниже), тем самым ускоряя загрузку и уменьшая используемый ими трафик.
uk: Тепер другий пристрій також має копію контенту *X*, тому він оголошує про це в індексі розподіленого кешу, ставши тим, що роздає. Якщо третя особа, зацікавлена в цьому контенті, використовує браузер CENO для його отримання, CENO тепер буде бачити *дві* адреси в індексі для контенту: адресу вашого пристрою та адресу другого користувача. Якщо контент важкий (наприклад, відео), цей третій пристрій може спробувати отримати його половину з кожного з інших пристроїв (як показано нижче), тим самим прискорюючи завантаження і зменшуючи трафік, що використовується.

source: Finally, the situation may get even worse, and all commercial and state network infrastructure may be shut down. In this case, Ouinet and the CENO Browser also have some support for *device-to-device* sharing of content between two clients sitting on the same local network (e.g. connected to the same Wi-Fi access point), even if the network has no access to others.
es: Finalmente, la situación podría tornarse aún peor, y toda la infraestructura de red comercial y estatal podría apagarse. En este caso, Ouinet y el Navegador CENO también tienen algún soporte para compartición de contenido de *dispositivo a dispositivo* entre dos clientes que están en la misma red local (ej.: conectados al mismo punto de acceso Wi-Fi), aún si la red no tiene acceso a otras.
ru: Наконец, ситуация может стать еще хуже, и вся коммерческая и государственная сетевая инфраструктура может быть отключена. В этом случае Ouinet и CENO Browser также поддерживают обмен контентом между двумя клиентами, находящимися в одной локальной сети (например, подключенными к одной точке доступа Wi-Fi), даже если эта сеть не имеет доступа к другим.
uk: Зрештою, ситуація може погіршитися, і всю комерційну та державну мережеву інфраструктуру відключають. У цьому випадку Ouinet та браузер CENO також підтримують обмін контентом між двома клієнтами, що перебувають в одній локальній мережі (наприклад, підключені до однієї точки доступу Wi-Fi), навіть якщо ця мережа не має доступу до інших мереж.

source: In any Web browser, to access content *X* it needs to know its [Uniform Resource Locator](https://en.wikipedia.org/wiki/Uniform_Resource_Locator) (URL), that is the address in the browser's location bar, e.g. `https://example.com/foo/x`. From that URL, a normal browser would infer that it has to contact the Web server called `example.com` using the HTTP protocol (the language used to exchange Web resources) over SSL/TLS (a security layer over TCP, the Internet's rules for programs to talk to each other) and request the resource `/foo/x`.
es: Cualquier navegador Web, para acceder al contenido *X*, ncesita conocer su [Localizador uniforme de recursos](https://es.wikipedia.org/wiki/Localizador_de_recursos_uniforme) (URL), que es la dirección en la barra de direcciones del navegador, ej.: `https://example.com/foo/x`. A partir de ese URL, un navegador normal inferiría que tiene que contactar al servidor Web llamado `example.com` usando el protocolo HTTP (el idioma usado para intercambiar recursos Web) sobre SSL/TLS (una capa de seguridad sobre TCP, las reglas de Internet para que los programas se comuniquen unos con otros), y solicitar el recurso `/foo/x`.

source: **Technical note:** One way the index is implemented is using [BitTorrent](https://en.wikipedia.org/wiki/BitTorrent)'s [Distributed Hash Table](https://en.wikipedia.org/wiki/Distributed_hash_table) (DHT) to get the addresses (IP and port) of the clients with the content. The DHT uses a [Cryptographic hash function](https://en.wikipedia.org/wiki/Cryptographic_hash_function) to compute the table key from the content's URL and some other parameters as the injector key (see below), so that several indexes can coexist.
es: **Nota técnica:** Una manera en que es implementado el índice es usando la [Tabla de hash distribuida](https://es.wikipedia.org/wiki/Tabla_de_hash_distribuida) (DHT) de [BitTorrent](https://es.wikipedia.org/wiki/BitTorrent) para obtener las direcciones (IP y puerto) de los clientes con el contenido. La DHT usa una [Función hash criptográfica](https://es.wikipedia.org/wiki/Funci%C3%B3n_hash_criptogr%C3%A1fica) para computar la clave de la tabla a partir del URL del contenido, y algunos otros parámetros como la clave del inyector (mirar abajo), por lo que varios índices pueden coexistir.
