Repository: censorship-no/ceno-docs
Catalog: user-manual/*/concepts/how.po
Languages: ar, de, es, fa, fr, my, pt_br, ru, tr, uk, ur

source: Let us imagine that after you retrieved content *X* from the injector, a disaster leaves your region isolated from the world. It turns out that content *X* becomes especially relevant since it describes some ways in which you can help your community in such a situation.
ar: دعونا نتخيل أنه بعد استرداد المحتوى *X* من الحاقن، تحدث كارثة تجعل منطقتك معزولة عن العالم. يتضح أن المحتوى *X* أصبح ذا صلة خاصة أنه يصف بعض الطرق التي يمكنك من خلالها مساعدة مجتمعك في مثل هذه الحالة.
es: Imaginémonos que después de que descargaste el contenido *X* desde el inyector, un desastre deja a tu región aislada del mundo. Resulta que el contenido *X* se vuelve especialmente relevante, ya que describe algunas maneras en las cuales puedes ayudar a tu comunidad en tal situación.
fa: بیایید تصور کنیم که پس از آن‌که شما محتوای *X* را از injector بازیابی کردید، فاجعه‌ای محل سکونت شما را از باقی دنیا جدا می‌سازد. معلوم می‌شود که محتوای *X* به‌طور خاص مربوط و بااهمیت می‌شود چون راه‌هایی را وصف می‌کند که از طریق آن‌ها می‌توانید به اجتماع‌تان در چنین وضعیتی یاری رسانید.
fr: Imaginons qu'après avoir récupéré le contenu *X* de l'injecteur, une catastrophe laisse votre région isolée du monde. Il s'avère que le contenu *X* devient particulièrement pertinent puisqu'il décrit certaines façons dont vous pouvez aider votre communauté dans une telle situation.
pt_br: Imaginemos que, depois de você recuperar o conteúdo *X* do injetor, um desastre deixa a sua região isolada do mundo. Acontece que o conteúdo *X* se torna especialmente relevante, pois ele descreve algumas formas pelas quais você pode ajudar a sua comunidade em situações como essa.
ru: Представим, что после того, как вы извлекли контент *X* из инъектора, в результате стихийного бедствия ваш регион оказывается изолированным от всего мира. Оказывается, что контент *X* становится особенно актуальным, поскольку он описывает некоторые способы, которыми вы можете помочь своему сообществу в такой ситуации.
tr: Varsayalım ki içerik ekleyiciden *X* içeriğini aldıktan sonra bir afet bölgenizi dünyadan kopardı. *X* içeriği böyle bir durumda toplumunuza nasıl yardımcı olabileceğinizi anlattığı için daha önemli hale gelir.
uk: Уявимо, що після того, як ви витягли контент *X* з ін'єктора, внаслідок стихійного лиха ваш регіон опиняється ізольованим від решти світу. Виявляється, що контент *X* стає особливо актуальним, оскільки він описує деякі способи, якими ви можете допомогти вашій спільноті в такій ситуації.
ur: آئیے تصور کریں کہ آپ کے انجیکٹر سے مواد *X* بازیافت کرنے کے بعد، ایک آفت آپ کے علاقے کو دنیا سے الگ کر دیتی ہے۔ اس سے پتہ چلتا ہے کہ مواد *X* خاص طور پر متعلقہ ہو جاتا ہے کیونکہ یہ کچھ ایسے طریقوں کی وضاحت کرتا ہے جن سے آپ ایسی صورتحال میں اپنی کمیونٹی کی مدد کر سکتے ہیں۔

source: At that moment a second person using Ceno Browser also tries to get that content. Access to the origin server or to anything beyond your region is impossible, so Ceno checks the distributed cache index for that content and it finds that your device is seeding it. Ceno gets your Internet address from the index, connects to it and requests the content as shown below.
ar: في تلك اللحظة، يحاول شخص آخر يستخدم متصفح Ceno أيضًا الحصول على هذا المحتوى. بعد الكارثة، يعدّ الوصول إلى الخادم الأصلي أو أي شيء خارج المنطقة الجغرافية المحلية أمرًا مستحيلًا، لذلك يتحقق Ceno من فهرس ذاكرة التخزين المؤقت الموزعة لهذا المحتوى ويكتشف أن جهازك يقوم بتوزيعه. يحصل Ceno على عنوان الإنترنت الخاص بك من الفهرس، ويتصل به ويطلب المحتوى كما هو موضح أدناه.
ur: اس وقت CENO براؤزر استعمال کرنے والا دوسرا شخص بھی اس مواد کو حاصل کرنے کی کوشش کرتا ہے۔ اصل سرور تک یا آپ کے علاقے سے باہر کسی بھی چیز تک رسائی ناممکن ہے، لہذا CENO اس مواد کے لیے تقسیم شدہ کیش انڈیکس کو چیک کرتا ہے اور اسے پتہ چلتا ہے کہ آپ کا ڈیوائس اسے سیڈ کر رہا ہے۔

source: ![Figure: Client receives signed content from client](images/user-flow-4.svg)
ar: ![الشكل: يتلقى العميل محتوى موقّعًا من العميل](images/user-flow-4.svg)
es: ![Figura: El cliente recibe contenido firmado desde otro cliente](images/user-flow-4.svg)
fa: ![شکل: سرویس‌گیرنده محتوای امضاشده را از سرویس‌گیرنده می‌گیرد](images/user-flow-4.svg)
fr: ![Figure : Le client reçoit le contenu signé du client](images/user-flow-4.svg)
pt_br: ![Figura: Cliente recebe conteúdo assinado de cliente](images/user-flow-4.svg)
ru: ![Рисунок: Клиент получает подписанный контент от клиента](images/user-flow-4.svg)
tr: ![Görsel: İstemci başka bir istemciden imzalanmış içerik alıyor](images/user-flow-4.svg)
uk: ![Малюнок: Клієнт отримує підписаний контент від клієнта](images/user-flow-4.svg)
ur: ![تصویر: کلائنٹ کو کلائنٹ سے دستخط شدہ مواد موصول ہوتا ہے](images/user-flow-4.svg)

source: Now that second device also holds a copy of content *X*, so it announces this in the distributed cache index, thus becoming a seeder. If a third person interested in that content uses Ceno Browser to retrieve it, Ceno will now see *two* addresses in the index for the content: your device's and that of the second user. If the content is heavy (e.g. a video), this third device may try to get half of it from each of the other devices (as shown below), thus speeding up the download and reducing the traffic they use.
ar: الآن يحتفظ الجهاز الثاني أيضًا بنسخة من المحتوى *X*، لذلك يعلن هذا في فهرس ذاكرة التخزين المؤقت الموزعة، وبالتالي يصبح موزعًا. إن كان هناك شخص ثالث يستخدم متصفح Ceno ومهتم باستعادة هذا المحتوى، فسوف يرى Ceno الآن عنوانين *إثنين* في فهرس المحتوى: عنوان جهازك وعنوان جهاز المستخدم الثاني. إن كان المحتوى ثقيلًا (مثل مقطع فيديو)، فقد يحاول هذا الجهاز الثالث الحصول على نصفه من كل جهاز (كما هو موضح أدناه)، وبالتالي يتم تسريع التنزيل وتقليل حركة مرور البيانات.
ur: اب اس دوسرے ڈیوائس میں مواد *X* کی ایک کاپی بھی ہے، لہذا یہ تقسیم شدہ کیش انڈیکس میں اس کا اعلان کرتا ہے، اس طرح سیڈر بن جاتا ہے۔ اگر اس مواد میں دلچسپی رکھنے والا کوئی تیسرا فرد اسے بازیافت کرنے کے لیے CENO براؤزر کا استعمال کرتا ہے، تو CENO اب مواد کے انڈیکس میں *دو* پتے دیکھے گا: آپ کے ڈیوائس کے اور دوسرے صارف کے۔ اگر مواد بھاری ہے (مثال کے طور پر ایک ویڈیو)، تو یہ تیسرا ڈیوائس دوسرے ڈیوائسز میں سے آدھا حصہ حاصل کرنے کی کوشش کر سکتا ہے (جیسا کہ نیچے دکھایا گیا ہے)، اس طرح ڈاؤن لوڈ کو تیز کرتا ہے اور ان کے استعمال کردہ ٹریفک کو کم کرتا ہے۔

source: ![Figure: Client receives signed content from multiple clients](images/user-flow-5.svg)
ar: ![الشكل: يتلقى العميل محتوى موقعًا من عدة عملاء](images/user-flow-5.svg)
de: ![Abbildung: Client empfängt signierte Inhalte von mehreren Clients](images/user-flow-5.svg)
es: ![Figura: El cliente recibe contenido firmado desde múltiples clientes](images/user-flow-5.svg)
fa: ![شکل: سرویس‌گیرنده محتوای امضاشده را از سرویس‌گیرندگان متعدد دریافت می‌کند](images/user-flow-5.svg)
fr: ![Figure : Le client reçoit du contenu signé de plusieurs clients](images/user-flow-5.svg)
pt_br: ![Figura: Cliente recebe conteúdo assinado de múltiplos clientes](images/user-flow-5.svg)
ru: ![Рисунок: Клиент получает подписанный контент от нескольких клиентов](images/user-flow-5.svg)
tr: ![Görsel: İstemci imzalanan içeriği birden fazla istemciden alıyor](images/user-flow-5.svg)
uk: ![Малюнок: Клієнт отримує підписаний контент від кількох клієнтів](images/user-flow-5.svg)
ur: ![تصویر: کلائنٹ کو متعدد کلائنٹس سے دستخط شدہ مواد موصول ہوتا ہے](images/user-flow-5.svg)

source: Finally, the situation may get even worse, and all commercial and state network infrastructure may be shut down. In this case, Ouinet and Ceno Browser also have some support for *device-to-device* sharing of content between two clients sitting on the same local network (e.g. connected to the same Wi-Fi access point), even if the network has no access to others.
ar: أخيرًا، قد يزداد الوضع سوءًا، وقد يتم إغلاق البنية التحتية للشبكات التجارية والحكومية كلها. في هذه الحالة، يتمتع Ouinet و متصفح Ceno أيضًا بدعم مشاركة المحتوى من *جهاز إلى جهاز* بين عميلين على نفس الشبكة المحلية (على سبيل المثال، متصلان بنفس نقطة وصول Wi-Fi)، حتى لو لم تتمكن الشبكة من الوصول إلى الآخرين خارج شبكة الـ LAN المحلية.
ur: آخر کار، صورت حال اور بھی خراب ہو سکتی ہے، اور تمام تجارتی اور ریاستی نیٹ ورک کا بنیادی ڈھانچہ بند ہو سکتا ہے۔ اس صورت میں، Ouinet اور CENO براؤزر کو ایک ہی مقامی نیٹ ورک پر بیٹھے دو کلائنٹس کے درمیان مواد کی *ڈیوائس ٹو ڈیوائس* شیئرنگ کے لیے کچھ سپورٹ بھی حاصل ہے (مثلاً ایک ہی Wi-Fi رسائی پوائنٹ سے منسلک)، چاہے نیٹ ورک کے پاس دوسروں تک رسائی موجود نہیں ہے.

source: [Uniform Resource Locator]: https://en.wikipedia.org/wiki/Uniform_Resource_Locator
ar: [محدد موقع الموارد الموحد]: https://ar.wikipedia.org/wiki/%D9%85%D8%AD%D8%AF%D8%AF_%D9%85%D9%88%D9%82%D8%B9_%D8%A7%D9%84%D9%85%D9%88%D8%A7%D8%B1%D8%AF_%D8%A7%D9%84%D9%85%D9%88%D8%AD%D8%AF
fr: [Uniform Resource Locator] : https://en.wikipedia.org/wiki/Uniform_Resource_Locato
my: [ကွဲလွဲခြင်းမရှိသော ရင်းမြစ် တည်နေရာရှာစနစ်]: https://en.wikipedia.org/wiki/Uniform_Resource_Locator
pt_br: [Localizador Uniforme de Recursos]: https://pt.wikipedia.org/wiki/URL
ru: [Унифицированный указатель ресурса]: https://ru.wikipedia.org/wiki/URL
tr: [Uniform Resource Locator]: https://tr.wikipedia.org/wiki/URL
uk: [Уніфікований локатор ресурсу]: https://uk.wikipedia.org/wiki/Уніфікований_локатор_ресурсів
ur: [یونیفارم ریسورس لوکیٹر]: https://en.wikipedia.org/wiki/Uniform_Resource_Locator

source: [Cryptographic hash function]: https://en.wikipedia.org/wiki/Cryptographic_hash_function
ar: [دالة التجزءة المعماة]: https://ar.wikipedia.org/wiki/%D8%AF%D8%A7%D9%84%D8%A9_%D8%AA%D9%84%D8%A8%D9%8A%D8%AF_%D9%85%D8%B9%D9%85%D9%89
fr: [Fonction de hachage cryptographique]: https://en.wikipedia.org/wiki/Cryptographic_hash_function
pt_br: [Função criptográfica hash]: https://pt.wikipedia.org/wiki/Fun%C3%A7%C3%A3o_hash_criptogr%C3%A1fica
ru: [криптографическую хеш-функцию]: https://ru.wikipedia.org/wiki/%D0%9A%D1%80%D0%B8%D0%BF%D1%82%D0%BE%D0%B3%D1%80%D0%B0%D1%84%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B0%D1%8F_%D1%85%D0%B5%D1%88-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F
tr: [Cryptographic hash function]: https://tr.wikipedia.org/wiki/Kriptografik_%C3%B6zet_fonksiyonu
uk: [Криптографічну хеш-функцію]: https://uk.wikipedia.org/wiki/Криптографічна_геш-функція
ur: [کرپٹوگرافک ہیش فنکشن]: https://en.wikipedia.org/wiki/Cryptographic_hash_function

source: [BitTorrent]: https://en.wikipedia.org/wiki/BitTorrent
ar: [بت تورنت]: https://ar.wikipedia.org/wiki/%D8%A8%D8%AA_%D8%AA%D9%88%D8%B1%D9%86%D8%AA
pt_br: [BitTorrent]: https://pt.wikipedia.org/wiki/BitTorrent
ru: [протокола BitTorrent]: https://ru.wikipedia.org/wiki/BitTorrent_(%D0%BF%D1%80%D0%BE%D1%82%D0%BE%D0%BA%D0%BE%D0%BB)
tr: [BitTorrent]: https://tr.wikipedia.org/wiki/BitTorrent
uk: [протоколу BitTorrent]: https://uk.wikipedia.org/wiki/BitTorrent_(протокол)

source: [Distributed Hash Table]: https://en.wikipedia.org/wiki/Distributed_hash_table
ar: [جدول التجزئة الموزّع]: https://en.wikipedia.org/wiki/Distributed_hash_table
fr: [Table de hachage distribuée]: https://en.wikipedia.org/wiki/Distributed_hash_table
pt_br: [Tabela Hash Distribuída]: https://pt.wikipedia.org/wiki/Distributed_hash_table
ru: [распределённой хэш-таблицы]: https://ru.wikipedia.org/wiki/%D0%A0%D0%B0%D1%81%D0%BF%D1%80%D0%B5%D0%B4%D0%B5%D0%BB%D1%91%D0%BD%D0%BD%D0%B0%D1%8F_%D1%85%D0%B5%D1%88-%D1%82%D0%B0%D0%B1%D0%BB%D0%B8%D1%86%D0%B0
tr: [Distributed Hash Table]: https://tr.wikipedia.org/wiki/Da%C4%9F%C4%B1t%C4%B1lm%C4%B1%C5%9F_Hash_Tablosu
uk: [розподіленої хеш-таблиці]: https://uk.wikipedia.org/wiki/Розподілена_геш-таблиця
ur: [تقسیم شدہ ہیش ٹیبل]: https://en.wikipedia.org/wiki/Distributed_hash_table

source: This section will explain CENO and Ouinet operation by going over a series of scenarios. Terminology and concepts important to Ouinet will be introduced (highlighted **in bold letters**) and used afterwards for efficiency and to avoid confusion.
de: In diesem Abschnitt wird die Funktionsweise von CENO und Ouinet anhand einer Reihe von Szenarien erläutert. Begriffe und Konzepte, die für Ouinet wichtig sind, werden eingeführt (hervorgehoben **fettgedruckt**) und anschließend aus Gründen der Effizienz und zur Vermeidung von Verwechslungen verwendet.
es: Esta sección explicará la operación de CENO y Ouinet recorriendo una serie de escenarios. La terminología y los conceptos importantes para Ouinet serán introducidos (resaltados **en negrita**) y usados con posterioridad, por razones de eficiencia y para evitar confusiones.
fa: در این بخش کارکرد CENO و Ouinet را با مرور چندین سناریو توضیح خواهیم داد. واژگان و مفاهیم مهم مربوط به Ouinet معرفی خواهند شد (که با **حروف برجسته** بر آن‌ها تأکید می‌شود) و سپس برای کارآیی و جلوگیری از ابهام و سردرگمی به کار خواهند رفت.
fr: Cette section explique le fonctionnement de CENO et Ouinet en passant en revue une série de scénarios. La terminologie et les concepts importants de Ouinet seront ensuite présentés (mis en évidence **en caractères gras**) et utilisés pour plus d'efficacité et pour éviter toute confusion.
my: ဤအပိုင်းတွင် အခြေအနေများကို စီးရီးလိုက် ကြည့်ခြင်းဖြင့် CENO နှင့် Ouinet ၏ လုပ်ဆောင်ချက်ကို ရှင်းပြပါမည်။ Ouinet အတွက် အရေးကြီးသော ဝေါဟာရများနှင့် အယူအဆများကို မိတ်ဆက်မည် (**စာလုံးအမဲများဖြင့်** အသားပေး ဖော်ပြထားသည်) ဖြစ်ပြီး ထိရောက်မှုရှိရန်နှင့် ရောထွေးမှုကို ရှောင်ရှားရန် နောက်ပိုင်းတွင် အသုံးပြုပါမည်။
pt_br: Esta seção explicará as operaçãos do CENO e da Ouinet percorrendo uma série de cenários. Terminologias e conceitos importantes para a Ouinet serão introduzidos (destacados **com letras em negrito**) e usados posteriormente para garantir eficiência e para evitar confusões.
ru: В этом разделе мы объясним работу CENO и Ouinet, рассмотрев ряд сценариев. Терминология и понятия, важные для Ouinet, будут введены (выделены **жирными буквами**) и использованы в дальнейшем для эффективности и во избежание путаницы.
uk: У цьому розділі ми пояснимо роботу CENO та Ouinet, розглянувши кілька сценаріїв. Термінологія та поняття, важливі для Ouinet, будуть наведені (позначені **жирними літерами**) та використані надалі для ефективності та уникнення плутанини.

source: CENO Browser is an example of an application that uses Ouinet technology to retrieve and share Web content. We call such an application a Ouinet **client**. When you use your client (i.e. CENO) to try to access some content *X*, hosted on a Web server (which we will call *X*'s **origin** server), your client tries to contact the origin server over the Internet either directly or via some other machine configured to contact Web servers on behalf of others (a so-called **proxy** server) and then requests the desired content. This is no different from the way in which any normal Web browser works.
de: CENO Browser ist ein Beispiel für eine Anwendung, die die Ouinet-Technologie zum Abrufen und Freigeben von Webinhalten nutzt. Wir nennen eine solche Anwendung einen Ouinet **Client**. Wenn Sie mit Ihrem Client (d. h. CENO) versuchen, auf einen Inhalt *X* zuzugreifen, der auf einem Webserver gehostet wird (den wir als **Herkunftsserver** von *X* bezeichnen), versucht Ihr Client, den Herkunftsserver über das Internet zu kontaktieren, entweder direkt oder über einen anderen Rechner, der so konfiguriert ist, dass er Webserver im Namen anderer kontaktiert (ein so genannter **Proxy**-Server), und fordert dann den gewünschten Inhalt an. Dies unterscheidet sich nicht von der Funktionsweise eines normalen Webbrowsers.
fr: Le navigateur CENO est un exemple d'application qui utilise la technologie Ouinet pour récupérer et partager du contenu web. Nous appelons cette application un **client** Ouinet. Lorsque vous utilisez votre client (CENO) pour essayer d'accéder à du contenu *X*, hébergé sur un serveur web (que nous appellerons serveur d'**origine** de *X*), votre client essaie de contacter le serveur d'origine sur Internet, soit directement, soit via une autre machine configurée pour contacter des serveurs web au nom d'autrui (un serveur dit **proxy**), puis demande le contenu souhaité. Ce processus n'est pas différent du fonctionnement d'un navigateur web classique.
pt_br: O Navegador CENO é um exemplo de uma aplicação que usa a tecnologia Ouinet para recuperar e compartilhar conteúdo Web. Chamamos tal tipo de aplicação um **cliente** da Ouinet. Quando você usa seu cliente (isto é, CENO) para tentar acessar algum conteúdo *X*, hospedado em um servidor Web (o qual chamaremos de servidor de **origem** de *X*), seu cliente tenta contatar o servidor de origem através da Internet, seja diretamente ou via alguma outra máquina configurada para contatar servidores Web em nome de outros (o chamado servidor **proxy**) e então solicita o conteúdo desejado. Isso não é diferente da forma como qualquer navegador Web comum funciona.

source: **Technical note:** There is in fact one small gotcha. Since the client acts as an HTTP proxy running on your device, for the client to be able to decrypt and act upon HTTPS content requests, the application using the client (i.e. the Web browser part – like Firefox in CENO) needs to accept a special certificate issued by the client itself (and only used on your device). CENO Browser already takes care of setting this certificate up for its private use so that you do not need to worry.
de: **Technische Anmerkung:** Es gibt tatsächlich ein kleines Problem. Da der Client als HTTP-Proxy auf Ihrem Gerät läuft, muss die Anwendung, die den Client verwendet (d. h. der Webbrowser-Teil - wie Firefox in CENO), ein spezielles Zertifikat akzeptieren, das vom Client selbst ausgestellt wurde (und nur auf Ihrem Gerät verwendet wird), damit der Client HTTPS-Inhaltsanfragen entschlüsseln und bearbeiten kann. CENO Browser kümmert sich bereits um die Einrichtung dieses Zertifikats für seine private Nutzung, so dass Sie sich keine Sorgen machen müssen.
fr: **Note technique :** Il existe en réalité un petit piège. Étant donné que le client agit comme un proxy HTTP fonctionnant sur votre appareil, pour que le client puisse décrypter et agir sur les demandes de contenu HTTPS, l'application utilisant le client (c'est-à-dire la partie navigateur web – comme Firefox dans CENO) doit accepter un certificat spécial émis par le client lui-même (et uniquement utilisé sur votre appareil). Le navigateur CENO se charge déjà de configurer ce certificat pour son usage privé, de sorte que vous n'ayez pas à vous en inquiéter.
pt_br: **Nota técnica:** Há, de fato, uma pequena pegadinha. Já que o cliente age como um proxy HTTP sendo executado em seu dispositivo, para o cliente ser capaz de decodificar e atuar sobre solicitações de conteúdo HTTPS, a aplicação usando o cliente (isto é, a parte do navegador Web - como Firefox no CENO), precisa aceitar um certificado especial emitido pelo próprio cliente (e apenas usado no seu dispositivo). O Navegador CENO já se responsabiliza por estruturar esse certificado para seu uso privado de maneira que você não precisa de preocupar.

source: Also, CENO Browser does not announce the URL of every single resource it holds: with any modern page having tens or hundreds of components (images, style sheets, scripts…), that would create a lot of traffic. Instead, resources are grouped under the URL of the page pulling them, and only that URL is announced. This is done with the help of an *ad hoc* browser extension (described later on).
de: Außerdem gibt CENO Browser nicht die URL jeder einzelnen Ressource bekannt: Bei einer modernen Seite mit Dutzenden oder Hunderten von Komponenten (Bilder, Stylesheets, Skripte...) würde das eine Menge Datenverkehr verursachen. Stattdessen werden die Ressourcen unter der URL der Seite gruppiert, die sie aufruft, und nur diese URL wird bekannt gegeben. Dies geschieht mit Hilfe einer *ad hoc* Browsererweiterung (die später beschrieben wird).
fr: De plus, le navigateur CENO ne communique pas l'URL de chaque ressource qu'il détient : étant donné que toute page moderne possède des dizaines, voire des centaines de composants (images, feuilles de style, scripts...), le trafic en serait trop encombré. C'est pourquoi les ressources sont regroupées sous l'URL de la page qui les contient, et seule cette URL est communiquée. Ceci est réalisé grâce à une extension *ad hoc* du navigateur (décrite plus loin).
pt_br: O Navegadro CENO, por sua vez, não anuncia a URL de cada recurso que detém: como qualquer página moderna tem dezenas de milhares de componentes (imagens, fichas de estilo, scripts...), essa ação criaria uma grande quantidade de tráfego. Em vez disso, os recursos são agrupados sob a URL da página que faz referência a eles, e somente aquela URL é anunciada. Isso é feito com a ajuda de uma extensão *ad hoc* do navegador (descrito mais à frente).

source: By the way, injector certificates are shipped in CENO Browser, allowing it to detect attackers trying to impersonate injectors.
de: Übrigens: Injektor-Zertifikate werden in CENO Browser mitgeliefert, so dass Angreifer, die versuchen, sich als Injektoren auszugeben, erkannt werden können.
fr: Soit dit en passant, les certificats d'injecteur sont livrés dans le navigateur CENO, ce qui lui permet de détecter les attaquants essayant d'usurper l'identité des injecteurs.
pt_br: A propósito, os certificados do injetor são entregues no Navegador CENO, permitindo a este detectar atacantes que tentam se passar por injetores.

source: An injector can behave like a normal (though extra available) proxy server, and this is indeed what Ouinet clients (including CENO Browser) do currently when trying to access content over a proxy. In this case, the injector will neither see the actual information flowing between your client and the origin server (unless it is a plain, unencrypted HTTP connection itself).
fr: Un injecteur peut se comporter comme un serveur proxy normal (bien que disponible en supplément), et c'est en effet ce que font actuellement les clients Ouinet (y compris le navigateur CENO) lorsqu'ils tentent d'accéder à du contenu via un proxy. Dans ce cas, l'injecteur ne verra pas les informations réelles circulant entre votre client et le serveur d'origine (à moins qu'il ne s'agisse d'une connexion HTTP simple et non chiffrée).
pt_br: Um injetor pode se comportar como um servidor proxy normal (apesar de extra-disponível), e esse comportamento é de fato o que clientes Ouinet (incluindo o Navegador CENO) fazem corriqueiramente ao tentar acessar conteúdo através de um proxy. Nesse caso, o injetor não verá a informação verdadeira circulando entre o seu cliente e o servidor de origem (a menos que seja ela mesma uma consexão HTTP simples, não criptografada).
