Repository: censorship-no/ceno-docs
Catalog: user-manual/*/concepts/public-private.po
Languages: ar, es, fa, fr, my, pt_br, ru, tr, uk, ur

source: Public vs. private browsing
ar: التصفح العام مقابل التصفح الخاص
fa: مقایسه‌ی مرور عمومی و مرور خصوصی
fr: Navigation publique/privée
my: အများသုံးနှင့် သီးသန့် ရှာဖွေမှု
tr: Herkese açık ve gizli gezinme karşılaştırması
uk: Публічний чи приватний перегляд

source: Because of the many techniques used to overcome connectivity issues, Ceno may become a convenient way for you to get all kinds of Web content. And, as you may have already read in previous sections, whenever you retrieve and seed a page using Ceno Browser, it becomes available to others. There may be some content, however, that you do not wish to share (or you do not want to let others know that you are trying to or did retrieve), and fortunately Ceno can help you in this instance as well.
ar: بفضل استخدامه لعدة تقنيات للتغلب على مشاكل الاتصال، قد يشكل Ceno طريقة ملائمة لك للحصول على جميع أنواع محتوى الويب. وكما قد تكون قرأت بالفعل في الأقسام السابقة، كلما استرجعت صفحة ووزعتها باستخدام متصفح Ceno، تصبح متاحة للآخرين. ومع ذلك، قد يكون هناك محتوى ما لا ترغب في مشاركته (أو لا تريد السماح للآخرين بمعرفة أنك تحاول استرداده أو تصفحته بالفعل)، لحسن الحظ يمكن لـ Ceno أن يساعدك في هذه الحالة أيضًا.
es: Debido a las muchas técnicas usadas para superar a las dificultades de conectividad, Ceno podría tornarse para tí en una manera conveniente de obtener todas clases de contenido Web. Y, como podrías ya haber leído en secciones previas, cada vez que descargues y siembres una página usando el Navegador Ceno, se hace disponible para otra(o)s. Podría haber algún contenido, sin embargo, que no deseas compartir (o no quieres dejar que otra(o)s sepan que estás intentando descargar o que ya descargaste), y afortunadamente Ceno también puede ayudarte en esta instancia.
pt_br: Devido às muitas técnicas usadas para superar problemas de conectividade, o Ceno pode se tornar uma forma conveniente de obter vários tipos de conteúdo Web. E, como você pode já ter lido em seções anteriores, a qualquer momento em que você recupera e semeia uma página usando o Navegador Ceno, ela fica disponível para outras pessoas. Pode haver, contudo, algum conteúdo que você não deseja compartilhar (ou não quer deixar outras pessoas saberem que está tentando recuperar ou recuperou). Felizmente, o Ceno também pode ajudar você nesse aspecto.
ru: Благодаря множеству методов, используемых для преодоления проблем с подключением, Ceno может стать для вас удобным способом получения всевозможного веб-контента. И, как вы, возможно, уже читали в предыдущих разделах, каждый раз, когда вы получаете и передаете страницу с помощью Браузера Ceno, она становится доступной для других. В то же время, есть контент, которым вы не хотели бы делиться (или не хотели бы, чтобы другие знали, что вы пытаетесь получить к нему доступ), и, к счастью, Ceno может помочь вам и в этом случае.
tr: Bağlantı sorunlarının üstesinden gelmek için kullanılan birçok yöntemden dolayı Ceno, istediğiniz internet içeriğine erişmeniz için uygun bir yol olabilir. Ceno Browser kullanarak bir sayfaya eriştiğinizde ya da gönderdiğinizde, sayfa başkaları tarafından da kullanılabilir olur. Göndermek istemediğiniz (ya da eriştiğinizi başkalarının bilmesini istemediğiniz) bazı içerikler olabilir. Ceno bu durumlarda da size de yardımcı olabilir.
ur: رابطے کے مسائل پر قابو پانے کے لیے استعمال کی جانے والی بہت سی تکنیکوں کی وجہ سے، Ceno آپ کے لیے ہر قسم کا ویب مواد حاصل کرنے کا ایک آسان طریقہ بن سکتا ہے۔ اور، جیسا کہ آپ نے پہلے ہی پچھلے حصوں میں پڑھا ہوگا، جب بھی آپ Ceno براؤزر کا استعمال کرتے ہوئے کسی صفحہ کو بازیافت اور سیڈ کرتے ہیں، تو یہ دوسروں کے لیے دستیاب ہوجاتا ہے۔ تاہم، کچھ مواد ہو سکتا ہے جسے آپ شیئر نہیں کرنا چاہتے (یا آپ دوسروں کو یہ نہیں بتانا چاہتے کہ آپ اسے حاصل کرنے کی کوشش کر رہے ہیں یا كى ہے )، اور خوش قسمتی سے Ceno اس معاملے میں بھی آپ کی مدد کر سکتا ہے۔

source: The default mode when you launch the application is **public browsing**. In it, Ceno accesses Web content as described previously:
ar: الوضع الافتراضي عند تشغيل التطبيق هو **التصفح العام**. يصل فيه Ceno إلى محتوى الويب كما هو موضح سابقًا:
tr: Uygulamayı açtığınızda varsayılan kip **herkese açık gezinme** olur. Ceno bu ağ içeriğine önceden açıklandığı gibi erişir:

source: Direct access is attempted.
ar: تمت محاولة الوصول المباشر.
es: Se intenta el acceso directo.
fa: تلاش برای دسترسی مستقیم صورت گرفته است.
fr: Tentative d'accès direct.
my: တိုက်ရိုက် ဝင်ရောက်သုံးစွဲရန် ကြိုးစားသည်။
pt_br: Tenta-se o acesso direto.
ru: Пытается получить доступ напрямую.
tr: Doğrudan erişim denenir.
uk: Намагається отримати прямий доступ.
ur: براہ راست رسائی کی کوشش کی جاتی ہے۔

source: Failing that, the distributed cache is searched.
ar: إذا تعذر ذلك، سيتم البحث في ذاكرة التخزين المؤقت الموزعة.
es: Fallando eso, se busca en la caché distribuída.
fa: در صورت ناکامی در آن، انبار توزیع‌شده جست‌وجو می‌شود.
fr: À défaut, une recherche est effectuée dans le cache distribué.
my: မအောင်မြင်သောအခါ ဖြန့်ချိထားသော ယာယီသိမ်းဆည်းထားသည့် မှတ်ဉာဏ်ကို ရှာသည်။
pt_br: Em caso de falha, procura-se o cache distribuído.
ru: Если не вышло, выполняется поиск в распределенном кэше.
tr: Başarısız olunursa, dağıtılmış ön bellek aranır.
uk: Якщо не вдалося, виконується пошук у розподіленому кеші.
ur: اس میں ناکام ہونے پر، تقسیم شدہ کیش کو تلاش کیا جاتا ہے۔

source: Failing that, the content is requested via an injector (maybe via another client).
ar: إذا تعذر ذلك، سيتم طلب المحتوى عبر حاقن (ربما عبر عميل آخر).
es: Fallando eso, el contenido es solicitado a través de un inyector (tal vez vía otro cliente).
fa: در صورت ناکامی در آن، محتوا از طریق یک تزریق‌کننده (شاید از طریق یک سرویس‌گیرنده‌ی دیگر) درخواست می‌شود.
fr: À défaut, le contenu est demandé via un injecteur (éventuellement via un autre client).
my: မအောင်မြင်သောအခါ အကြောင်းအရာကို ထိုးသွင်းဖိုင်မှတစ်ဆင့် တောင်းဆိုသည် (အခြားလက်ခံစက်မှတစ်ဆင့် ဖြစ်နိုင်သည်)။
pt_br: Em caso de falha, o conteúdo é requisitado através de um injetor (talvez via outro cliente).
ru: Если не вышло, содержимое запрашивается через инжектор (возможно, через другого пользователя).
tr: Başarısız olunursa, içerik bir ekleyiciden (ya da başka bir istemciden) istenir.
uk: Якщо не вдалося, вміст запитується через інʼєктор (можливо через іншого користувача).
ur: اس میں ناکام ہونے پر، مواد کی درخواست ایک انجیکٹر کے ذریعے کی جاتی ہے (شاید کسی دوسرے کلائنٹ کے ذریعے)۔

source: Ceno also has a **private browsing** mode. In it, the distributed cache is never searched, and injection is never attempted:
ar: يحتوي Ceno أيضا على وضع **التصفح الخاص**. لا يتم البحث فيه في ذاكرة التخزين المؤقت الموزعة مطلقا، ولا تتم محاولة الحقن أبدا:
tr: Ceno aynı zamanda **gizli gezinme** kipinde de kullanılabilir. Bu gezinme türünde paylaşılan ön bellek asla aranmaz ve içerik ekleme girişiminde bulunulmaz:

source: Failing that, an injector is contacted (maybe via another client) and used *as a normal proxy server*. Note that in this case, neither the injector nor your client updates the distributed cache with your page.
ar: إذا تعذر ذلك، يتم الاتصال بحاقن (ربما عبر عميل آخر) واستخدامه *كوكيل خادم عادي*. لاحظ أنه في هذه الحالة، لا يقوم الحاقن ولا العميل بتحديث ذاكرة التخزين المؤقت الموزعة بصفحتك.
es: Si eso falla, un inyector es contactado (quizás a través de otro cliente) y usado *como servidor proxy normal*. Nota que en este caso, ni el inyector ni tu cliente actualizan a la caché distribuída con tu página.
fa: در صورت ناکامی در آن، با یک تزریق‌کننده تماس گرفته می‌شود (شاید از طریق یک سرویس‌گیرنده‌ی دیگر) و **به‌عنوان یک سرور پروکسی معمولی** به کار می‌رود. دقت کنید که در این مورد، نه تزریق‌کننده و نه سرویس‌گیرنده‌ی شما انبار توزیع‌شده‌ی شما را با صفحه‌ی شما به‌روز نمی‌کنند.
fr: À défaut, un injecteur est contacté (éventuellement via un autre client) et utilisé *comme un serveur proxy normal*. Notez que dans ce cas, ni l'injecteur ni votre client ne mettent à jour le cache distribué avec votre page.
my: မအောင်မြင်သောအခါ ထိုးသွင်းဖိုင်ကို ဆက်သွယ်သည် (အခြားလက်ခံစက်မှတစ်ဆင့် ဖြစ်နိုင်သည်)၊ ပြီးလျှင် *ပုံမှန် ပရောက်စီ ဆာဗာအနေနှင့်* အသုံးပြုသည်။ ဤကိစ္စရပ်တွင် ဖြန့်ချိထားသော ယာယီသိမ်းဆည်းထားသည့် မှတ်ဉာဏ်ကို ထိုးသွင်းဖိုင်ရော သင့်လက်ခံစက်ကပါ သင့်စာမျက်နှာအတွက် အပ်ဒိတ်မလုပ်ကြောင်း သတိပြုပါ။
pt_br: Em caso de falha, um injetor é contatado (talvez via outro cliente) e usado *como um servidor proxy normal*. Note que, nesse caso, nem o injetor nem o seu cliente atualizam o cache distribuído com a sua página.
ru: Если не вышло, инъектор (возможно, через другого пользователя) используется *как обычный прокси-сервер*. Обратите внимание, что в этом случае ни инъектор, ни ваш клиент не загружают вашу страницу в распределенный кэш.
tr: Başarısız olunursa, içerik ekleyiciye (ya da başka bir istemciye) erişilir ve *normal bir vekil sunucu* olarak kullanılır. Bu durumda, dağıtılmış ön belleğin içerik ekleyici ya da istemciniz tarafından sayfanızla güncellenmeyeceğini unutmayın.
uk: Якщо не вдалося, інʼєктор (можливо, через іншого користувача) переходить в режим *звичайний проксі-сервер*. Зверніть увагу, що в цьому випадку ані інʼєктор, ані Ваш клієнт не завантажують Вашу сторінку до розподіленого кешу.
ur: اس میں ناکام ہونے پر، ایک انجیکٹر سے رابطہ کیا جاتا ہے (شاید کسی دوسرے کلائنٹ کے ذریعے) اور *ایک عام پراکسی سرور* کے طور پر استعمال کیا جاتا ہے۔ نوٹ کریں کہ اس صورت میں، نہ تو انجیکٹر اور نہ ہی آپ کا کلائنٹ آپ کے صفحہ کے ساتھ تقسیم شدہ کیش کو اپ ڈیٹ کرتا ہے۔

source: The different behavior results in different characteristics. Thus, in public mode:
ar: ينتج عن السلوك المختلف خصائص مختلفة. وبالتالي، في الوضع العام:
fa: رفتار متفاوت به ویژگی‌های متفاوتی می‌انجامد. بنابراین، در حالت عمومی:
fr: Cette différence de comportement est liée à certaines caractéristiques. Ainsi, en mode public :
my: ကွဲပြားသော အပြုအမူသည် ကွဲပြားသော လက္ခဏာရပ်များကို ဖြစ်ပေါ်စေသည်။ ထို့ကြောင့် အများသုံးမုဒ်တွင် -
tr: Farklı davranışlar farklı sonuçlar verir. Böylelikle herkese açık gezinmede:
uk: Різна поведінка у цих режимах призводить до різних результатів. Таким чином у публічному режимі:

source: You have better chances to get Web content, and help others get that content (from you).
ar: لديك فرص أفضل للحصول على محتوى الويب، ومساعدة الآخرين في الحصول على هذا المحتوى (منك).
es: Tienes mejores oportunidades de obtener contenido Web, y ayudar a otra(o)s a obtenerlo (de tí).
fa: شما شانس‌های بهتری برای دریافت محتوای وب دارید، و به دیگران کمک می‌کنید تا آن محتوا را (از شما) دریافت کنند.
fr: Vous aurez de meilleures chances d'obtenir du contenu web et d'aider les autres à recevoir ce contenu également (de votre part).
my: သင်သည် ဝက်ဘ်အကြောင်းအရာကို ရယူရန်နှင့် အခြားသူများအား ထိုအကြောင်းအရာကို (သင့်ထံမှ) ရရှိနိုင်အောင် ကူညီရန် ပိုကောင်းသော အခွင့်အရေးများ ရှိသည်။
pt_br: Você tem mais chances de obter conteúdo Web e ajudar outras pessoas a obter conteúdo (de você).
ru: У вас больше шансов получить веб-контент и помочь другим получить этот контент (от вас).
tr: İnternet içeriğini alıp, başkalarının erişmesine yardımcı olma olasılığınız yüksektir.
uk: У Вас більше шансів отримати мережевий вміст і допомогти іншим отримати цей вміст (від Вас).
ur: آپ کے پاس ویب مواد حاصل کرنے کے بہتر مواقع ہیں، اور وہ مواد (آپ سے) حاصل کرنے میں دوسروں کی مدد کریں۔

source: Pages with dynamic content (e.g. updated in real time) may break in obvious or subtle ways.
ar: قد تتعطل الصفحات ذات المحتوى الديناميكي (على سبيل المثال، التي يتم تحديثها في الوقت الفعلي) بطرق واضحة أو خفية.
es: Páginas con contenido dinámico (ej.: actualizadas en tiempo real) pueden quebrarse de maneras obvias o sutiles.
fa: صفحه‌های دارای محتوای پویا (مثلاً به‌روزشده در زمان واقعی) ممکن است به طرزی آشکار یا ظریف تکه‌تکه شوند.
fr: Les pages dont le contenu est dynamique (mis à jour en temps réel) peuvent être cassées de façon évidente ou subtile.
my: (ဥပမာ- အချိန်နှင့်တစ်ပြေးညီ အပ်ဒိတ်လုပ်ထားသော) ပြောင်းလဲနေသော အကြောင်းအရာ ပါဝင်သည့် စာမျက်နှာများသည် သိသာသော သို့မဟုတ် မသိသာသော နည်းလမ်းများဖြင့် ပျက်နိုင်သည်။
pt_br: Páginas com conteúdo dinâmico (exemplo, atualizadas em tempo real) podem quebrar de maneiras óbvias ou sutis.
ru: Страницы с динамическим контентом (например, обновляемым в реальном времени) могут сбоить как очевидным, так и малозаметным образом.
tr: İçeriği değişken olan (gerçek zamanlı güncellenen) sayfalarda açıkça ya da belli belirsiz bozulmalar olabilir.
uk: Сторінки з динамічним вмістом (такі, що оновлюються в режимі реального часу) можуть «ламатися» і це буде помітно або малопомітно.
ur: متحرک مواد والے صفحات (مثال کے طور پر حقیقی وقت میں اپ ڈیٹ) واضح یا لطیف طریقوں سے ٹوٹ سکتے ہیں۔

source: Pages requiring authentication do not work (as passwords and cookies are removed by the client).
ar: لا تعمل الصفحات التي تتطلب المصادقة (حيث تتم إزالة كلمات المرور وملفات تعريف الارتباط بواسطة العميل).
es: Páginas que requieran autenticación no funcionan (ya que contraseñas y cookies son removidas por la/el cliente).
fa: صفحه‌‌هایی که نیازمند هویت‌سنجی‌اند کار نمی‌کنند (چون رمزهای عبور و کوکی‌ها از سوی سرویس‌گیرنده حذف شده‌اند).
fr: Les pages nécessitant une authentification ne fonctionnent pas (car les mots de passe et les cookies sont supprimés par le client).
my: (စကားဝှက်များနှင့် ကွတ်ကီးများကို လက်ခံစက်က ဖယ်ရှားသောကြောင့်) စစ်မှန်ကြောင်း သက်သေပြရန် လိုအပ်သည့် စာမျက်နှာများသည် အလုပ်မလုပ်ပါ။
pt_br: Páginas que requerem autenticação não funcionam (pois senhas e cookies são removidos pelo cliente).
ru: Страницы, требующие аутентификации, не работают (так как пароли и cookies удаляются клиентом).
tr: Kimlik doğrulaması gereken sayfalar çalışmaz (parolalar ve çerezler istemci tarafından silinir).
uk: Сторінки, що вимагають автентифікації, не працюють (оскільки паролі та cookies видаляються клієнтом).
ur: جن صفحات کو تصدیق کی ضرورت ہوتی ہے وہ کام نہیں کرتے ہیں (کیونکہ پاس ورڈ اور کوکیز کلائنٹ کے ذریعہ ہٹا دی جاتی ہیں)۔

source: Some browsing activity may be leaked to other users (see [risks](risks.md)).
ar: قد يتم تسريب بعض أنشطة التصفح إلى مستخدمين آخرين (راجع [المخاطر](risks.md)).
es: Alguna actividad de navegación podría ser filtrada a otros usuaria(o)s (ver [riesgos](risks.md)).
fa: بعضی از فعالیت‌های مرورگری ممکن است به کاربران دیگر درز کنند (نک. [خطرات](risks.md)).
fr: Certaines activités de navigation peuvent être divulguées à d'autres utilisateurs (cf. [risques](risks.md)).
my: အချို့ ရှာဖွေရေး လှုပ်ရှားမှုသည် အခြားသုံးစွဲသူများထံ ပေါက်ကြားနိုင်သည် ([စွန့်စားမှုများ](risks.md) ကို ကြည့်ပါ)။
pt_br: Algumas atividades de navegação podem ser vazadas para outros usuários (veja os [riscos](risks.md)).
ru: Некоторые ваши действия в браузере могут стать известны другим пользователям (см. [риски](risks.md)).
tr: Bazı gezinme eylemleri diğer kullanıcılara sızabilir ([tehlikeler sayfasına](risks.md) bakın)).
uk: Деякі Ваші дії в браузері можуть стати відомими іншим користувачам (дивіться [ризики](risks.md)).
ur: براؤزنگ کی کچھ سرگرمیاں دوسرے صارفین کو لیک ہو سکتی ہیں (دیکھیں [خطرات](risks.md))۔

source: Some browsing activity may be leaked to injectors (see [risks](risks.md)).
ar: قد يتم تسريب بعض أنشطة التصفح إلى المحاقن (راجع [المخاطر](risks.md)).
es: Alguna actividad de navegación podría ser filtrada a los inyectores (ver [riesgos](risks.md)).
fa: بعضی از فعالیت‌های مرورگری ممکن است به تزریق‌کننده‌ها درز کنند (نک. [خطرات](risks.md)).
fr: Certaines activités de navigation peuvent être divulguées aux injecteurs (cf. [risques](risks.md)).
my: အချို့ ရှာဖွေရေး လှုပ်ရှားမှုသည် ထိုးသွင်းဖိုင်များထံ ပေါက်ကြားနိုင်သည် ([စွန့်စားမှုများ](risks.md) ကို ကြည့်ပါ)။
pt_br: Algumas atividades de navegação podem ser vazadas para injetores (veja os [riscos](risks.md)).
ru: Некоторые ваши действия в браузере могут стать известны инъекторам (см. [риски](risks.md)).
tr: Bazı gezinme eylemleri diğer içerik ekleyicilere sızabilir ([tehlikeler sayfasına](risks.md) bakın)).
uk: Деякі Ваші дії в браузері можуть стати відомими інʼєкторам (дивіться [ризики](risks.md)).
ur: براؤزنگ کی کچھ سرگرمیاں دوسرے انجیکٹرز کو لیک ہو سکتی ہیں (دیکھیں [خطرات](risks.md))۔

source: You need to trust injectors to retrieve and sign Web content.
ar: تحتاج إلى الوثوق بالحاقن لاسترداد محتوى الويب وتوقيعه.
es: Necesitas confiar en los inyectores para descargar y firmar contenido Web.
fa: شما برای بازیابی و امضای محتوای وب بایستی به تزریق‌کننده‌ها اعتماد کنید.
fr: Vous devez faire confiance aux injecteurs pour récupérer et signer du contenu web.
my: သင်သည် ဝက်ဘ်အကြောင်းအရာကို ပြန်ထုတ်ရန်နှင့် လက်မှတ်ထိုးရန် ထိုးသွင်းဖိုင်များကို ယုံကြည်ဖို့ လိုအပ်သည်။
pt_br: Você precisa confiar nos injetores para recuperar e assinar conteúdo Web.
ru: Вам придется доверять инъекторам получение и подписывание веб-контента.
tr: İnternet içeriğini almak ve doğrulamak için içerik ekleyicilerine güvenmeniz gereklidir.
uk: Вам доведеться довіряти інʼєкторам аби отримувати та підписувати мережевий вміст.
ur: ویب مواد کی بازیافت اور دستخط کرنے کے لیے آپ کو انجیکٹرز پر بھروسہ کرنے کی ضرورت ہے۔

source: While in private mode:
ar: و في الوضع الخاص:
fa: در حالت مرور خصوصی:
fr: Alors qu'en mode privé :
my: သီးသန့်မုဒ် သုံးနေစဉ် -
tr: Gizli gezinme kipinde:
uk: У режимі приватного перегляду:

source: You may not be able to access blocked Web content if international connectivity is too scarce; even if you could, other Ceno users would not get that content from you.
ar: قد لا تتمكن من الوصول إلى محتوى الويب المحظور إذا كان الاتصال الدولي نادرًا جدًا؛ و حتى لو تمكنت من ذلك، فلن يحصل مستخدمو Ceno الآخرون على هذا المحتوى منك.
es: Podrías no ser capaz de acceder a contenido Web bloqueado si la conectividad internacional es demasiado escasa; aún si pudieras, otra(o)s usuaria(o)s de Ceno no obtendrían ese contenido de tí.
pt_br: Você pode não ser capaz de acessar conteúdo Web bloqueado se a conectividade internacional estiver muito escassa. Mesmo que você pudesse, outros usuários do Ceno não iriam obter esse conteúdo de você.
ru: Вы не сможете получить доступ к заблокированному веб-содержимому, если международное подключение слишком ограничено; даже если вы сможете, другие пользователи Ceno не смогут получить это содержимое от вас.
tr: Uluslar arası bağlantılar çok sınırlıysa internet içeriğine erişemeyebilirsiniz. Erişebilseniz bile diğer Ceno kullanıcıları sizden bu içeriği alamayabilir.
ur: اگر بین الاقوامی رابطہ بہت کم ہے تو آپ بلاک شدہ ویب مواد تک رسائی حاصل کرنے کے قابل نہیں ہوسکتے ہیں۔ یہاں تک کہ اگر آپ کر سکتے ہیں، دوسرے Ceno صارفین آپ سے وہ مواد حاصل نہیں کریں گے۔

source: Pages with dynamic content will probably work.
ar: من المحتمل أن تعمل الصفحات ذات المحتوى الديناميكي.
es: Páginas con contenido dinámico probablemente funcionarán.
fa: صفحه‌های دارای محتوای پویا احتمالاً کار خواهند کرد.
fr: Les pages dont le contenu est dynamique fonctionneront probablement.
my: ပြောင်းလဲနေသော အကြောင်းအရာ ပါဝင်သည့် စာမျက်နှာများသည် အလုပ်လုပ်ကောင်း လုပ်နိုင်သည်။
pt_br: As páginas com conteúdo dinâmico provavelmente funcionarão.
ru: Страницы с динамическим контентом, вероятно, будут работать.
tr: İçeriği değişken olan sayfalar büyük olasılıkla çalışır.
uk: Сторінки з динамічним вмістом, імовірно, працюватимуть.
ur: متحرک مواد والے صفحات شاید کام کریں گے۔

source: Pages requiring authentication may work (when your connection is protected by HTTPS, the injector does not see your passwords).
ar: قد تعمل الصفحات التي تتطلب المصادقة (عندما يكون اتصالك محميًا بواسطة HTTPS، لا يرى الحاقن كلمات المرور الخاصة بك).
es: Páginas requiriendo autenticación podrían funcionar (cuando tu conexión está protegida por HTTPS, el inyector no ve tus contraseñas).
fa: صفحه‌های نیازمند به هویت‌سنجی شاید کار کنند (وقتی اتصال شما تحت حفاظت HTTPS باشد، تزریق‌کننده رمزهای عبورتان را نمی‌بیند).
fr: Les pages nécessitant une authentification peuvent fonctionner (lorsque votre connexion est protégée par HTTPS, l'injecteur ne voit pas vos mots de passe).
my: စစ်မှန်ကြောင်း အတည်ပြုရန် လိုအပ်သော စာမျက်နှာများသည် အလုပ်လုပ်နိုင်သည် (သင်၏ ချိတ်ဆက်မှုကို HTTPS က ကာကွယ်ထားချိန်တွင် ထိုးသွင်းဖိုင်သည် သင့်စကားဝှက်များကို မမြင်ရပါ)။
pt_br: Páginas que requerem autenticação podem funcionar (quando sua conexão está protegida por HTTPS, o injetor não vê suas senhas).
ru: Страницы, требующие аутентификации, могут работать (когда ваше соединение защищено HTTPS, инъектор не видит ваши пароли).
tr: Kimlik doğrulaması gereken sayfalar büyük olasılıkla çalışır (bağlantınız HTTPS ile korunduğu sürece içerik ekleyici parolalarınızı göremez).
uk: Сторінки, які потребують автентифікації, можуть працювати (якщо Ваше зʼєднання захищене HTTPS, інʼєктор не бачить Ваші паролі).
ur: جن صفحات کی توثیق کی ضرورت ہوتی ہے وہ کام کر سکتے ہیں (جب آپ کا کنکشن HTTPS سے محفوظ ہوتا ہے، انجیکٹر آپ کے پاس ورڈ نہیں دیکھتا ہے)۔

source: Browsing activity is not leaked to other users.
ar: لا يتم تسريب نشاط التصفح للمستخدمين الآخرين.
es: Actividad de navegación no es filtrada a otra(o)s usuaria(o)s.
fa: فعالیت مرورگری به کاربران دیگر درز نمی‌کند.
fr: L'activité de navigation n'est pas divulguée aux autres utilisateurs.
my: ရှာဖွေခြင်းဆိုင်ရာ လှုပ်ရှားမှုသည် အခြားသုံးစွဲသူများထံ မပေါက်ကြားပါ။
pt_br: A atividade de navegação não é vazada para outros usuários.
ru: Ваши действия в браузере не видны другим пользователям.
tr: Gezinme eylemleri diğer kullanıcılara sızmaz.
uk: Ваші дії в браузері не доступні іншим користувачам.
ur: براؤزنگ کی سرگرمی دوسرے صارفین کو لیک نہیں کی جاتی ہے۔

source: Limited browsing activity is leaked to injectors (with HTTPS, only the origin server name or address).
ar: يتم تسريب نشاط التصفح بشكل محدود إلى المحاقن (باستخدام HTTPS، فقط اسم أو عنوان الخادم الأصلي).
es: Actividad de navegación limitada es filtrada a los inyectores (con HTTPS, solamente el nombre o la dirección del servidor de origen).
fa: فعالیت مرورگری تا اندازه‌ی محدودی به تزریق‌کننده‌ها درز می‌کند (با HTTPS، فقط نام یا نشانی سرور اصلی).
fr: Une quantité limitée d'activité de navigation est divulguée aux injecteurs (seulement le nom ou l'adresse du serveur d'origine, avec le protocole HTTPS).
my: ကန့်သတ်ထားသော ရှာဖွေခြင်းဆိုင်ရာ လှုပ်ရှားမှုသည် ထိုးသွင်းဖိုင်များထံ ပေါက်ကြားသည် (HTTPS သုံးလျှင် မူလ ဆာဗာ အမည် သို့မဟုတ် လိပ်စာသာ ပေါက်ကြားပါမည်)။
pt_br: Uma quantidade limitada de atividade de navegação é vazada para injetores (com HTTPS, apenas o nome ou endereço do servidor de origem).
ru: Инъекторам передается ограниченная информация о просмотре веб-страниц (при использовании HTTPS — только имя или адрес исходного сервера).
tr: İçerik ekleyicilerine sınırlı gezinme eylemleri sızar (HTTPS kullanıldığında yalnızca kaynak sunucu adı veya adresi).
uk: Інʼєкторам надається обмежена інформація про перегляд вебсторінок (під час використання HTTPS – лише імʼя або адреса вихідного сервера).
ur: براؤزنگ کی محدود سرگرمی انجیکٹرز کو لیک ہو گئی ہے (HTTPS کے ساتھ، صرف اصل سرور کا نام یا پتہ)۔

source: You need not trust injectors (with HTTPS, usual certificate-based security still works).
ar: لا تحتاج إلى الوثوق بالحاقن (مع HTTPS، يعمل الأمان المعتاد المستند إلى الشهادة).
es: No necesitas confiar en los inyectores (con HTTPS, la seguridad usual basada en certificados aún funciona).
fa: نیازی نیست به تزریق‌کننده‌ها اعتماد کنید (با HTTPS، امنیت گواهی‌محور معمول همچنان کار می‌کند).
fr: Vous n’avez pas besoin de faire confiance aux injecteurs (avec HTTPS, la sécurité habituelle basée sur les certificats fonctionne).
my: သင်သည် ထိုးသွင်းဖိုင်များကို ယုံကြည်ရန် မလိုအပ်ပါ (HTTPS သုံးလျှင် ပုံမှန် အသိအမှန်ပြုလက်မှတ် အခြေခံသော လုံခြုံရေးသည် အလုပ်လုပ်သေးသည်)။
pt_br: Você não precisa confiar nos injetores (com HTTPS, a segurança usual baseada em certificados ainda funciona).
ru: Вам не нужно доверять инъекторам (при использовании HTTPS действует стандартная защита на основе сертификатов).
tr: İçerik ekleyicilerine güvenmeniz gerekmez (HTTPS kullanıldığında sertifika tabanlı güvenlik çalışmayı sürdürür).
uk: Вам не потрібно довіряти інʼєкторам (під час використання HTTPS діє стандартний захист на основі сертифікатів).
ur: آپ کو انجیکٹر پر بھروسہ کرنے کی ضرورت نہیں ہے (HTTPS کے ساتھ، عام سرٹیفکیٹ پر مبنی سیکیورٹی اب بھی کام کرتی ہے)۔
