Repository: censorship-no/ceno-docs
Catalog: user-manual/*/concepts/public-private.po
Languages: ar, es, fa, fr, my, pt_br, ru, tr, uk, ur

source: In conclusion: if you are using Ceno to read the news, watch videos, browse Wikipedia and other static resources that are otherwise censored in your network, consider using the default *public browsing* mode. And if you want to login to Twitter or edit your WordPress website, use *private browsing* mode.
ar: ختامًا: إذا كنت تستخدم Ceno لقراءة الأخبار ومشاهدة مقاطع الفيديو وتصفح ويكيبيديا والموارد الساكنة الأخرى التي تخضع للرقابة في شبكتك، خذ بعين الإعتبار استخدام وضع *التصفح العام* الافتراضي. وإذا كنت تريد تسجيل الدخول إلى Twitter أو تعديل موقع WordPress الخاص بك، فاستخدم وضع *التصفح الخاص*.
tr: Sonuç olarak, Ceno ile haberleri okumak, video izlemek, Vikipedi'de gezinmek ve normal ağınızda sansürlenmiş sabit kaynaklara erişmek gibi işlemler yapacaksanız *herkese açık gezinme* kullanmalısınız. Sosyal ağlarda oturum açmak ya da WordPress sitenizi düzenlemek gibi işlemler için *gizli gezinme* kullanmalısınız.

source: Please read the section on [risks](risks.md) for a more detailed explanation. Also note that your client can continue to operate as a bridge and a seeder regardless of public or private browsing. We explain this in greater detail in the [Helping others](../browser/bridging.md) section of the manual.
ar: يرجى قراءة قسم [المخاطر](risks.md) للحصول على شرح أكثر تفصيلاً. لاحظ أيضًا أن عميلك يمكنه الاستمرار في العمل كجسر و موزع بغض النظر عن التصفح العام أو الخاص. نوضح ذلك بمزيد من التفصيل في قسم [مساعدة الآخرين](../browser/bridging.md) من الدليل.
fa: برای توضیحی جزئی‌تر لطفاً بخش مربوط به [خطرات](risks.md) را بخوانید. همچنین به یاد داشته باشید که سرویس‌گیرنده‌ی شما می‌تواند به عملکردش به‌عنوان یک پل و یک بذرپاش، صرف‌نظر از مرور عمومی یا خصوصی، ادامه دهد. ما این نکته را در بخش [کمک به دیگران](../browser/bridging.md) از دفترچه‌ی راهنما به طور مفصل‌تر توضیح می‌دهیم.
fr: Veuillez vous référer à la section sur les [risques] (risks.md) pour une explication plus détaillée. Notez également que votre client peut continuer à fonctionner comme passerelle et diffuseur, indépendamment de la navigation publique ou privée. Nous expliquons ce fonctionnement plus en détail dans la section [Aider les autres](../navigateur/pontage.md) du manuel.
my: ကျေးဇူးပြု၍ ပိုမိုအသေးစိတ်သော ရှင်းပြချက်အတွက် [စွန့်စားမှုများ](risks.md) ရှိ အပိုင်းကို ဖတ်ပါ။ ထို့ပြင် သင့်လက်ခံစက်သည် အများသုံး သို့မဟုတ် သီးသန့် ရှာဖွေမှုနှင့် မသက်ဆိုင်ဘဲ ပေါင်းကူးနှင့် တင်ပို့စက်အဖြစ် ဆက်လက် လည်ပတ်နိုင်ကြောင်း သတိပြုပါ။ ကျွန်ုပ်တို့သည် ဤအကြောင်းကို လက်စွဲ၏ [အခြားသူများအား ကူညီခြင်း](../browser/bridging.md) အပိုင်းတွင် ပိုမိုအသေးစိတ်ကျစွာ ရှင်းပြထားပါသည်။
tr: Lütfen ayrıntılı bilgi almak için [tehlikeler sayfasına](risks.md) bakın. Unutmayın istemciniz herkese açık ya da gizli gezinme kullanmanızdan bağımsız olarak köprü ve gönderici şeklinde çalışabilir. Bu durumu rehberin [başkalarına yardım etmek](../browser/bridging.md) bölüömünde daha ayrıntılı açıkladık.
uk: Докладнішу інформацію можна знайти в розділі [ризики](risks.md). Зверніть увагу, що Ваш клієнт може продовжувати працювати як міст і розповсюджувач незалежно від публічного або приватного перегляду. Ми пояснюємо це докладніше в розділі посібника [Допомога іншим](../browser/bridging.md).

source: Because of the many techniques used to overcome connectivity issues, CENO may become a convenient way for you to get all kinds of Web content. And, as you may have already read in previous sections, whenever you retrieve and seed a page using the CENO Browser, it becomes available to others. There may be some content, however, that you do not wish to share (or you do not want to let others know that you are trying to or did retrieve), and fortunately CENO can help you in this instance as well.
fa: به دلیل تکنیک‌های بسیاری که برای غلبه بر مشکلات اتصال به کار رفته‌اند، CENO می‌تواند برای شما به راه مناسبی برای دریافت هرگونه محتوای وب بدل شود. و همان‌طور که شاید پیشاپیش در بخش‌های پیشین خوانده‌اید، هرگاه با استفاده از سنو صفحه‌ای را به کمک مرورگر سنو بازیابی و بذرپاشی کنید، این صفحه در دسترس دیگران نیز قرار می‌گیرد. با این حال، شاید محتوایی در میان باشد که مایل نباشید آن را به اشتراک بگذارید (یا شاید شما نمی‌خواهید به دیگران اجازه دهید بدانند که شما سعی می‌کنید آن را بازیابی کنید یا پیشاپیش آن را بازیابی کرده‌اید)، و خوشبختانه سنو در این مورد نیز می‌تواند به شما کمک کند.

source: The default mode when you launch the application is **public browsing**. In it, CENO accesses Web content as described previously:
fa: حالت پیش‌فرض وقتی شما نرم‌افزار را اجرا می‌کنید **مرور عمومی** است. در این حالت، CENO به محتوای وب همان‌گونه دسترسی می‌یابد که پیش‌تر وصف کردیم:
my: သင် အက်ပလီကေးရှင်းကို ဖွင့်ချိန်တွင် ပုံသေမုဒ်မှာ **အများသုံး ရှာဖွေမှု** ဖြစ်သည်။ ထိုမုဒ်တွင် CENO သည် ယခင် ဖော်ပြခဲ့သည့်အတိုင်း ဝက်ဘ်အကြောင်းအရာကို ဝင်ရောက်သုံးစွဲသည် -
uk: За замовчуванням під час запуску програми використовується режим **публічний перегляд**. У цьому режимі CENO отримує доступ до мережевого вмісту, як це описано вище:

source: CENO also has a **private browsing** mode. In it, the distributed cache is never searched, and injection is never attempted:
fa: سنو یک حالت **مرور خصوصی** نیز دارد. در این حالت، انبار توزیع‌شده هرگز جست‌وجو نمی‌شود، و تلاش برای تزریق هرگز صورت نمی‌پذیرد:
my: CENO တွင် **သီးသန့်ရှာဖွေမှု** မုဒ်လည်း ရှိသည်။ ထိုမုဒ်တွင် ဖြန့်ချိထားသော ယာယီသိမ်းဆည်းထားသည့် မှတ်ဉာဏ်ကို လုံးဝ မရှာသည့်အပြင် ထိုးသွင်းရန် လုံးဝမကြိုးစားပါ -
uk: CENO також має режим **приватного перегляду**. У цьому режимі розподілений кеш ніколи не проглядається і спроби інʼєкції не робляться:

source: You may not be able to access blocked Web content if international connectivity is too scarce; even if you could, other CENO users would not get that content from you.
fa: اگر اتصال بین‌المللی خیلی ضعیف باشد ممکن است قادر به دسترسی به محتوای وب مسدودشده نباشید؛ حتی اگر شما بتوانید به آن دسترسی پیدا کنید، سایر کاربران سنو آن محتوا را از شما دریافت نخواهند کرد.
my: နိုင်ငံတကာ ချိတ်ဆက်မှု နည်းလွန်းလျှင် သင်သည် ပိတ်ဆို့ထားသော ဝက်ဘ် အကြောင်းအရာကို ဝင်ရောက်သုံးစွဲနိုင်မည် မဟုတ်ပါ။ သင် သုံးစွဲနိုင်သည့်တိုင်အောင် အခြား CENO သုံးစွဲသူများသည် ထိုအကြောင်းအရာကို သင့်ထံမှ ရရှိမည် မဟုတ်ပါ။
uk: У Вас можуть виникнути труднощі з доступом до заблокованого вмісту за умови, якщо міжнародне підключення занадто обмежене; навіть якщо Ви зможете отримати доступ, інші користувачі CENO не зможуть отримати цей вміст від Вас.

source: In conclusion: if you are using CENO to read the news, watch videos, browse Wikipedia and other static resources that are otherwise censored in your network, consider using the default *public browsing* mode. And if you want to login to Twitter or edit your WordPress website, use *private browsing* mode.
fa: در نتیجه: اگر برای خواندن اخبار، تماشای ویدئوها، مرور ویکی‌پدیا و سایر مراجع ایستایی از سنو استفاده می‌کنید که در غیر این صورت در شبکه‌ی شما سانسور شده‌اند، استفاده از حالت پیش‌فرض **مرور عمومی** را لحاظ کنید. و اگر می‌خواهید وارد حساب کاربری توییترتان شوید یا وب‌سایت وردپرس خودتان را ویرایش کنید، از حالت **مرور خصوصی** استفاده کنید.
my: နိဂုံး- သင်သည် သတင်း ဖတ်ရန်၊ ဗီဒီယို ကြည့်ရန် Wikipedia နှင့် တစ်နည်းအားဖြင့် သင့်ကွန်ရက်တွင် ဆင်ဆာလုပ်ထားသော အခြား တည်တံ့သည့် ရင်းမြစ်များကို ရှာဖွေရန် CENO ကို အသုံးပြုနေပါက ပုံသေ *အများသုံး ရှာဖွေမှု* မုဒ်ကို အသုံးပြုရန် စဉ်းစားပါ။ ထို့ပြင် သင်သည် Twitter သို့ ဝင်ရောက်လိုပါက သို့မဟုတ် သင်၏ WordPress ဝက်ဘ်ဆိုက်ကို တည်းဖြတ်လိုပါက *သီးသန့် ရှာဖွေမှု* မုဒ်ကို အသုံးပြုပါ။
uk: Підсумовуючи: якщо Ви використовуєте CENO для читання новин, перегляду відео, перегляду Вікіпедії та інших статичних ресурсів, що підпадають під цензуру у Вашій мережі – використовуйте режим *публічний перегляду* за замовчуванням. А якщо Ви хочете ввійти в Twitter або відредагувати свій сайт на WordPress – використовуйте режим *приватний перегляд*.

source: Because of the many techniques used to overcome connectivity issues, CENO may become a convenient way for you to get all kinds of Web content. And, as you may have already read in previous sections, whenever you retrieve and seed a page using CENO Browser, it becomes available to others. There may be some content, however, that you do not wish to share (or you do not want to let others know that you are trying to or did retrieve), and fortunately CENO can help you in this instance as well.
my: ချိတ်ဆက်မှု ပြဿနာများကို ကျော်လွှားရန် နည်းပညာများစွာကို အသုံးပြုထားသောကြောင့် CENO သည် ဝက်ဘ်အကြောင်းအရာ အမျိုးအစားအားလုံးကို ရယူရန် သင့်အတွက် အဆင်ပြေသော နည်းလမ်းတစ်ခု ဖြစ်လာနိုင်သည်။ ထို့ပြင် ယခင် ကဏ္ဍများတွင် သင် ဖတ်ကောင်းဖတ်ပြီးထားသည့်အတိုင်းပင် သင်သည် CENO ဘရောက်ဇာကို အသုံးပြု၍ စာမျက်နှာတစ်ခုကို ပြန်ထုတ်၍ တင်ပို့သည့် အချိန်တိုင်းတွင် ၎င်းကို အခြားသူများလည်း ရရှိနိုင်သည်။ သို့သော် သင်မမျှဝေလိုသော (သို့မဟုတ် သင်ပြန်ထုတ်ရန် ကြိုးစားနေကြောင်း သို့မဟုတ် ပြန်ထုတ်ခဲ့ကြောင်း အခြားသူများကို သင်မသိစေလိုသည့်) အကြောင်းအရာအချို့ ရှိနိုင်ပြီး ကံကောင်းစွာဖြင့် CENO သည် ဤကိစ္စရပ်တွင်လည်း သင့်အား ကူညီနိုင်ပါသည်။
uk: Завдяки багатьом підходам у подоланні проблем із доступом до Інтернету, CENO може стати для Вас зручним способом отримання різноманітного мережевого вмісту. Як Ви вже могли ознайомитися у попередніх розділах, щоразу, коли Ви отримуєте і передаєте сторінку за допомогою браузера CENO, ця сторінка стає доступною для інших. Разом із тим, завжди є вміст, яким Ви б не хотіли ділитися з іншими (або не хотіли, аби хтось знав, що Ви намагаєтеся отримати до нього доступ), і CENO може допомогти Вам в цьому випадку.

source: Public vs. Personal browsing
pt_br: Public vs. Navegação Pessoal
ru: Публичный и Личный просмотр

source: The default mode when you launch the application is **Public browsing**. In it, Ceno accesses Web content as described previously:
pt_br: O modo padrão quando você abre a aplicação é **navegação Pública**. Nele, o Ceno acessa conteúdo Web da forma descrita anteriormente:
ru: По умолчанию при запуске приложения используется режим **Публичный просмотр**. В нем Ceno получает доступ к веб-контенту, как описано ранее:

source: Ceno also has a **Personal browsing** mode. In it, the distributed cache is never searched, and injection is never attempted:
pt_br: Ceno também tem um modo **Pessoal de navegação**. Nele, o cache distribuído nunca é procurado e nunca se tenta a injeção:
ru: Ceno также имеет режим **Личного просмотра**. В нем распределенный кэш никогда не просматривается и попытки инъекции не предпринимаются:

source: The different behavior results in different characteristics. Thus, in Public mode:
pt_br: O comportamento diferente resulta em características diferentes. Assim, no modo Público:
ru: Разное поведение в этих режимах приводит к разным результатам. Так, в Публичном режиме:

source: While in Personal mode:
pt_br: Enquanto em modo Pessoal:
ru: В режиме Личного просмотра:

source: In conclusion: if you are using Ceno to read the news, watch videos, browse Wikipedia and other static resources that are otherwise censored in your network, consider using the default *Public browsing* mode. And if you want to login to Twitter or edit your WordPress website, use *Personal browsing* mode.
pt_br: Em conclusão: se você está usando Ceno para ler notícias, assistir vídeos, navegar pela Wikipédia e por outras fontes estáticas que estão de alguma forma censuradas em sua rede, considere usar o modo padrão *navegação Pública*. E se você quer fazer login no Twitter ou editar seu website WordPress, use o modo *navegação Pessoal*.
ru: В итоге: если вы используете Ceno для чтения новостей, просмотра видео, просмотра Википедии и других статических ресурсов, которые подвергаются цензуре в вашей сети, используйте режим *Публичный просмотр* по умолчанию. А если вы хотите войти в Twitter или отредактировать свой сайт WordPress, используйте режим *Личного просмотра*.

source: Please read the section on [risks](risks.md) for a more detailed explanation. Also note that your client can continue to operate as a bridge and a seeder regardless of Public or Personal browsing. We explain this in greater detail in the [Helping others](../browser/bridging.md) section of the manual.
pt_br: Por favor, leia a seção sobre [riscos](risks.md) para uma explicação mais detalhada. Note também que o seu cliente pode continuar a operar como uma ponte e um semeador independentemente da navegação Pública ou Pessoal. Explicamos isso em detalhes na seção [Ajudando outras pessoas](../browser/bridging.md) do manual.
ru: Более подробную информацию можно найти в разделе [риски](risks.md). Также обратите внимание, что ваш клиент может продолжать работать в качестве моста и раздатчика вне зависимости от Публичного или Личного просмотра. Мы объясняем это более подробно в разделе руководства [Помощь другим](../browser/bridging.md).
