Repository: censorship-no/ceno-docs
Catalog: user-manual/*/concepts/risks.po
Languages: ar, de, es, fa, fr, id, my, pt, ru, uk, ur

source: Yes and no. Anyone with enough understanding of Ouinet's operations could construct a tool to find out what IP addresses a particular content is being shared from (as with BitTorrent). However, it is not possible to target a specific IP address and get a list of all the content seeded by clients behind it.
ar: نعم ولا. يمكن لأي شخص لديه فهمٌ كافٍ لعمليات Ouinet إنشاء أداة لمعرفة عناوين IP التي تشارك محتوىً معيّن منها (كما هو الحال مع بت تورنت BitTorrent). مع ذلك، لا يمكن استهداف عنوان IP محدد والحصول على قائمة بجميع المحتويات التي يوزعها العملاء الذين يقفون وراءه.
de: Ja und nein. Jeder, der die Funktionsweise von Ouinet hinreichend versteht, könnte ein Tool entwickeln, um herauszufinden, von welchen IP-Adressen ein bestimmter Inhalt verbreitet wird (wie bei BitTorrent). Es ist jedoch nicht möglich, eine bestimmte IP-Adresse anzusteuern und eine Liste aller Inhalte zu erhalten, die von den dahinter stehenden Clients verbreitet werden.
es: Sí y no. Cualquiera con suficiente entendimiento de las operaciones de Ouinet podría construir una herramienta para descubrir desde qué direcciones IP un contenido en particular está siendo compartido (como con BitTorrent). Sin embargo, no es posible apuntar a una dirección IP específica y obtener una lista de todo el contenido sembrado por los clientes detrás de ella.
fa: بله و خیر. هر کسی با فهمی کافی از عملکردهای Ouinet می‌تواند ابزاری را برای پی‌بردن به این‌که یک محتوای خاص ازکدام نشانی‌های IP به اشتراک گذاشته می‌شود بسازد (مانند بیت‌تورنت). با این حال، هدف‌گرفتن یک نشانی IP مشخص و دریافت لیستی از همه‌ی محتواهای بذرپاشی‌شده از سوی سرویس‌گیرندگان پشت آن‌ها ممکن نیست.
fr: Oui et non. Toute personne ayant un certain niveau de compréhension des opérations de Ouinet pourrait concevoir un outil pour découvrir les adresses IP à partir desquelles un contenu particulier est partagé (comme avec BitTorrent). Cependant, il n'est pas possible de cibler une adresse IP spécifique et d'obtenir une liste des contenus partagés par les clients derrière celle-ci.
id: Ya dan tidak. Siapa pun yang punya pemahaman yang cukup mengenai cara kerja Ouinet dapat membuat alat untuk mencari tahu alamat IP dari suatu konten yang sedang dibagikan di (misalnya BitTorrent). Namun, tidak mungkin untuk menargetkan alamat IP yang spesifik dan mendapatkan daftar seluruh konten yang disebarkan oleh pengguna dibaliknya.
my: တချို့တစ်ဝက်ကို ရှာတွေ့နိုင်ပါသည်။ Ouinet ၏ အလုပ်လုပ်ပုံကို နားလည်နိုင်စွမ်းရှိသော မည်သူမဆိုသည် သီးခြား အကြောင်းအရာတစ်ခုကို မည်သည့် IP လိပ်စာမှ မျှဝေထားသည်ကို ရှာတွေ့နိုင်သည့် ကိရိယာတစ်ခု (BitTorrent တွင်ကဲ့သို့) တည်ဆောက်နိုင်ပါသည်။ မည်သို့ပင်ဆိုစေကာမူ တိကျသော IP လိပ်စာတစ်ခုကို ရှာတွေ့ရန်နှင့် နောက်ကွယ်တွင် လက်ခံစက်များမှ တင်ပို့ထားသော အကြောင်းအရာအားလုံး၏ စာရင်းကို ရရန်မှာ မဖြစ်နိုင်ပါ။
pt: Sim e não. Qualquer pessoa com entendimento suficiente das operações da Ouinet poderia construir uma ferramenta para descobrir a partir de quais endereços de IP um determinado conteúdo está a ser partilhado (como com BitTorrent). Porém, não é possível definir um endereço de IP específico como alvo e obter uma lista de todo o conteúdo semeado por clientes atrás dele.
ru: И да, и нет. Любой, кто достаточно хорошо разбирается в работе Ouinet, может создать инструмент для выяснения того, с каких IP-адресов распространяется определенный контент (как в случае с BitTorrent). Однако невозможно определить конкретный IP-адрес и получить список всего контента, рассылаемого клиентами, находящимися за ним.
uk: І так і ні. Будь-хто, хто досить добре розуміється на роботі Ouinet, може створити інструмент аби з'ясувати, з яких IP-адрес поширюється певний контент (як у випадку з BitTorrent). Однак, неможливо визначити конкретну IP-адресу і отримати перелік всього того контенту, що роздається клієнтами.
ur: ہاں اور نہیں. Ouinet کے آپریشنز کے بارے میں کافی سمجھ رکھنے والا کوئی بھی شخص یہ جاننے کے لیے ایک ٹول بنا سکتا ہے کہ کسی خاص مواد کو کس IP ایڈریس سے شیئر کیا جا رہا ہے (جیسا کہ BitTorrent کے ساتھ)۔تاہم، کسی مخصوص IP ایڈریس کو نشانہ بنانا اور اس کے پیچھے کلائنٹس کے ذریعہ (سیڈڈ) ترتیب دیئے گئے تمام مواد کی فہرست حاصل کرنا ممکن نہیں ہے۔

source: As a bridge
ar: كجسر
de: Als Brücke
es: Como puente
fa: به‌عنوان یک پل
fr: En tant que passerelle
id: Sebagai jembatan
my: ပေါင်းကူးတစ်ခု အဖြစ်
pt: Como uma ponte
ru: В качестве моста
uk: В режимі "міст"
ur: ایک پل کے طور پر

source: Can others find my IP address?
ar: هل يمكن للآخرين العثور على عنوان IP الخاص بي؟
de: Können andere meine IP-Adresse herausfinden?
es: ¿Pueden otra(o)s encontrar mi dirección IP?
fa: آیا دیگران می‌توانند نشانی IP مرا پیدا کنند؟
fr: Les autres peuvent-ils trouver mon adresse IP ?
id: Bisakah orang lain menemukan alamat IP saya?
my: အခြားသောသူများက ကျွန်ုပ်၏ IP လိပ်စာကို ရှာတွေ့နိုင်ပါသလား။
pt: Outras pessoas podem encontrar o meu endereço de IP?
ru: Могут ли другие узнать мой IP-адрес?
uk: Чи можуть інші дізнатися мою IP-адресу?
ur: کیا دوسرے لوگ میرا IP ایڈریس تلاش کر سکتے ہیں؟

source: Yes, every Ceno Browser able to communicate with injectors will register its IP address in the bridge swarm where other Ouinet clients can find them.
ar: نعم ، كل متصفح Ceno قادر على التواصل مع حاقن سيسجِّل عنوان IP الخاص به في سرب الجسر حيث يمكن لعملاء Ouinet الآخرين العثور عليه.
de: Ja, jeder Ceno-Browser, der mit Injektoren kommunizieren kann, registriert seine IP-Adresse im Bridge-Schwarm, wo andere Ouinet-Clients ihn finden können.
es: Sí, cada Navegador Ceno capaz de comunicarse con los inyectores registrará su dirección IP en el enjambre de puentes donde otra(o)s clientes Ouinet puedan encontrarlos.
fr: Oui, chaque navigateur Ceno capable de communiquer avec les injecteurs enregistrera son adresse IP dans l'essaim de passerelles où d'autres clients Ouinet pourront les trouver.
id: Ya, setiap Peramban Ceno yang dapat berkomunikasi dengan injektor akan mendaftarkan alamat IP-nya di kumpulan jembatan di mana klien pengguna Ouinet lain dapat menemukannya.
pt: Sim, todo Navegador Ceno capaz de comunicar com injetores registará os seus endereços de IP no enxame de pontes onde outros clientes Ouinet podem encontrá-los.
ur: جی ہاں، ہر CENO براؤزر جو انجیکٹرز کے ساتھ بات چیت کرنے کے قابل ہو گا اپنا IP ایڈریس پل بھیڑ میں رجسٹر کرے گا جہاں دوسرے Ouinet کلائنٹس انہیں تلاش کر سکتے ہیں۔

source: Is it possible that I am helping someone to access content which is illegal in my country?
ar: هل من الممكن أن أساعد شخصاً ما في الوصول إلى محتوى غير قانوني في بلدي؟
de: Ist es möglich, dass ich jemandem helfe, auf Inhalte zuzugreifen, die in meinem Land illegal sind?
es: ¿Es posible que esté ayudando a alguien a acceder a contenido que es ilegal en mi país?
fa: آیا امکان دارد به کسی کمک کنم تا به محتوایی دسترسی پیدا کند که در کشور من غیرقانونی است؟
fr: Est-il possible que j'aide quelqu'un à accéder à du contenu illégal dans mon pays ?
id: Mungkinkah saya membantu seseorang untuk mengakses konten yang termasuk ilegal di negara saya?
my: ကျွန်ုပ်တို့နိုင်ငံတွင် ပိတ်ထားသော အကြောင်းအရာကို အခြားသူများ ရယူရန်အတွက် ကျွန်ုပ် ကူညီပေးနိုင်ရန် ဖြစ်နိုင်ပါသလား။
pt: É possível que esteja a ajudar alguém a aceder conteúdo considerado ilegal no meu país?
ru: Возможно ли, что я помогаю кому-то получить доступ к контенту, который является незаконным в моей стране?
uk: Чи можливо, що я допомагаю комусь отримати доступ до контенту, що є нелегальним у моїй країні?
ur: کیا یہ ممکن ہے کہ میں کسی ایسے مواد تک رسائی میں مدد کر رہا ہوں جو میرے ملک میں غیر قانونی ہے؟

source: Yes. However, bridges only relay encrypted communication between a Ouinet client and an injector. This means that a bridge shall never make direct requests for content to any other server on someone else's behalf.
ar: نعم. ومع ذلك، تقوم الجسور فقط بنقل الاتصالات بين عميل Ouinet والحاقن بشكل مشفّر. هذا يعني أن الجسر لن يقوم مطلقاً بتقديم طلبات مباشرة للمحتوى إلى أي خادم آخر نيابة عن شخص آخر.
de: Brücken leiten jedoch nur die verschlüsselte Kommunikation zwischen einem Ouinet-Client und einem Injektor weiter. Das bedeutet, dass eine Bridge niemals direkte Anfragen nach Inhalten an einen anderen Server im Namen einer anderen Person stellen darf.
es: Sí. Sin embargo, los puentes solamente repiten una comunicación cifrada entre un cliente Ouinet y un inyector. Esto significa que un puente nunca hará solicitudes directas por contenido a cualquier otro servidor de parte de alguien más.
fa: بله. اما، پل‌ها فقط ارتباطی رمزگذاری‌شده را بین یک سرویس‌گیرنده‌ی Ouinet و یک injector برقرار می‌کنند. این به معنای آن است که پل هرگز نباید درخواست‌هایی مستقیم برای محتوا را به هیچ سرور دیگری اعلام کنند.
fr: Oui, mais les ponts ne font que relayer les communications chiffrées entre un client Ouinet et un injecteur. Cela signifie qu’un pont ne demandera jamais directement un contenu à un autre serveur au nom de quelqu’un d’autre.
id: Ya. Namun, jembatan hanya menyampaikan komunikasi terenkripsi antara klien Ouinet dan injektor. Ini berarti bahwa jembatan tidak akan pernah membuat permintaan konten secara langsung ke server mana pun atas nama orang lain.
my: ဖြစ်နိုင်ပါသည်။ သို့သော် ပေါင်းကူးများသည် Ouinet လက်ခံစက်နှင့် ထိုးသွင်းစက်တို့အကြား ကုဒ်ဖြင့်ပြောင်းလဲထားသော ဆက်သွယ်မှုများကိုသာ လက်ဆင့်ကမ်းနိုင်ပါသည်။ ဆိုလိုသည်မှာ ပေါင်းကူးတစ်ခုသည် တစ်ဦးတစ်ယောက်ကိုယ်စား အခြားဆာဗာတစ်ခုထံသို့ အကြောင်းအရာ တိုက်ရိုက်တောင်းဆိုချက်များကို လုံးဝ မပြုလုပ်ပါ။
pt: Sim. No entanto, pontes apenas retransmitem comunicações criptografadas entre um cliente e um injetor Ouinet. Isso significa que uma ponte nunca deve fazer solicitações diretas de conteúdo para nenhum outro servidor em nome de outra pessoa.
ru: Да. Однако мосты передают только зашифрованную связь между клиентом Ouinet и инъектором. Это означает, что мост никогда не должен делать прямых запросов на контент к любому другому серверу от чужого имени.
uk: Так. Проте мости передають лише зашифрований зв'язок між клієнтом Ouinet та ін'єктором. Це означає, що міст ніколи не робитиме прямих запитів щодо контенту до іншого сервера від чужого імені.
ur: جی ہاں. تاہم، پل صرف Ouinet کلائنٹ اور ایک انجیکٹر کے درمیان انکرپٹڈ بات چیت کو منتقل کرتے ہیں۔ اس کا مطلب یہ ہے کہ ایک پل کبھی بھی کسی اور کی طرف سے کسی دوسرے سرور سے مواد کی براہ راست درخواست نہیں کرے گا۔

source: [National intranet]: https://en.wikipedia.org/wiki/National_intranet
ar: [الإنترانت الوطني]: https://ar.wikipedia.org/wiki/%D8%A7%D9%84%D8%A5%D9%86%D8%AA%D8%B1%D9%86%D8%AA_%D8%A7%D9%84%D9%82%D9%88%D9%85%D9%8A
de: [Nationales Intranet]: https://en.wikipedia.org/wiki/National_intranet *(auf Englisch)*
es: [Intranet nacional]: https://es.wikipedia.org/wiki/Intranet_nacional
fr: [Intranet national] : https://en.wikipedia.org/wiki/National_intranet
id: [Intranet nasional]: https://id.wikipedia.org/wiki/Intranet_nasional
my: [နိုင်ငံတွင်းသုံး အင်ထရာနက်]: https://en.wikipedia.org/wiki/National_intranet
pt: [Intranet nacional]: https://en.wikipedia.org/wiki/National_intranet
ru: [национальных внутренних сетей]: https://en.wikipedia.org/wiki/National_intranet
uk: [Національна внутрішня мережа]: https://en.wikipedia.org/wiki/National_intranet
ur: [قومی انٹرانیٹ]: https://en.wikipedia.org/wiki/National_intranet

source: Risks in using CENO/Ouinet
my: CENO/Ouinet အသုံးပြုခြင်း၏ စွန့်စားမှုများ
ru: Риски при использовании CENO/Ouinet
uk: Ризики під час використання CENO/Ouinet

source: As with any sufficiently complex computing system, and especially such an innovative one, using CENO Browser (and any Ouinet client in general) is not free from some risks. In this section we will compile and describe them to help you understand their implications according to the different roles you may play when using CENO:
my: အလွန်ရှုပ်ထွေးသော ကွန်ပျူတာစနစ်၊ အထူးသဖြင့် ဆန်းသစ်တီထွင်ထားသော ကွန်ပျူတာစနစ်ကို အသုံးပြုသကဲ့သို့ပင် CENO ဘရောက်ဇာ (ယေဘုယျအားဖြင့် မည်သည့် Ouinet လက်ခံစက်ကိုမဆို) အသုံးပြုခြင်းဖြင့် အချို့သော စွန့်စားမှုများမှ ကင်းလွတ်မည်မဟုတ်ပါ။ CENO ကို အသုံးပြုပုံပေါ် မူတည်၍ အကျိုးသက်ရောက်မှုများကို သင်နားလည်စေရန် ဤအပိုင်းတွင် စုစည်းဖော်ပြပေးပါမည် -

source: On the other hand, when the request uses private browsing mode, it is not modified by the client, but the whole communication is encrypted for the origin server. This means that in this other case the injector cannot decrypt the content.
fa: از سوی دیگر، وقتی این درخواست از حالت مرور خصوصی استفاده می‌کند، از سوی سرویس‌گیرنده دستکاری نمی‌شود، بلکه کل ارتباط برای سرور اصلی رمزگذاری می‌شود. این به معنای آن است که در این مورد دیگر injector نمی‌تواند محتوا را رمزگشایی کند.
id: Di sisi lain, ketika permintaan menggunakan mode penjelajahan privat, permintaan tersebut tidak akan dimodifikasi oleh klien, namun seluruh komunikasi dienkripsi untuk server asal. Ini artinya, dalam kasus lain, injektor tidak dapat mendekripsi kontennya.
my: အခြားတစ်ဖက်တွင်မူ တောင်းဆိုချက်သည် အများသုံးရှာဖွေခြင်းမုဒ်ကို အသုံးပြုသောအခါ ထိုအရာကို လက်ခံစက်မှ ပြုပြင်၍မရနိုင်ပါ။ သို့သော် မူလဆာဗာအတွက် ဆက်သွယ်မှုတစ်ခုလုံးကို ကုဒ်ဖြင့်ပြောင်းလဲထားပါသည်။ ဆိုလိုသည်မှာ ဤအခြေအနေတွင် ထိုးသွင်းစက်သည် အကြောင်းအရာကို ကုဒ်ဖြည်၍မရနိုင်ပါ။
ru: С другой стороны, когда запрос использует режим приватного просмотра, он не изменяется клиентом, но вся связь шифруется для исходного сервера. Это означает, что в этом другом случае инъектор не может расшифровать содержимое.
uk: З іншого боку, коли запит використовує режим приватного перегляду, запит не змінюється клієнтом, але зв'язок шифрується для вихідного сервера. Це означає, що в цьому випадку ін'єктор не може розшифрувати вміст.
ur: دوسری طرف، جب درخواست نجی براؤزنگ موڈ کا استعمال کرتی ہے، تو کلائنٹ کی طرف سے اس میں کوئی تبدیلی نہیں کی جاتی ہے، لیکن پوری بات چیت کو اصل سرور کے لیے انکرپٹ کیا جاتا ہے۔ اس کا مطلب یہ ہے کہ اس دوسری صورت میں انجیکٹر مواد کو ڈکرپٹ نہیں کر سکتا۔

source: Yes. However, injectors cannot distinguish whether a request came from a CENO user or a bridge. Thus requests going to the injector cannot be reliably assigned an originating IP addresses.
my: မြင်နိုင်ပါသည်။ သို့သော် ထိုးသွင်းစက်များက တောင်းဆိုချက်များသည် CENO အသုံးပြုသူ သို့မဟုတ် ပေါင်းကူး၊ မည်သည့်နေရာမှ ရောက်လာသည်ကို ခွဲခြားမသိနိုင်ပါ။ ထို့ကြောင့် ထိုးသွင်းစက်ဆီသွားသော တောင်းဆိုချက်များကို မူလအစပြုသော IP လိပ်စာအား ယုံကြည်စိတ်ချစွာ ပေးအပ်ရန်မဖြစ်နိုင်ပါ။
ru: Да. В то же время, инъекторы не могут отличить, пришел ли запрос от пользователя CENO или от моста. Таким образом, запросы, поступающие к инъектору, не могут быть надежно привязаны к IP-адресам.
uk: Так. Проте, ін'єктори не можуть відрізнити, чи запит надійшов від користувача CENO чи від мосту. Отож, запити, що надходять до ін'єктора, не можуть бути надійно прив'язані до IP-адрес.

source: Hopefully not. As mentioned above, CENO Browser tries hard to remove any private data (passwords, cookies…) from any request for injection. In addition, the injector does not itself do any seeding; in fact, its sole purpose is to sign content so that Ouinet clients can seed it. This means that when the content comes back to the client, it is further analyzed, and if the origin server indicated that it is of a private nature, CENO will not seed it either.
my: မပေါက်ကြားနိုင်ဟု မျှော်လင့်ပါသည်။ အထက်တွင် ဖော်ပြခဲ့သည့်အတိုင်း CENO ဘရောက်ဇာသည် ထိုးသွင်းရန် တောင်းဆိုချက်မှ ကိုယ်ရေးကိုယ်တာအချက်အလက် (စကားဝှက်များ၊ ကွတ်ကီများ စသည်ဖြင့်) ကို ဖယ်ရှားရန် ကြိုးစားပါသည်။ ထို့ပြင် ထိုးသွင်းစက်သည် ၎င်းကိုယ်တိုင် မည်သည့်အရာကိုမျှ မတင်ပို့ပါ။ အကြောင်းမှာ ထိုးသွင်းစက်၏ တစ်ခုတည်းသော ရည်ရွယ်ချက်သည် Ouinet လက်ခံစက်များ အကြောင်းအရာကို တင်ပို့နိုင်ရန်အတွက် ထိုအကြောင်းအရာတွင် လက်မှတ်ထိုးရန်သာဖြစ်သည်။ ဆိုလိုသည်မှာ လက်ခံစက်ထံသို့ အကြောင်းအရာ ပြန်ရောက်လာသောအခါ အကြောင်းအရာကို ထပ်မံ ခွဲခြမ်းစိတ်ဖြာပြီးနောက် မူလဆာဗာသည် သီးသန့်ဖြစ်သော သဘာဝကို ညွှန်ပြနေလျှင် CENO သည် ထိုအကြာင်းအရာကို တင်ပို့မည် မဟုတ်ပါ။

source: Still, there could be cases of badly designed or malicious pages which may collect some information from you (like an email address in a form or some browser fingerprints using JavaScript) and stuff it in another link URL as normal path components (e.g. `http://example.com/subscribe/you@example.org`). If you suspect that a page may be doing that, better be on the safe side and use private browsing for it.
fa: که با این حال، ممکن است مواردی از صفحات بدطراحی‌شده یا بدخواهانه که شاید برخی اطلاعات را از شما جمع‌آوری کنند (مانند یک نشانی پست الکترونیک در یک قالب یا اثر انگشت مرورگری که از جاوااسکریپت استفاده می‌کند) و آن را در لینکی دیگر به‌عنوان اجزای مسیر معمولی انباشته کند (مثلاً `http://example.com/subscribe/you@example.org`). اگر به این مشکوک‌اید که یک صفحه شاید در حال انجام این کار است، بهتر است جانب احتیاط را نگه دارید و از حالت مرور خصوصی برای بازدید از آن صفحه استفاده کنید.
id: Namun, mungkin saja ada kasus di mana halaman didesain dengan sangat buruk atau halaman berbahaya yang kemungkinan mengumpulkan beberapa informasi dari Anda (seperti alamat surel dalam suatu formulir atau beberapa sidik jari peramban menggunakan JavaScript) dan memasukkannya ke dalam URL tautan lain sebagai komponen alamat normal (misalnya `http://example.com/subscribe/you@example.org`). Jika Anda mencurigai suatu halaman mungkin melakukan hal itu, sebaiknya berhati-hati dan gunakanlah penjelajahan privat.
my: သို့တိုင်အောင် ညံ့ဖျင်းသော ဒီဇိုင်းနှင့် စာမျက်နှာများ သို့မဟုတ် အန္တရာယ်ရှိသော စာမျက်နှာများသည် သင့်ထံမှ အချက်အလက်တချို့ (ဖောင်တစ်ခုမှ အီးမေးလ်လိပ်စာ သို့မဟုတ် JavaScript ကို အသုံးပြုပြီး ရရှိလာသော ဘရောက်ဇာလက်ဗွေရာတချို့ ကဲ့သို့သော အချက်အလက်များ) ကို စုဆောင်းထားနိုင်သည့်အပြင် အခြား URL လင့်ထဲသို့ ပုံမှန် လမ်းကြောင်း အစိတ်အပိုင်းများ (ဥပမာ - `http://example.com/subscribe/you@example.org`) အဖြစ် သွတ်သွင်းခံရနိုင်ခြင်း အစရှိသော ကိစ္စရပ်များ ဖြစ်နိုင်ပါသည်။ အကယ်၍ သင်သည် စာမျက်နှာတစ်ခုမှ ထိုကဲ့သို့ ပြုလုပ်နိုင်သည်ကို သံသယရှိပါက လုံခြံစေရန်အလို့ငှာ ယင်းစာမျက်နှာကို သီးသန့်ရှာဖွေ၍ သုံးခြင်းမှာ အကောင်းဆုံးဖြစ်ပါလိမ့်မယ်။
ru: Тем не менее, могут быть случаи плохо разработанных или вредоносных страниц, которые могут собирать некоторую информацию от вас (например, адрес электронной почты в форме или отпечатки пальцев браузера с помощью JavaScript) и помещать ее в URL другой ссылки как обычные компоненты пути (например, `http://example.com/subscribe/you@example.org`). Если вы подозреваете, что страница может делать это, лучше перестраховаться и использовать для нее приватный просмотр.
uk: Тим не менш, можуть бути випадки погано зроблених або шкідливих сторінок, які здатні збирати деяку інформацію про вас (наприклад, адресу електронної пошти у формі або цифровий відбиток браузера за допомогою JavaScript) і розміщувати її в URL іншого посилання як звичайні компоненти адреси (наприклад, `http://example.com/subscribe/you@example.org`). Якщо ви підозрюєте, що сторінка може це робити, краще убезпечитися й застосувати для неї режим приватного перегляду.
ur: پھر بھی، خراب طریقے سے ڈیزائن کیے گئے یا بدنیتی پر مبنی صفحات کے معاملات ہو سکتے ہیں جو آپ سے کچھ معلومات جمع کر سکتے ہیں (جیسے کسی فارم میں ای میل ایڈریس یا JavaScript کا استعمال کرتے ہوئے کچھ براؤزر کے فنگر پرنٹس) اور اسے عام راستے کے اجزاء کے طور پر کسی دوسرے لنک URL میں بھر سکتے ہیں (جیسے `http: //example.com/subscribe/you@example.org`)۔ اگر آپ کو شبہ ہے کہ کوئی صفحہ ایسا کر رہا ہے تو بہتر ہے کہ محفوظ رہیں اور اس کے لیے نجی براؤزنگ کا استعمال کریں۔

source: Can the origin server know whether I am using CENO?
my: ကျွန်ုပ်က CENO ကို အသုံးပြုနေလား ဆိုတာကို မူရင်းဆာဗာက သိနိုင်ပါသလား။
ru: Может ли исходный сервер узнать, использую ли я CENO?
uk: Чи може вихідний сервер дізнатися, чи я використовую CENO?

source: Most probably not. Whenever CENO contacts an origin server directly, it behaves as normal Firefox for Android does, so your particular device appears as a normal Firefox app of the same version.
my: မသိဖို့ များပါသည်။ CENO မှ မူလဆာဗာကို တိုက်ရိုက်ဆက်သွယ်သောအခါတိုင်း ၎င်းသည် Android တွင်အလုပ်လုပ်သော ပုံမှန် Firefox ကဲ့သို့ အလုပ်လုပ်ပါသည်။ ထို့ကြောင့် သင့်သီးခြားကိရိယာသည် ဗားရှင်းတူညီသော ပုံမှန် Firefox အက်ပလီကေးရှင်းအဖြစ် ဖော်ပြနေပါတယ်။
ru: Скорее всего, нет. Каждый раз, когда CENO напрямую связывается с исходным сервером, он ведет себя как обычный Firefox для Android, поэтому на вашем конкретном устройстве отображается как обычное приложение Firefox той же версии.
uk: Скоріше за все ні. Щоразу, коли CENO безпосередньо зв'язується з вихідним сервером, він веде себе як звичайний Firefox для Android, тому на вашому конкретному пристрої відображається як звичайна програма Firefox тієї ж версії.

source: However, when it uses an injector to get some content from its origin server, there are (at least) two ways for the latter to know that CENO or Ouinet is involved:
my: မည်သို့ပင်ဆိုစေကာမူ CENO သည် မူလဆာဗာမှ အကြောင်းအရာတချို့ရယူရန် ထိုးသွင်းစက်ကို အသုံးပြုသောအခါ CENO သို့မဟုတ် Ouinet တို့ ပါဝင်နေကြောင်း နောက်ပိုင်းတွင် သိနိုင်သည့် နည်းလမ်း (အနည်းဆုံး) နှစ်ခုရှိပါတယ်။
ru: Однако, когда он использует инъектор для получения некоторого содержимого со своего исходного сервера, у последнего есть (по крайней мере) два способа узнать, что в этом участвует CENO или Ouinet:
uk: Однак, коли він використовує ін'єктор для отримання деякого вмісту зі свого вихідного сервера, у останнього є (принаймні) два способи дізнатися, що в цьому бере участь CENO або Ouinet:

source: Please note that these only mark the request as coming from Ouinet, but they do not link it to you or your particular device. However, if the request did for some of the reasons mentioned in the previous question still contain some personally identifiable information, it could be used to mark you as a CENO user.
my: ကျေဇူးပြုပြီး သတိပြုရန်မှာ ထိုးသွင်းစက်များသည် တောင်းဆိုချက်ကို Ouinet မှ လာကြောင်းသာ မှတ်သားထားပါသည်။ ၎င်းတို့သည် သင့်ကို သို့မဟုတ် သင်၏ သီးသန့်ကိရိယာကို ထိုတောင်းဆိုချက်နှင့် မဆက်စပ်စေပါ။ မည်သို့ပင်ဆိုစေကာမူ ယခင်မေးခွန်းပါ အကြောင်းရင်းများကြောင့် တောင်းဆိုချက်တွင် မည်သူမည်ဝါဖြစ်ကြောင်း သတ်မှတ်နိုင်သော အချက်အလက်များ ပါဝင်သေးပါက သင့်ကို CENO အသုံးပြုသူအဖြစ် မှတ်ယူနိုင်ပါသည်။
ru: Обратите внимание, что они только помечают запрос как исходящий от Ouinet, но не связывают его с вами или вашим конкретным устройством. Однако, если запрос по каким-то причинам, упомянутым в предыдущем вопросе, все же содержит какую-то личную информацию, она может быть использована, чтобы отметить вас как пользователя CENO.
uk: Будь ласка, зверніть увагу, що вони лише позначають запит як вихідний від Ouinet, але не пов'язують його з вами чи вашим конкретним пристроєм. Однак, якщо запит з якихось причин, згаданих у попередньому питанні, все ж таки містить якусь особисту інформацію, вона може бути використана, щоб позначити вас як користувача CENO.

source: In general, if a particular website (such as a governmental site) expects you to connect to it as an identifiable individual, from a specific region (or from a [national intranet][National intranet]), we recommend that you use a normal Web browser instead of CENO.
my: ယေဘုယျအားဖြင့် သီးခြားဝဘ်ဆိုက်တစ်ခု (ဥပမာ - အစိုးရဝဘ်ဆိုက်တစ်ခု) သည် သင့်ကို တိကျသော နေရာဒေသတစ်ခုမှ (သို့မဟုတ် [နိုင်ငံတွင်းသုံး အင်ထရာနက်][နိုင်ငံတွင်းသုံး အင်ထရာနက်] မှ) တစ်ဦးတစ်ယောက်ချင်းစီအလိုက် ခွဲခြားသတ်မှတ်နိုင်သော ပုံစံဖြင့် ချိတ်ဆက်မည်ကို မျှော်လင့်နေပါက CENO အစား ပုံမှန် ဝဘ်ဘရောက်ဇာတစ်ခုကို အသုံးပြုဖို့ ကျွန်ုပ်တို့ အကြံပြုလိုပါသည်။
ru: В целом, если конкретный сайт (например, правительственный сайт) ожидает, что вы подключитесь к нему как идентифицируемое лицо, из определенного региона (или из [национальных внутренних сетей][Национальных внутренних сетей]), мы рекомендуем вам использовать обычный веб-браузер вместо CENO.
uk: В цілому, якщо конкретний сайт (наприклад, урядовий сайт) очікує, що ви підключитесь до нього як ідентифікована особа з певного регіону (або з [національних внутрішніх мереж][Національних внутрішніх мереж]), ми рекомендуємо вам використовувати звичайний веб-браузер замість CENO.
