Repository: censorship-no/ceno-docs
Catalog: user-manual/*/concepts/risks.po
Languages: ar, de, es, fa, fr, id, my, pt, ru, uk, ur

source: Hopefully not. As mentioned above, Ceno Browser tries hard to remove any private data (passwords, cookies…) from any request for injection. In addition, the injector does not itself do any seeding; in fact, its sole purpose is to sign content so that Ouinet clients can seed it. This means that when the content comes back to the client, it is further analyzed, and if the origin server indicated that it is of a private nature, Ceno will not seed it either.
ar: نأمل ألّا يحدث ذلك. كما هو مذكور أعلاه، يحاول متصفح Ceno جاهداً إزالة أي بيانات خاصة (كلمات المرور وملفات تعريف الارتباط ...) من أي طلب يرسل للحاقن. بالإضافة إلى ذلك، لا يقوم الحاقن نفسه بأي توزيع؛ في الواقع، الغرض الوحيد من الحاقن هو توقيع المحتوى كي يتمكن عملاء Ouinet من توزيعه. هذا يعني أنه عندما يعود المحتوى إلى العميل، يتم تحليله، وإذا أشار الخادم الأصلي إلى أن المحتوى ذو طبيعة خاصة، فلن يقوم Ceno بتوزيعه.
de: Hoffentlich nicht. Wie bereits erwähnt, bemüht sich Ceno Browser, alle privaten Daten (Passwörter, Cookies usw.) aus jeder Injektionsanfrage zu entfernen. Darüber hinaus führt der Injektor selbst kein Seeding durch; sein einziger Zweck ist es, Inhalte zu signieren, damit Ouinet-Clients sie seeden können. Das bedeutet, dass der Inhalt, wenn er zum Kunden zurückkommt, weiter analysiert wird, und wenn der Ursprungsserver angibt, dass er privater Natur ist, wird Ceno ihn auch nicht weitergeben.
es: Esperamos que no. Como se mencionó arriba, el Navegador Ceno se esfuerza por eliminar cualquier dato privado (contraseñas, cookies…) de cualquier solicitud para inyección. Además, el inyector no siembra por sí mismo; de hecho, su único propósito es firmar contenido de manera que la(o)s clienta(e)s Ouinet puedan sembrarlo. Esto significa que cuando el contenido vuelve al/la clienta(e), es vuelto a analizar, y si el servidor de origen indicó que es de naturaleza privada, Ceno tampoco lo sembrará.
fr: Il faut espérer que non. Comme mentionnée plus haut, le Navigateur Ceno s’efforce de supprimer toute donnée privée (mots de passe, témoins…) de toute demande d’injection. De plus, l’injecteur même ne propage rien ; en fait, son seul but est de signer le contenu afin que les clients Ouinet puissent le propager. Cela signifie qu’une fois le contenu revenu au client, il est analysé à nouveau et si le serveur d’origine a indiqué qu’il était de nature privée, Ceno ne le propagera pas non plus.
id: Semoga tidak. Seperti yang disebutkan di atas, Peramban Ceno berusaha sangat keras untuk menghapus semua data pribadi (kata sandi, kuki…) dari semua permintaan untuk injeksi. Sebagai tambahan, injektor tidak bisa menyebarkan konten dengan sendirinya. Faktanya, fungsi utama injektor adalah untuk menandatangani konten sehingga klien Ouinet bisa menyebarkannya. Ini artinya, ketika konten kembali ke klien, konten tersebut dianalisis lebih lanjut, dan jika server asal mengindikasikan bahwa konten tersebut bersifat pribadi, Ceno juga tidak akan menyebarkannya.
pt: Esperamos que não. Como mencionamos acima, o Navegador Ceno se esforça para remover qualquer dado privado (palavras-passe, cookies...) de qualquer solicitação para injetores. Além disso, o injetor em si não semeia; na verdade, o único propósito dele é assinar conteúdo de modo que clientes Ouinet possam semeá-lo. Isso significa que quando o conteúdo volta para o cliente, ele é posteriormente analizado e se o servidor de origem indicou que é de natureza privada, o Ceno também não irá semeá-lo.
ur: امید ہے نہیں. جیسا کہ اوپر ذکر کیا گیا ہے ، CENO براؤزر انجکشن کی کسی بھی درخواست سے کسی بھی نجی ڈیٹا (پاس ورڈز ، کوکیز ...) کو ہٹانے کی سخت کوشش کرتا ہے۔اس کے علاوہ، انجیکٹر خود کوئی سیڈنگ نہیں كرتا۔ درحقیقت، اس کا واحد مقصد مواد پر دستخط کرنا ہے تاکہ Ouinet کلائنٹ اسے سیڈ کر سکیں۔ اس کا مطلب ہے کہ جب مواد کلائنٹ کے پاس واپس آتا ہے، تو اس کا مزید تجزیہ کیا جاتا ہے، اور اگر اصل سرور نے اشارہ کیا کہ یہ نجی نوعیت کا ہے، تو CENO اسے بھی سیڈ نہیں كرے گا۔

source: Still, there could be cases of badly designed or malicious pages which may collect some information from you (like an email address in a form or some browser fingerprints using JavaScript) and stuff it in another link URL as normal path components (e.g. `http://example.com/subscribe/you@example.org`). If you suspect that a page may be doing that, better be on the safe side and use Personal browsing for it.
de: Dennoch kann es Fälle von schlecht gestalteten oder bösartigen Seiten geben, die einige Informationen von Ihnen sammeln (z. B. eine E-Mail-Adresse in einem Formular oder einige Browser-Fingerabdrücke mithilfe von JavaScript) und sie in eine andere Link-URL als normale Pfadkomponenten (z. B. `http://example.com/subscribe/you@example.org`) einfügen. Wenn Sie den Verdacht haben, dass eine Seite dies tut, gehen Sie besser auf Nummer sicher und verwenden Sie den privaten Browser für diese Seite.
es: Aún así, pudiera haber casos de páginas pobremente diseñadas o maliciosas las cuales podrían recolectar alguna información sobre tí (como una dirección electrónica en un formulario o algunas huellas digitales del navegador usando JavaScript) e incluirlas en otro vínculo URL como componentes normales de la ruta (ej., `http://example.com/subscribe/you@example.org`). Si sospechas que una página podría estar haciendo eso, mejor elegir el lado seguro y usar la navegación personal para ella.

source: Can the origin server know whether I am using Ceno?
ar: هل يمكن للخادم الأصلي معرفة ما إذا كنت أستخدم Ceno؟
de: Kann der Ursprungsserver wissen, ob ich Ceno verwende?
es: ¿Puede el servidor de origen saber si estoy usando Ceno?
fr: Le serveur d'origine peut-il savoir si j'utilise Ceno ?
id: Bisakah server asal mengetahui apakah saya menggunakan Ceno?
pt: O servidor de origem pode saber se uso o Ceno?
ur: کیا اصل سرور جان سکتا ہے کہ آیا میں CENO استعمال کر رہا ہوں؟

source: Most probably not. Whenever Ceno contacts an origin server directly, it behaves as normal Firefox for Android does, so your particular device appears as a normal Firefox app of the same version.
ar: على الأرجح لا. عندما يتصل Ceno بخادم أصلي مباشرة ، فإنه يتصرف كمتصفح فايرفوكس العادي على أندرويد، لذلك يظهر جهازك كتطبيق فايرفوكس عادي من نفس الإصدار.
de: Höchstwahrscheinlich nicht. Wann immer Ceno einen Ursprungsserver direkt kontaktiert, verhält es sich wie ein normaler Firefox für Android, so dass Ihr spezielles Gerät als normale Firefox-App der gleichen Version erscheint.
es: Muy probablemente no. Cada vez que Ceno contacta un servidor de origen directamente, se comporta como lo hace un Firefox para Android normal, por lo que tu dispositivo particular aparece como una aplicación Firefox normal de la misma versión.
fr: Probablement pas. Lorsque Ceno contacte directement un serveur d'origine, il se comporte normalement, comme Firefox pour Android le ferait, de sorte que votre appareil a l'apparence d'une application Firefox normale de la même version.
id: Kemungkinan besar tidak. Setiap kali Ceno menghubungi server asal secara langsung, ia berperilaku seperti Firefox biasa untuk Android, sehingga perangkat Anda muncul sebagai aplikasi Firefox biasa dengan versi yang sama.
pt: É mais provável que não. No momento em que o Ceno contata um servidor de origem diretamente, ele se comporta como um Firefox para Android comum, então o seu aparelho específico aparece como uma app normal do Firefox da mesma versão.
ur: غالباً نہیں۔ جب بھی CENO کسی اوریجن سرور سے براہ راست رابطہ کرتا ہے، تو یہ اینڈرائیڈ کے لیے عام فائر فاکس کی طرح برتاؤ کرتا ہے، لہذا آپ کا مخصوص ڈیوائس اسی ورژن کی ایک عام فائر فاکس ایپ کے طور پر ظاہر ہوتا ہے۔

source: However, when it uses an injector to get some content from its origin server, there are (at least) two ways for the latter to know that Ceno or Ouinet is involved:
ar: ومع ذلك، عندما يستخدم حاقناً للحصول على بعض المحتوى من خادمه الأصلي، فهناك (على الأقل) طريقتان لكي يعرف الأخير أن Ceno أو Ouinet متورطان:
de: Wenn er jedoch einen Injektor verwendet, um Inhalte von seinem Herkunftsserver zu erhalten, gibt es (mindestens) zwei Möglichkeiten für letzteren zu wissen, dass Ceno oder Ouinet beteiligt ist:
es: Sin embargo, cuando usa un inyector para obtener algún contenido desde su servidor de origen, hay (al menos) dos maneras para que este sepa que Ceno o Ouinet están involucrados:
fr: Cependant, lorsqu'il utilise un injecteur pour obtenir du contenu depuis son serveur d'origine, il y existe (au moins) deux façons pour ce dernier de savoir si Ceno ou Ouinet est impliqué :
id: Namun, ketika menggunakan injektor untuk mendapatkan beberapa konten dari server asalnya, ada (setidaknya) dua cara untuk mengetahui bahwa Ceno atau Ouinet terlibat:
pt: Contudo, ao utilizar um injetor para obter conteúdo do seu servidor de origem, há (pelo menos) duas formas de o último saber que o Ceno ou a Ouinet estão envolvidos:
ur: تاہم، جب یہ اپنے اصل سرور سے کچھ مواد حاصل کرنے کے لیے انجیکٹر کا استعمال کرتا ہے، تو مؤخر الذکر کے لیے یہ جاننے کے (کم از کم) دو طریقے ہیں کہ CENO یا Ouinet ملوث ہے:

source: The source address of the connection reaching the origin server is found in the injector swarm (since the connection comes indeed from the injector);
ar: بالعثور على عنوان مصدر الاتصال الذي يصل إلى الخادم الأصلي في سرب الحاقن (بما أن الاتصال يأتي بالفعل من الحاقن)؛
de: Die Quelladresse der Verbindung, die den Ursprungsserver erreicht, wird im Schwarm des Injektors gefunden (da die Verbindung tatsächlich vom Injektor kommt);
es: La dirección primitiva de la conexión llegando al servidor de origen se encuentra en el enjambre de inyectores (ya que la conexión viene de hecho desde el inyector);
fa: نشانی منبع اتصالی که به سرور اصلی می‌رسد در انبوهه‌یinjector یافت می‌شود (از آنجا که اتصال در حقیقت از خود injector برمی‌آید)؛
fr: L'adresse source de la connexion atteignant le serveur d'origine se trouve dans l'essaim d'injecteurs (puisque la connexion provient bien de l'injecteur) ;
id: Alamat sumber koneksi yang mencapai server asal ditemukan di kumpulan injektor (karena koneksi memang berasal dari injektor);
my: မူလဆာဗာသို့ ရောက်ရှိလာသော ဆက်သွယ်မှု၏ ပင်ရင်းလိပ်စာကို ထိုးသွင်းစက်စာရင်းတွင် ရှာတွေ့နိုင်ပါသည် (ဆက်သွယ်မှုသည် ထိုးသွင်းစက်မှ အမှန်တကယ်လာသောကြောင့် ဖြစ်သည်)။
pt: O endereço source da conexão alcançando o servidor de origem é encontrado no enxame de injetores (já que a conexão vem, de fato, do injetor);
ru: Исходный адрес соединения, достигающего сервера происхождения, находится в узле инъекторов (поскольку соединение действительно исходит от инъектора);
uk: Адреса джерела з'єднання з вихідним сервером є адресою одного з ін'єкторів (оскільки з'єднання дійсно походить від ін'єктора);
ur: اصل سرور تک پہنچنے والے کنکشن کا ماخذ پتہ انجیکٹر بھیڑ میں پایا جاتا ہے (چونکہ کنکشن واقعی انجیکٹر سے آتا ہے);

source: The presence or absence of certain information in the request for content is characteristic of Ouinet. This happens when the injector is requesting the content because your client asked it to retrieve and sign that content, as the injector removes information unique to your particular device from the request.
ar: وجود أو عدم وجود معلومات محددة في طلب المحتوى هو سمة من سمات Ouinet تساعد في تحديده. يحدث هذا عندما يطلب الحاقن محتوىً لأن عميلك طلب منه استرداد هذا المحتوى وتوقيعه، حيث يزيل الحاقن المعلومات الفريدة لجهازك الخاص من الطلب.
de: Das Vorhandensein oder Nichtvorhandensein bestimmter Informationen in der Inhaltsanforderung ist charakteristisch für Ouinet. Dies geschieht, wenn der Injektor den Inhalt anfordert, weil Ihr Kunde ihn gebeten hat, diesen Inhalt abzurufen und zu signieren, da der Injektor Informationen, die nur für Ihr spezielles Gerät gelten, aus der Anforderung entfernt.
es: La presencia o ausencia de cierta información en la solicitud de contenido es característica de Ouinet. Esto pasa cuando el inyector está solicitando el contenido porque tu cliente le pidió que descargue y firme ese contenido, ya que el inyector remueve de la solicitud información única a tu dispositivo en particular.
fa: حضور یا غیابِ اطلاعاتِ معین در درخواستِ محتوا خاصیت ویژه‌ی Ouinet است. این زمانی روی می‌دهد که injector محتوا را درخواست می‌کند چون سرویس‌گیرنده‌ی شما از آن خواسته است که آن محتوا را بازیابی و امضا کند، همان‌طور که injector اطلاعات بی‌همتا به دستگاه خاص‌تان را از درخواست حذف می‌کند.
fr: La présence ou l’absence de certains renseignements dans la demande de contenu caractérise Ouinet. Cela se produit quand l’injecteur demande le contenu parce que votre client lui a demandé de récupérer et de signer ce contenu, car l’injecteur supprime de la demande les renseignements propres à votre appareil particulier.
my: အကြောင်းအရာတောင်းဆိုချက်တွင် တချို့သောအချက်အလက်များ ပါဝင်ခြင်း သို့မဟုတ် ပျောက်ဆုံးနေခြင်းသည် Ouinet ၏ ထူးခြားသော လက္ခဏာ ဖြစ်သည်။ သင့်လက်ခံစက်က အကြောင်းအရာကိုရယူပြီး လက်မှတ်ထိုးရန် တောင်းဆိုသောကြောင့် ထိုးသွင်းစက်သည် ထိုအကြောင်းအရာကို တောင်းဆိုချက်တွင် သင်၏ သီးသန့်ကိရိယာနှင့်သာ သက်ဆိုင်သော အချက်အလက်များကို ဖယ်ရှားလိုက်သောအခါတွင် ဖြစ်လေ့ရှိပါသည်။
pt: A presença ou ausência de certas informações na solicitação de conteúdo é característica da Ouinet. Isso acontece quando o injetor solicita o conteúdo porque o seu cliente pediu-lhe para recuperar e assinar aquele conteúdo, já que o injetor remove da solicitação informações exclusivas do seu aparelho específico.
ru: Наличие или отсутствие определенной информации в запросе на получение контента характерно для Ouinet. Это происходит, когда инъектор запрашивает содержимое, потому что ваш клиент попросил его получить и подписать это контент, поскольку инъектор удаляет из запроса информацию, уникальную для вашего конкретного устройства.
uk: Наявність або відсутність певної інформації в запиті на отримання контенту може характеризувати запит, що прийшов від Ouinet. Це відбувається, коли ін'єктор запитує вміст, тому що ваш клієнт попросив його отримати і підписати цей контент, оскільки ін'єктор видаляє з запиту унікальну інформацію вашого конкретного пристрою.
ur: مواد کی درخواست میں کچھ معلومات کی موجودگی یا غیر موجودگی Ouinet کی خصوصیت ہے۔ایسا اس وقت ہوتا ہے جب انجیکٹر مواد کی درخواست کر رہا ہوتا ہے کیونکہ آپ کے کلائنٹ نے اسے اس مواد کو بازیافت کرنے اور اس پر دستخط کرنے کو کہا تھا، کیونکہ انجیکٹر درخواست سے آپ کے مخصوص ڈیوائس کے لیے منفرد معلومات کو ہٹا دیتا ہے۔

source: Please note that these only mark the request as coming from Ouinet, but they do not link it to you or your particular device. However, if the request did for some of the reasons mentioned in the previous question still contain some personally identifiable information, it could be used to mark you as a Ceno user.
ar: يرجى ملاحظة أن هذا يحدد فقط الطلب على أنه قادم من Ouinet، لكنه لا يربطه بك أو بجهازك المحدد. ومع ذلك، و لسبب من الأسباب المذكورة في السؤال السابق قد يكون الطلب لا يزال يحتوي على بعض معلومات التعريف الشخصية، حينها يمكن استخدامها لتمييزك كمستخدم Ceno.
de: Bitte beachten Sie, dass diese nur die Anfrage als von Ouinet stammend kennzeichnen, aber sie nicht mit Ihnen oder Ihrem speziellen Gerät in Verbindung bringen. Sollte die Anfrage jedoch aus einem der in der vorherigen Frage genannten Gründe dennoch personenbezogene Daten enthalten, könnten diese verwendet werden, um Sie als Ceno-Nutzer zu kennzeichnen.
es: Por favor ten en cuenta que estas solamente marcan la solicitud como proviniente desde Ouinet, pero no las vinculan a tí o a tu dispositivo en particular. Sin embargo, si la solicitud aún contenía alguna información personalmente identificable por algunas de las razones mencionadas en la pregunta previa, pudiera ser usada para marcarte como usuaria(o) de Ceno.
fr: Veuillez noter qu’elles ne font que marquer la demande comme provenant de Ouinet, mais elles ne la relient pas à vous ni à votre appareil particulier. Toutefois, si, pour l’une des raisons mentionnées dans la question précédente, la demande contenait encore des renseignements personnels, ils pourraient être utilisés pour vous identifier en tant qu’utilisateur de Ceno.
id: Harap perhatikan bahwa ini hanya menandai permintaan sebagai berasal dari Ouinet, tetapi tidak menautkannya ke Anda atau perangkat Anda. Namun, jika permintaan muncul karena beberapa alasan yang telah disebutkan dalam pertanyaan sebelumnya masih berisi beberapa informasi identitas pribadi, itu dapat digunakan untuk menandai Anda sebagai pengguna Ceno.
pt: Por favor, observe que essas maneiras apenas marcam a solicitação como advinda da Ouinet, mas não a conectam a si ou ao seu aparelho específico. No entanto, se a solicitação por alguma das razões mencionadas nas questões anteriores ainda contém algumas informações passíveis de identificação pessoal, ela poderia ser usada para o marcar como um utilizador do Ceno.
ur: براہ کرم نوٹ کریں کہ یہ صرف Ouinet سے آنے والی درخواست کو نشان زد کرتے ہیں، لیکن وہ اسے آپ یا آپ کے مخصوص ڈیوائس سے نہیں جوڑتے ۔ تاہم ، اگر پچھلے سوال میں بیان کردہ کچھ وجوہات کی وجہ سے درخواست میں اب بھی کچھ ذاتی طور پر قابل شناخت معلومات موجود ہیں تو ، اسے آپ کو CENO صارف کے طور پر نشان زد کرنے کے لئے استعمال کیا جاسکتا ہے۔

source: In general, if a particular website (such as a governmental site) expects you to connect to it as an identifiable individual, from a specific region (or from a [national intranet][National intranet]), we recommend that you use a normal Web browser instead of Ceno.
ar: بشكل عام، إذا كان موقع إلكتروني معين (مثل موقع حكومي) يتوقع منك الاتصال كفرد يمكن التعرف عليه، من منطقة معينة (أو من [الإنترانت الوطني][الإنترانت الوطني])، فإننا نوصي باستخدام متصفح الويب العادي بدلاً من Ceno.
de: Wenn eine bestimmte Website (z. B. eine Regierungsseite) von Ihnen erwartet, dass Sie sich als identifizierbare Person aus einer bestimmten Region (oder aus einem [nationalen Intranet][nationalen Intranet]) mit ihr verbinden, empfehlen wir Ihnen, einen normalen Webbrowser statt Ceno zu verwenden.
es: En general, si un sitio web en particular (tal como un sitio gubernamental) espera que te conectes a él como individuo identificable, desde una región específica (o desde una [intranet nacional][intranet nacional]), recomendamos que uses un navegador Web normal en vez de Ceno.
fr: De manière générale, si un site web (comme un site gouvernemental) attend de vous que vous soyez identifiable en tant qu'individu, à partir d'une région spécifique (ou d'un [intranet national][National intranet]), nous vous recommandons d'utiliser un navigateur web classique au lieu de Ceno.
id: Secara umum, jika situs web tertentu (seperti situs pemerintah) mengharapkan Anda terhubung ke situs tersebut sebagai individu yang dapat diidentifikasi, dari wilayah tertentu (atau dari [intranet nasional][Intranet nasional]), sebaiknya gunakan peramban web biasa, bukan Ceno.
pt: Em geral, se um website em particular (tais como websites do governo) espera que se conecte a ele como um indivíduo identificável, de uma região específica (ou de uma [intranet nacional][intranet nacional]), recomendamos que use um navegador Web comum ao invés do Ceno.
ur: عام طور پر، اگر کوئی خاص ویب سائٹ (جیسے کہ ایک سرکاری سائٹ) آپ سے یہ توقع کرتی ہے کہ آپ اس سے ایک قابل شناخت فرد کے طور پر، کسی مخصوص علاقے سے (یا [قومی انٹرانیٹ][National intranet]) سے جڑیں گے، تو ہم تجویز کرتے ہیں کہ آپ CENO کے بجائے ایک عام ویب براؤزر استعمال کریں۔

source: As a seeder
ar: كموزّع
de: Als Entsender
es: Como sembrador(a)
fa: به‌عنوان یک بذرپاش
fr: En tant que diffuseur
id: Sebagai penyebar
my: တင်ပို့သူအဖြစ်
pt: Como um semeador
ru: В качестве раздающего
uk: Роздача контенту
ur: بطور سیڈر

source: What data is seeded from my device?
ar: ما هي البيانات التي يتم توزيعها من جهازي؟
de: Welche Daten werden von meinem Gerät übertragen?
es: ¿Qué datos son sembrados desde mi dispositivo?
fa: چه داده‌ای از دستگاه من بذرپاشی می‌شود؟
fr: Quelles sont les données diffusées à partir de mon appareil ?
id: Data apa yang disebarkan dari perangkatku?
my: ကျွန်ုပ်၏စက်မှ မည်သည့်ဒေတာကို စုဆောင်းထားသနည်း။
pt: Quais dados são semeados a partir do meu aparelho?
ru: Какие данные передаются с моего устройства?
uk: Які дані роздаються з мого пристрою?
ur: میرے ڈیوائس سے کون سا ڈیٹا سیڈ کیا جاتا ہے؟

source: Currently, the only content that is seeded by Ceno is any non-private Web content which was requested in public browsing mode. This also means that users do not seed anything they have not accessed themselves in the recent past.
ar: في الوقت الحالي، المحتوى الوحيد الذي يتم توزيعه بواسطة Ceno هو محتوى الويب غير الخاص الذي تم طلبه في وضع التصفح العام. هذا يعني أيضاً أن المستخدمين لا يقومون بتوزيع أي شيء لم يصلوا إليه مؤخرًا بأنفسهم.
de: Derzeit werden von Ceno nur nicht-private Webinhalte, die im öffentlichen Browsing-Modus angefordert wurden, weitergegeben. Das bedeutet auch, dass die Nutzer nichts weitergeben, was sie nicht selbst in der jüngsten Vergangenheit aufgerufen haben.
es: Actualmente, el único contenido que es sembrado por Ceno es cualquier contenido Web no privado que fue solicitado en modo de navegación pública. Esto también significa que la(o)s usuaria(o)s no siembran nada que no hayan accedido ella(o)s mismos en el pasado reciente.
fr: Actuellement, le seul contenu diffusé par Ceno est le contenu web non privé demandé en mode de navigation publique. Cela signifie en outre que les utilisateurs ne diffusent pas de contenu auquel ils n'ont pas déjà accédé eux-mêmes.
id: Saat ini, satu-satunya konten yang disebar oleh Ceno yaitu konten web nonprivat yang diminta dalam mode penjelajahan publik. Ini berarti juga bahwa pengguna tidak menyebarkan apa pun yang belum mereka akses sendiri di masa lalu.
pt: Atualmente, o único conteúdo semeado pelo Ceno é qualquer conteúdo Web não privativo que foi requisitado no modo de navegação pública. Isso significa, também, que utilizadores não semeiam nada que eles não tenham eles mesmos acededo num passado recente.
ur: فی الحال، واحد مواد جو CENO کے ذریعہ سیڈ کیا گیا ہے وہ کوئی بھی غیر نجی ویب مواد ہے جس کی درخواست عوامی براؤزنگ موڈ میں کی گئی تھی۔ اس کا مطلب یہ بھی ہے کہ صارفین کسی ایسی چیز کوسیڈ نہیں كرتےجس تک انہوں نے ماضی قریب میں خود رسائی حاصل نہیں کی ہو۔

source: Can an anyone find out what I seed?
ar: هل يمكن لأي شخص أن يكتشف ما أوزِّعه؟
de: Kann jemand herausfinden, was ich verteilt (seed) habe?
es: ¿Cualquiera puede descubrir lo que siembro?
fa: آیا کسی می‌تواند پی برد که من چه بذری می‌پاشم؟
fr: Quelqu'un peut-il savoir ce que je diffuse ?
id: Bisakah seseorang mengetahui apa yang saya sebarkan?
my: ကျွန်ုပ်တင်ပို့ထားသော အကြောင်းအရာကို တစ်စုံတစ်ယောက်မှ ရှာတွေ့နိုင်ပါသလား။
pt: Alguém pode descobrir o que semeio?
ru: Может ли кто-нибудь узнать, что я раздаю?
uk: Чи може хто-небудь дізнатися, що я роздаю?
ur: کیا کوئی یہ جان سکتا ہے کہ میں کیا سیڈ كرتا ہوں؟
