Repository: censorship-no/ceno-docs
Catalog: user-manual/*/concepts/risks.po
Languages: ar, de, es, fa, fr, id, my, pt, ru, uk, ur

source: Currently, the only content that is seeded by CENO is any non-private Web content which was requested in public browsing mode. This also means that users do not seed anything they have not accessed themselves in the recent past.
my: လက်ရှိတွင် CENO မှ တင်ပို့သော အကြာင်းအရာများမှာ အများသုံးရှာဖွေခြင်းမုဒ်တွင် တောင်းဆိုထားသော သီးသန့်သုံးမဟုတ်သည့် ဝဘ်အကြောင်းအရာများသာ ဖြစ်ပါသည်။ ဆိုလိုသည်မှာ အသုံးပြုသူများသည် လတ်တလောတွင် မသုံးထားသည့် မည်သည့်အကြောင်းအရာကိုမျှ မတင်ပို့ပါ။
ru: В настоящее время единственным контентом, который загружается CENO, является любой неприватный веб-контент, который был запрошен в режиме публичного просмотра. Это также означает, что пользователи не выкладывают ничего, к чему они сами не обращались в последнее время.
uk: Нині єдиний контент, що роздає CENO — це будь-який неприватний веб-контент, що був запитаний в режимі публічного перегляду. Це також означає, що користувачі не роздають нічого, до чого вони не мали доступу останнім часом.

source: Yes, every CENO Browser able to communicate with injectors will register its IP address in the bridge swarm where other Ouinet clients can find them.
my: ရှာတွေ့နိုင်ပါသည်။ ထိုးသွင်းစက်များနှင့် ချိတ်ဆက်နိုင်သော CENO ဘရောက်ဇာ အားလုံးသည် ၎င်း၏ IP လိပ်စာကို ပေါင်းကူးလက်ခံစက်စာရင်းတွင် မှတ်ပုံတင်ရပါမည်။ ထိုပေါင်းကူးလက်ခံစက်စာရင်းတွင် အခြားသော Ouinet လက်ခံစက်များသည် IP လိပ်စာများကို ရှာတွေ့နိုင်ပါသည်။
ru: Да, каждый Браузер CENO, способный общаться с инъекторами, регистрирует свой IP-адрес в рое мостов, где другие клиенты Ouinet могут их найти.
uk: Так, кожен браузер CENO, здатний спілкуватися з ін'єкторами, реєструє свою IP-адресу в «рої» мостів, де інші клієнти Ouinet можуть їх знайти.

source: As with any sufficiently complex computing system, and especially such an innovative one, using the CENO Browser (and any Ouinet client in general) is not free from some risks. In this section we will compile and describe them to help you understand their implications according to the different roles you may play when using CENO:
ru: Как и с любой достаточно сложной системой, а особенно такой новаторской, использование Браузера CENO (и вообще любого клиента Ouinet) не обойдётся без некоторых рисков. В этом разделе мы соберем и опишем их, чтобы помочь вам понять их последствия в зависимости от различных ролей, которые вы можете играть при использовании CENO:
uk: Як і з будь-якою досить складною системою, а особливо такою новаторською, використання браузера CENO (і взагалі будь-якого клієнта Ouinet) не обійдеться без певних ризиків. У цьому розділі ми зберемо та опишемо ці ризики, щоб допомогти вам зрозуміти їхні наслідки залежно від різних ролей, які ви можете на себе приміряти під час використання CENO:

source: Hopefully not. As mentioned above, the CENO Browser tries hard to remove any private data (passwords, cookies…) from any request for injection. In addition, the injector does not itself do any seeding; in fact, its sole purpose is to sign content so that Ouinet clients can seed it. This means that when the content comes back to the client, it is further analyzed, and if the origin server indicated that it is of a private nature, CENO will not seed it either.
ru: Надеемся, что нет. Как упоминалось выше, Браузер CENO изо всех сил старается удалить любые личные данные (пароли, куки...) из любого запроса на инъекцию. Кроме того, инъектор не раздает данные сам; фактически, его единственная цель — подписать содержимое, чтобы клиенты Ouinet могли его раздавать. Это означает, что когда контент возвращается к клиенту, он подвергается дальнейшему анализу, и если исходный сервер указал, что контент имеет приватный характер, CENO не будет раздавать его.
uk: Сподіваємось, що ні. Як згадувалося вище, браузер CENO щосили намагається видалити будь-які особисті дані (паролі, cookies...) з будь-якого запиту на ін'єкцію. Крім того, ін'єктор не роздає дані сам; фактично, його єдина мета — підписати вміст, щоб клієнти Ouinet могли його роздавати. Це означає, що коли контент повертається до клієнта, цей контет аналізується, і якщо вихідний сервер вказав, що контент має приватний характер, CENO не роздаватиме його.
