Repository: censorship-no/ceno-docs
Catalog: user-manual/*/concepts/risks.po
Languages: ar, de, es, fa, fr, id, my, pt, ru, uk, ur

source: Risks in using Ceno/Ouinet
ar: مخاطر استخدام Ceno/Ouinet
de: Risiken bei der Nutzung von Ceno/Ouinet
es: Riesgos al usar Ceno/Ouinet
fr: Risques inhérents à Ceno et Ouinet
id: Risiko dalam menggunakan Ceno/Ouinet
pt: Riscos em usar Ceno/Ouinet
ur: CENO/Ouinet استعمال کرنے میں خطرات

source: As with any sufficiently complex computing system, and especially such an innovative one, using Ceno Browser (and any Ouinet client in general) is not free from some risks. In this section we will compile and describe them to help you understand their implications according to the different roles you may play when using Ceno:
ar: كما هو الحال مع أي نظام حوسبة معقد، لاسيما الأنظمة المبتكرة حديثة العهد، فإن استخدام متصفح Ceno (و بشكل عام أي عميل Ouinet) لا يخلو من بعض المخاطر.سنقوم في هذا القسم بتجميع هذه المخاطر ووصفها لمساعدتك على فهم آثارها وفقاً للدور الذي قد تلعبه عند استخدام Ceno:
de: Wie bei jedem hinreichend komplexen Computersystem, und insbesondere bei einem so innovativen System, ist die Verwendung des Ceno-Browsers (und jedes Ouinet-Clients im Allgemeinen) nicht frei von einigen Risiken. In diesem Abschnitt werden wir sie zusammenstellen und beschreiben, um Ihnen zu helfen, ihre Auswirkungen je nach den verschiedenen Rollen, die Sie bei der Verwendung von Ceno spielen, zu verstehen:
es: Como con cualquier sistema de computación suficientemente complejo, y especialmente uno tan innovador, el uso del Navegador Ceno (y cualquier cliente Ouinet en general) no está libre de algunos riesgos. En esta sección los compilaremos y describiremos para ayudarte a entender sus implicaciones de acuerdo a los diferentes roles que podrías jugar cuando uses Ceno:
fr: Comme pour tout système informatique suffisamment complexe et surtout aussi innovant, l’utilisation du Navigateur Ceno (et de n’importe quel client Ouinet en général) n’est pas exempte de certains risques. Dans cette section, nous les rassemblerons et les décrirons pour vous aider à comprendre leurs implications en fonction des différents rôles que pourriez jouer lors de l’utilisation de Ceno :
id: Seperti halnya sistem komputasi yang cukup kompleks, dan terutama yang inovatif, menggunakan Peramban Ceno (dan klien Ouinet pada umumnya) tidak terbebas dari beberapa risiko. Di bagian ini kami akan menyusun dan menjelaskannya untuk membantu Anda dalam memahami implikasinya sesuai dengan peran yang mungkin Anda mainkan saat menggunakan Ceno:
pt: Como ocorre com todo o sistema de computação suficientemente complexo, especialmente um tão inovador, o uso do Navegador Ceno (e qualquer cliente Ouinet em geral) não é isento de riscos. Nesta secção, compilaremos e descreveremos tais riscos para o ajudar a entender as suas implicações de acordo com os diferentes papéis que pode desempenhar ao usar o Ceno:
ur: جیسا کہ کسی بھی کافی پیچیدہ کمپیوٹنگ سسٹم کے ساتھ، اور خاص طور پر اس طرح کے جدید نظام کے ساتھ، CENO براؤزر (اور عام طور پر کوئی Ouinet کلائنٹ) کا استعمال کچھ خطرات سے خالی نہیں ہے۔ اس سیکشن میں ہم ان کو مرتب کریں گے اور بیان کریں گے تاکہ آپ کو ان کے مضمرات کو مختلف کرداروں کے مطابق سمجھنے میں مدد ملے جو آپ CENO استعمال کرتے وقت ادا کر سکتے ہیں:

source: as a *user* browsing Web sites
ar: كـ *مستخدم* يتصفح مواقع الويب
de: als *Benutzer* beim Surfen auf Websites
es: como *usuaria(o)* navegando sitios Web
fa: به‌عنوان یک *کاربر* که سایت‌های وب را مرور می‌کند
fr: en tant qu’*utilisateur* qui parcourt des sites Web
id: sebagai *pengguna* yang menjelajahi situs web
my: ဝက်ဘ်ဆိုက်များကို ရှာဖွေသည့် *သုံးစွဲသူ* အနေနှင့်
pt: como um *utilizador* navegando por websites
ru: как *пользователь*, просматривающий веб-сайты
uk: як *користувач*, який переглядає веб-сайти
ur: بطور ایک *صارف* براؤزنگ ویب سائٹس

source: as a *seeder* sharing content over the distributed cache that you previously visited
ar: كـ *موزع* يشارك المحتوى الذي قمت بزيارته مسبقاً عبر ذاكرة التخزين المؤقت الموزعة
de: als *Sender*, der Inhalte über den verteilten Cache teilt, die Sie zuvor besucht haben
es: como *sembrador(a)* compartiendo contenido a través de la caché distribuída que visitaste previamente
fa: به‌عنوان یک *بذرپاش* که محتوایی را روی کش توزیع‌شده به اشتراک می‌گذارد که شما پیش‌تر از آن بازدید کرده‌اید
fr: en tant que *propagateur* qui partage sur le cache distribué du contenu qu vous avez déjà visité
id: sebagai *seeder* yang membagikan konten melalui tembolok terdistribusi yang Anda kunjungi sebelumnya
my: သင် ယခင်က ဝင်ကြည့်ခဲ့သော ဖြန့်ချိထားသည့် ယာယီသိမ်းဆည်းထားသော မှတ်ဉာဏ်ဖြင့် အကြောင်းအရာ မျှဝေသည့် *ပေးပို့သူ* အနေနှင့်
pt: como um *semeador* partilhando através do cache distribuído conteúdo visitado anteriormente
ru: как *раздающий*, распространяющий страницы, которые вы ранее посещали, через распределенный кэш
uk: як *поширювач*, що розповсюджує сторінки через розподілений кеш, які ви раніше відвідували
ur: ایک *سیڈر* کے طور پر تقسیم شدہ کیش پر مواد کا اشتراک کرنا جسے آپ پہلے دیکھ چکے ہیں

source: as a *bridge* allowing other users to reach an injector
ar: كـ *جسر* يسمح للمستخدمين الآخرين بالوصول إلى حاقن
de: als *Brücke*, die es anderen Nutzern ermöglicht, einen Injektor zu erreichen
es: como *puente* permitiendo a otra(o)s usuaria(o)s alcanzar un inyector
fa: به‌عنوان یک *پل* یه کاربران دیگر اجازه‌ی دسترسی به یک injector را دادن
fr: en tant que *pont* qui permet aux autres utilisateurs d’atteindre un injecteur
id: sebagai *jembatan* yang mengizinkan pengguna lain untuk menjangkau injektor
my: အခြားသုံးစွဲသူများ ထိုးသွင်းဖိုင်သို့ ရောက်ရှိရန် ခွင့်ပြုသော *ပေါင်းကူး* အနေနှင့်
pt: como uma *ponte* permitindo a outros utilizadores alcançar um injetor
ru: как *мост*, позволяющий другим пользователям получить доступ к инъектору
uk: як *міст*, що дозволяє іншим користувачам отримати доступ до ін'єктора
ur: ایک *پل* کے طور پر دوسرے صارفین کو انجیکٹر تک پہنچنے کی اجازت دیتا ہے

source: As a user
ar: كمستخدم
de: Als Benutzer
es: Como usuaria(o)
fa: به‌عنوان یک کاربر
fr: En tant qu’utilisateur
id: Sebagai pengguna
my: သုံးစွဲသူအနေနှင့်
pt: Como um utilizador
ru: Как пользователь
uk: Як користувач
ur: بطور ایک صارف

source: Can bridges see my communication with the origin server?
ar: هل يمكن للجسور رؤية اتصالاتي بالخادم الأصلي؟
de: Können Brücken meine Kommunikation mit dem Ursprungsserver sehen?
es: ¿Pueden los puentes ver mis comunicaciones con el servidor de origen?
fa: آیا پل‌ها می‌توانند ارتباط من با سرور اصلی را مشاهده کنند؟
fr: Les ponts peuvent-ils voir ma communication avec le serveur d’origine ?
id: Bisakah jembatan melihat komunikasiku dengan server asal?
my: ပေါင်းကူးများသည် မူလ ဆာဗာနှင့် ကျွန်ုပ်၏ ဆက်သွယ်မှုကို မြင်နိုင်သလား။
pt: As pontes podem ver as minhas comunicações com o servidor de origem?
ru: Могут ли мосты видеть мое взаимодействие с исходным сервером?
uk: Чи можуть мости бачити дані, отримані з вихідного сервера (або передані до нього)?
ur: کیا پل اصل سرور کے ساتھ میری بات چیت کو دیکھ سکتے ہیں؟

source: No. The only role of a bridge is to forward raw traffic between a client and an injector. This communication is always encrypted and bridges do not have the private keys required to access the content of the communication.
ar: لا، الدور الوحيد للجسر هو إعادة توجيه حركة مرور البيانات الأولية بين العميل والحاقن. يتم تشفير هذا الاتصال دائماً ولا تمتلك الجسور المفاتيح الخاصة المطلوبة للوصول إلى محتوى الاتصال.
de: Nein. Die einzige Aufgabe einer Bridge ist die Weiterleitung des Rohdatenverkehrs zwischen einem Client und einem Injektor. Diese Kommunikation ist immer verschlüsselt, und die Brücken verfügen nicht über die privaten Schlüssel, die für den Zugriff auf den Inhalt der Kommunikation erforderlich sind.
es: No. El único rol de un puente es redirigir el tráfico en bruto entre un cliente y un inyector. Esta comunicación siempre está cifrada y los puentes no tienen las claves privadas requeridas para acceder al contenido de las comunicaciones.
fa: نه. تنها نقش یک پل پیش‌راندن ترافیک خام بین یک سرویس‌گیرنده و یک injector است. این ارتباط همیشه رمزگذاری‌شده است و پل‌ها کلیدهای خصوصی لازم برای دسترسی به محتوای این ارتباط را در اختیار ندارند.
fr: Non. Le seul rôle d’un pont est de transmettre le trafic brut entre un client et un injecteur. Cette communication est toujours chiffrée et les ponts ne disposent pas des clés privées nécessaires pour accéder au contenu de la communication.
id: Tidak. Satu-satunya peran jembatan adalah untuk meneruskan lalu lintas mentah antara klien dan injektor. Komunikasi ini selalu terenkripsi dan jembatan tak memiliki kunci privat yang dibutuhkan untuk mengakses isi dari komunikasi tersebut.
my: မမြင်ရပါ။ ပေါင်းကူးတစ်ခု၏ တာဝန်မှာ လက်ခံစက်နှင့် ထိုးသွင်းစက်တို့အကြား သွားလာမှု အကြမ်းထည်ကို ပို့ပေးရန်သာဖြစ်သည်။ ဤကူးသန်းသွားလာမှုကို အမြဲတမ်း ကုဒ်ဖြင့်ပြောင်းလဲထားပြီး ပေါင်းကူးများတွင် ကူးသန်းသွားလာမှု၏ အကြောင်းအရာကို ကြည့်ရှုရန်လိုအပ်သော ကိုယ်ပိုင်သော့များ မရှိပါ။
pt: Não. O único papel de uma ponte é encaminhar tráfego bruto entre um cliente e um injetor. Esta comunicação é sempre criptografada e as pontes não possuem as chaves privadas necessárias para aceder o conteúdo das comunicações.
ru: Нет. Единственная роль моста заключается в передаче необработанного трафика между клиентом и инъектором. Эта связь всегда шифруется, и мосты не имеют закрытых ключей, необходимых для доступа к содержимому связи.
uk: Ні. Єдина роль мосту полягає у передачі необробленого трафіку між клієнтом та інєктором. Цей зв'язок завжди шифрується і мости не мають закритих ключів, необхідних для доступу до вмісту зв'язку.
ur: نہیں، پل کا واحد کردار کلائنٹ اور انجیکٹر کے درمیان خام ٹریفک کو آگے بڑھانا ہے۔ یہ بات چیت ہمیشہ انکرپٹڈ ہوتی ہے اور پل کے پاس مواصلات کے مواد تک رسائی کے لیے درکار نجی کلیدیں نہیں ہوتیں۔

source: Can injectors see my communication with the origin server?
ar: هل يمكن للحاقنين رؤية اتصالاتي بالخادم الأصلي؟
de: Können Injektoren meine Kommunikation mit dem Ursprungsserver sehen?
es: ¿Pueden los inyectores ver mis comunicaciones con el servidor de origen?
fa: آیا injectorها می‌توانند ارتباط من با سرور اصلی را مشاهده کنند؟
fr: Les injecteurs peuvent-ils voir ma communication avec le serveur d’origine ?
id: Bisakah injektor melihat komunikasiku dengan server asal?
my: ထိုးသွင်းဖိုင်များသည် မူလ ဆာဗာနှင့် ကျွန်ုပ်၏ ဆက်သွယ်မှုကို မြင်နိုင်သလား။
pt: Os injetores podem ver minhas comunicações com o servidor de origem?
ru: Могут ли инъекторы видеть мое общение с исходным сервером?
uk: Чи можуть ін'єктори бачити дані, отримані з вихідного сервера (або передані до нього)?
ur: کیا انجیکٹرز میری اصل سرور کے ساتھ بات چیت دیکھ سکتے ہیں؟

source: Yes and no. When the user requests content [in public browsing mode](public-private.md), all private data (like passwords and cookies) is first removed from the request by the client, and only then is the request encrypted for and forwarded to the injector, which proceeds to decrypt it.
ar: نعم و لا. عندما يطلب المستخدم المحتوى [في وضع التصفح العام](public-private.md)، يتم أولاً إزالة جميع البيانات الخاصة (مثل كلمات المرور وملفات تعريف الارتباط) من الطلب من قبل العميل، وعندها فقط يتم تشفير الطلب وإعادة توجيهه إلى الحاقن، الذي يشرع في فك تشفيره.
de: Ja und nein. Wenn der Nutzer Inhalte [im öffentlichen Browsing-Modus] (public-private.md) anfordert, werden zunächst alle privaten Daten (wie Kennwörter und Cookies) vom Client aus der Anforderung entfernt, und erst dann wird die Anforderung verschlüsselt und an den Injektor weitergeleitet, der sie dann entschlüsselt.
es: Sí y no. Cuando el/la usuaria(o) solicita contenido [en el modo de navegación pública](public-private.md), todos los datos privados (como contraseñas y cookies) son primero removidos de la solicitud por el cliente, y sólo entonces la solicitud es cifrada y redirigida hacia el inyector, el cual procede a descifrarla.
fa: بله و خیر. وقتی کاربر محتوایی را درخواست می‌کند [در حالت مرور عمومی](public-private.md)، تمام داده‌های خصوصی (مانند رمزهای عبور و کوکی‌ها) در درجه‌ی نخست به‌وسیله‌ی سرویس‌گیرنده از درخواست او حذف می‌شوند، و فقط پس از آن است که درخواست رمزگذاری می‌شود و به injector پیش رانده می‌شود، که در ادامه آن را رمزگشایی می‌کند.
fr: Oui et non, Quand l’utilisateur demande un contenu [en mode de navigation publique](public-private.md), toutes les données privées (telles que les mots de passe et les témoins) sont d’abord supprimées de la demande par le client et ce n’est qu’ensuite que la demande est chiffrée et transmise à l’injecteur, qui procède au déchiffrement.
id: Ya dan tidak. Saat pengguna meminta konten [di mode penjelajahan publik](public-private.md), semua data privat (seperti kata sandi dan kuki) pertama-tama dihapus terlebih dahulu dari permintaan oleh klien, baru setelah itu permintaan tersebut dienkripsi dan diteruskan kepada injektor, yang mana akan mendekripsinya.
my: တချို့တစ်ဝက်ကို မြင်နိုင်ပါသည်။ အသုံးပြုသူမှ အကြောင်းအရာကို [အများသုံးရှာဖွေခြင်းမုဒ်](public-private.md) တွင် တောင်းဆိုသောအခါ လက်ခံစက်၏ တောင်းဆိုချက်တွင်ပါဝင်သော ကိုယ်ရေးကိုယ်တာ အချက်အလက်အားလုံး (စကားဝှက်များနှင့် ကွတ်ကီးများ အစရှိသည်) ကို အရင်ဆုံး ဖယ်ရှားလိုက်ပါသည်။ ထို့နောက် တောင်းဆိုချက်ကို ကုဒ်ဖြင့်ပြောင်းလဲပြီးမှ ကုဒ်ပြန်ဖြည်နိုင်သော ထိုးသွင်းစက်ဆီသို့ ပို့ပေးပါသည်။
pt: Sim e não. Quando um utilizador solicita conteúdo [no modo de navegação pública](public-private.md), todos os dados privados (como palavras-passe e cookies) são primeiro removidos da solicitação pelo cliente e somente então a solicitação é criptografada e encaminhada para o injetor, o qual prossegue com a decodificação.
ru: И да, и нет. Когда пользователь запрашивает контент [в режиме публичного просмотра] (public-private.md), все личные данные (такие как пароли и cookies) сначала удаляются из запроса клиентом, и только затем запрос шифруется и передается инъектору, который приступает к его расшифровке.
uk: І так і ні. Коли користувач запитує контент [в режимі публічного перегляду](public-private.md), всі особисті дані (такі як паролі та cookies) спочатку видаляються із запиту клієнтом, та лише потім запит шифрується і передається ін'єктору, що починає його розшифровку.
ur: ہاں اور نہیں. جب صارف [عوامی براؤزنگ موڈ میں]( public-private.md)مواد کی درخواست کرتا ہے ، تمام نجی ڈیٹا ( جیسے پاس ورڈ اور کوکیز ) کو پہلے کلائنٹ کی درخواست سے ہٹا دیا جاتا ہے, اور تب ہی درخواست کو انکرپٹ کیا جاتا ہے اور انجیکٹر کو بھیج دیا جاتا ہے ، جو اسے ڈیکرپٹ کرنے کے لئے آگے بڑھاتا ہے.

source: On the other hand, when the request uses Personal browsing mode, it is not modified by the client, but the whole communication is encrypted for the origin server. This means that in this other case the injector cannot decrypt the content.
de: Wird die Anfrage hingegen im privaten Modus gestellt, wird sie vom Client nicht verändert, sondern die gesamte Kommunikation wird für den Ursprungsserver verschlüsselt. Dies bedeutet, dass der Injektor in diesem anderen Fall den Inhalt nicht entschlüsseln kann.
es: Por otro lado, cuando la solicitud utiliza el modo de navegación personal, el cliente no la modifica, pero toda la comunicación queda cifrada para el servidor de origen. Esto significa que en este otro caso el inyector no puede descifrar el contenido.

source: **Technical note:** Only `GET` HTTP requests are candidates for injection, with query parameters removed, along with all but a limited set of fundamental and privacy-preserving HTTP header fields.
ar: **ملاحظة تقنية:** طلبات `GET` الخاصة ببروتوكول HTTP فقط مرشحة للحقن، حيث يتم إزالة معلمات الاستعلام، وأيضاً جميع حقول ترويسات HTTP باستثناء مجموعة محدودة من الحقول الأساسية والمحافِظة على الخصوصية .
de: **Technischer Hinweis:** Nur "GET"-HTTP-Anfragen kommen für die Injektion in Frage, wobei Abfrageparameter sowie alle bis auf eine begrenzte Anzahl grundlegender und die Privatsphäre schützender HTTP-Header-Felder entfernt werden.
es: **Nota técnica:** Solamente las solicitudes HTTP `GET` son candidatas para la inyección, con los parámetros de la consulta removidos, junto con todos excepto un conjunto limitado de campos de encabezados HTTP fundamentales y conservadores de la privacidad.
fa: **نکته‌ی فنی:** فقط درخواست‌های `GET` HTTP نامزدهایی برای injection هستند، با حذف پارامترهای پرسش، همراه با همه‌چیز غیر از مجموعه‌ی محدودی از قلمروهای اصلی بنیادین و حافظ حریم خصوصی HTTP.
fr: **Note technique :** Seules les demandes HTTP `GET` sont candidates à l’injection, les paramètres de la demande étant supprimés, ainsi que tous les champs d’en-tête HTTP, à l’exception d’un ensemble limité de champs fondamentaux et qui préservent la confidentialité.
id: **Catatan teknis:** Hanya permintaan HTTP 'GET' yang merupakan kandidat untuk injeksi, dengan parameter kueri yang dihapus bersama semua kecuali untuk satu set terbatas bidang kepala HTTP mengenai fundamental dan penjagaan privasi.
my: **နည်းပညာဆိုင်ရာ မှတ်ချက်** HTTP `GET` တောင်းဆိုချက်များသည်သာ ထိုးသွင်းခြင်းအတွက် ကိုယ်စားလှယ်လောင်းများ ဖြစ်ကြပါသည်။ အခြေခံကျပြီး ကိုယ်ရေးအချက်အလက်များကို ထိန်းသိမ်းပေးသော HTTP ခေါင်းစီးတန်ဖိုးများ၏ ကန့်သတ်ထားသော အစုံလိုက်မှလွဲ၍ ကျန်သော သတ်မှတ်ကိန်းများကို ဖယ်ထုတ်လိုက်ပါသည်။
pt: **Nota técnica:** Somente solicitações HTTP `GET` são candidatas para a injeção, com parâmetros de consulta removidos, junto com todos exceto um conjunto limitado de campos de cabeçalho HTTP fundamentais e que preservam a privacidade.
ru: **Техническое примечание:** Только HTTP-запросы `GET` являются кандидатами на внедрение, при этом параметры запроса удаляются, а также все поля заголовков HTTP, кроме ограниченного набора основных и сохраняющих конфиденциальность.
uk: **Технічна примітка:** Тільки HTTP-запити `GET` передаються ін'єкторам, при цьому видаляються параметри запиту, а також усі поля заголовків HTTP, крім обмеженого набору основних та зберігають конфіденційність заголовків.
ur: **تکنیکی نوٹ:** صرف GET` HTTP` درخواستیں انجکشن کے امیدوار ہیں ، جس میں سوالات کے پیرامیٹرز کو ہٹا دیا گیا ہے ، اس کے ساتھ بنیادی اور رازداری کو محفوظ رکھنے والے HTTP ہیڈر فیلڈز کے ایک محدود سیٹ کو چھوڑ دیا گیا ہے۔

source: Can injectors see my IP address?
ar: هل يمكن للحاقنين رؤية عنوان IP الخاص بي؟
de: Können Injektoren meine IP-Adresse sehen?
es: ¿Pueden los inyectores ver mi dirección IP?
fa: آیا injectorها می‌توانند نشانی IP مرا ببینند؟
fr: Les injecteurs peuvent-ils voir mon adresse IP ?
id: Bisakah injektor melihat alamat IP saya?
my: ထိုးသွင်းဖိုင်များသည် ကျွန်ုပ်၏ IP လိပ်စာကို မြင်နိုင်သလား။
pt: Injetores podem ver o meu endereço de IP?
ru: Могут ли инъекторы видеть мой IP-адрес?
uk: Чи можуть ін'єктори бачити мою IP-адресу?
ur: کیا انجیکٹرز میرا IP ایڈریس دیکھ سکتے ہیں؟

source: Yes. However, injectors cannot distinguish whether a request came from a Ceno user or a bridge. Thus requests going to the injector cannot be reliably assigned an originating IP addresses.
ar: نعم. ومع ذلك، لا يمكن للحاقنات التمييز بين ما إذا كان الطلب قادم من مستخدم Ceno أو من جسر. وبالتالي لا يمكن تحديد عناوين IP الأصلية للطلبات التي تذهب إلى الحاقن بشكل موثوق.
de: Ja. Allerdings können die Injektoren nicht unterscheiden, ob eine Anfrage von einem Ceno-Benutzer oder einer Bridge stammt. Daher können Anfragen, die an den Injektor gerichtet werden, nicht zuverlässig einer Ursprungs-IP-Adresse zugeordnet werden.
es: Sí. Sin embargo, los inyectores no pueden distinguir si una solicitud vino desde un(a) usuaria(o) de Ceno o un puente. Por lo que a las solicitudes yendo al inyector no se les puede asignar confiablemente una dirección IP de origen.
fr: Oui. Toutefois, les injecteurs ne peuvent pas faire la différence entre une demande qui provient d’un utilisateur de Ceno et une autre d’un pont. Les demandes adressées à l’injecteur ne peuvent donc pas se voir attribuer une adresse IP d’origine de manière fiable.
id: Ya. Namun injektor tidak bisa membedakan apakah permintaan datang dari pengguna Ceno atau dari jembatan. Dengan demikian, permintaan yang masuk ke injektor tidak dapat menetapkan IP asal secara andal.
pt: Sim. No entanto, injetores não podem distinguir se uma solicitação veio de um utilizador do Ceno ou de uma ponte. Logo, solicitações que vão para o injetor não podem confiavelmente ter um IP de origem lhe designado.
ur: جی ہاں. تاہم، انجیکٹرز یہ فرق نہیں کر سکتے کہ آیا درخواست CENO صارف کی طرف سے آئی ہے یا پل کی طرف سے. اس طرح انجیکٹر کے پاس جانے والی درخواستوں کو قابل اعتماد طریقے سے ابتدائی IP ایڈریس تفویض نہیں کیا جا سکتا۔

source: Can my private data leak to the distributed cache?
ar: هل يمكن أن تتسرب بياناتي الخاصة إلى ذاكرة التخزين المؤقت الموزعة؟
de: Können meine privaten Daten in den verteilten Cache gelangen?
es: ¿Pueden mis datos privados filtrarse a la caché distribuída?
fa: آیا داده‌های خصوصی من می‌توانند به کش توزیع‌شده درز کنند؟
fr: Mes données privées peuvent-elles être divulguées au cache distribué ?
id: Bisakah data pribadi saya bocor ke tembolok terdistribusi?
my: ကျွန်ုပ်၏ သီးသန့် ဒေတာသည် ဖြန့်ချိထားသော ယာယီသိမ်းဆည်းထားသည့် မှတ်ဉာဏ်သို့ ပေါက်ကြားနိုင်သလား။
pt: Os meus dados privados podem vazar para o cache distribuído?
ru: Могут ли мои личные данные просочиться в распределенный кэш?
uk: Чи можуть мої особисті дані потрапити в розподілений кеш?
ur: کیا میرا ذاتی ڈیٹا تقسیم شدہ کیش میں لیک ہوسکتا ہے؟
