Repository: censorship-no/ceno-docs
Catalog: user-manual/*/SUMMARY.po
Languages: ar, de, el, es, fa, fr, id, my, pl, pt, ru, sv, tr, uk, ur

source: Summary
ar: ملخّص
de: Zusammenfassung
el: Περίληψη
es: Resumen
fa: چکیده
fr: Résumé
id: Ringkasan
my: အကျဉ်းချုပ်
pl: Streszczenie
pt: Sumário
ru: Оглавление
sv: Sammanfattning
tr: Özet
uk: Зміст
ur: خلاصہ

source: [Introduction](intro/README.md)
ar: [مقدمة](intro/README.md)
de: [Einleitung](intro/README.md)
el: [Εισαγωγή](intro/README.md)
es: [Introducción](intro/README.md)
fa: [مقدمه](intro/README.md)
id: [Pengantar](intro/README.md)
my: [မိတ်ဆက်](intro/README.md)
pl: [Wprowadzenie](intro/README.md)
pt: [Introdução](intro/README.md)
ru: [Введение](intro/README.md)
sv: [Introduktion](intro/README.md)
tr: [Giriş](intro/README.md)
uk: [Вступ](intro/README.md)
ur: [تعارف](intro/README.md)

source: [What is CENO Browser?](intro/ceno.md)
el: [Τι είναι ο φυλλομετρητής CENO;](intro/ceno.md)

source: [What is Ouinet?](intro/ouinet.md)
ar: [ما هو Ouinet؟](intro/ouinet.md)
de: [Was ist Ouinet?](intro/ouinet.md)
el: [Τι είναι το Ouinet;](intro/ouinet.md)
es: [¿Qué es Ouinet?](intro/ouinet.md)
fa: [Ouinet چیست؟](intro/ouinet.md)
fr: [Qu’est-ce que Ouinet ?](intro/ouinet.md)
id: [Apa itu Ouinet?](intro/ouinet.md)
my: [Ouinet ဆိုတာ ဘာလဲ။](intro/ouinet.md)
pl: [Czym jest Ouinet?](intro/ouinet.md)
pt: [O que é Ouinet?](intro/ouinet.md)
ru: [Что такое Ouinet?](intro/ouinet.md)
sv: [Vad är Ouinet?](intro/ouinet.md)
tr: [Ouinet nedir?](intro/ouinet.md)
uk: [Що таке Ouinet?](intro/ouinet.md)
ur: [Ouinet کیا ہے؟](intro/ouinet.md)

source: [Quick start guide](intro/qsg.md)
ar: [دليل البدء السريع](intro/qsg.md)
de: [Kurzanleitung] (intro/qsg.md)
el: [Οδηγός γρήγορης εκκίνησης](intro/qsg.md)
es: [Guía de inicio rápido](intro/qsg.md)
fa: [راهنمای شروع سریع](intro/qsg.md)
fr: [Guide de démarrage](intro/qsg.md)
id: [Panduan memulai](intro/qsg.md)
my: [အမြန် စတင်မှု လမ်းညွှန်](intro/qsg.md)
pl: [Skrócona instrukcja obsługi](intro/qsg.md)
pt: [Guia para Início Rápido](intro/qsg.md)
ru: [Краткое руководство](intro/qsg.md)
tr: [Hızlı başlama rehberi](intro/qsg.md)
uk: [Короткий посібник](intro/qsg.md)
ur: [فوری آغاز گائیڈ](intro/qsg.md)

source: [Frequently Asked Questions](intro/faq.md)
ar: [الأسئلة الشائعة](intro/faq.md)
de: [Häufig gestellte Fragen (FAQ)](intro/faq.md)
el: [Συχνές ερωτήσεις](intro/faq.md)
es: [Preguntas Más Frecuentes](intro/faq.md)
fa: [پرسش‌های متداول](intro/faq.md)
fr: [Foire aux questions](intro/faq.md)
id: [Pertanyaan yang sering diajukan](intro/faq.md)
my: [မေးလေ့ရှိသော မေးခွန်းများ](intro/faq.md)
pl: [Często Zadawane Pytania](intro/faq.md)
pt: [Perguntas Mais Frequentes](intro/faq.md)
ru: [Часто задаваемые вопросы](intro/faq.md)
sv: [Frekvent Ställda Frågor](intro/faq.md)
tr: [Sıkça sorulan sorular](intro/faq.md)
uk: [Часті питання](intro/faq.md)
ur: [اکثر پوچھے گئے سوالات](intro/faq.md)

source: [Main concepts](concepts/README.md)
ar: [المفاهيم الأساسية](concepts/README.md)
de: [Hauptkonzepte](concepts/README.md)
el: [Κύριες έννοιες](concepts/README.md)
es: [Conceptos principales](concepts/README.md)
fa: [مفاهیم اصلی](concepts/README.md)
fr: [Principaux concepts](concepts/README.md)
id: [Konsep utama](konsep/README.md)
my: [အဓိက အယူအဆများ](concepts/README.md)
pl: [Glówne koncepcje](concepts/README.md)
pt: [Conceitos Principais](concepts/README.md)
ru: [Основные понятия](concepts/README.md)
sv: [Huvudkoncept](concepts/README.md)
tr: [Temel kavramlar](concepts/README.md)
uk: [Основні поняття](concepts/README.md)
ur: [مرکزی تصورات](concepts/README.md)

source: [How does it work?](concepts/how.md)
ar: [كيف يعمل؟](concepts/how.md)
de: [Wie funktioniert es?](concepts/how.md)
el: [Πώς λειτουργεί;](concepts/how.md)
es: [¿Cómo funciona?](concepts/how.md)
fa: [این مرورگر چگونه کار می‌کند؟](concepts/how.md)
fr: [Comment ça fonctionne ?](concepts/how.md)
id: [Bagaimana cara kerjanya?](concepts/how.md)
my: [ဘယ်လို အလုပ်လုပ်သလဲ။](concepts/how.md)
pl: [Jak to działa?](concepts/how.md)
pt: [Como funciona?](concepts/how.md)
ru: [Как это работает?](concepts/how.md)
sv: [Hur fungerar det?](concepts/how.md)
tr: [Nasıl çalışıyor?](concepts/how.md)
uk: [Як це працює?](concepts/how.md)
ur: [یہ کیسے کام کرتا ہے؟](concepts/how.md)

source: [Public vs. private browsing](concepts/public-private.md)
el: [Δημόσια έναντι ιδιωτικής περιήγησης](concepts/public-private.md)
es: [Navegación pública vs. privada](concepts/public-private.md)
fa: [مقایسه‌ی مرور عمومی و خصوصی](concepts/public-private.md)
fr: [La navigation publique comparée à la navigation privée](concepts/public-private.md)
id: [Browsing publik vs. pribadi](concepts/public-private.md)
my: [အများသုံးနှင့် သီးသန့် ရှာဖွေမှု](concepts/public-private.md)
pl: [Publiczne kontra prywatne przeglądanie](concepts/public-private.md)
sv: [Publik mot privat surfning](concepts/public-private.md)
tr: [Herkese açık ve gizli gezinme karşılaştırması](concepts/public-private.md)
uk: [Публічний чи приватний перегляд сторінок](concepts/public-private.md)
ur: [عوامی بمقابلہ نجی براؤزنگ](concepts/public-private.md)

source: [Advantages of using CENO/Ouinet](concepts/advantages.md)
el: [Πλεονεκτήματα χρήσης του CENO/Ouinet](concepts/advantages.md)
es: [Ventajas de usar CENO/Ouinet](concepts/advantages.md)
uk: [Переваги використання CENO/Ouinet](concepts/advantages.md)

source: [Risks in using CENO/Ouinet](concepts/risks.md)
el: [Κίνδυνοι κατά τη χρήση του CENO/Ouinet](concepts/risks.md)
es: [Riesgos al usar CENO/Ouinet](concepts/risks.md)
uk: [Ризики під час використання CENO/Ouinet](concepts/risks.md)

source: [Using CENO Browser](browser/README.md)
el: [Χρήση του φυλλομετρητή CENO](browser/README.md)

source: [Installing CENO](browser/install.md)
el: [Εγκατάσταση του CENO](browser/install.md)
es: [Instalando CENO](browser/install.md)
uk: [Встановлювання CENO](browser/install.md)

source: [Using public or private browsing](browser/public-private.md)
de: [Verwenden des öffentlichen oder privaten Surfens] (Browser/Public-private.md)
el: [Χρήση δημόσιας ή ιδιωτικής περιήγησης](browser/public-private.md)
es: [Usando navegación pública o privada](browser/public-private.md)
fa: [استفاده از مرور عمومی یا خصوصی](browser/public-private.md)
fr: [Naviguer de façon publique ou privée](browser/public-private.md)
id: [Menggunakan browsing publik atau pribadi](browser/public-private.md)
my: [အများသုံး သို့မဟုတ် သီးသန့် ရှာဖွေမှုကို အသုံးပြုခြင်း](browser/public-private.md)
pl: [Używanie publicznego lub prywatnego przeglądania](browser/public-private.md)
pt: [Usar navegação pública ou privativa](browser/public-private.md)
sv: [Att använda publik eller privat surfning](browser/public-private.md)
tr: [Herkese açık ya da gizli gezinmeyi kullanmak](browser/public-private.md)
uk: [Використання публічного або приватного перегляду](browser/public-private.md)
ur: [عوامی یا نجی براؤزنگ کا استعمال کرتے ہوئے](browser/public-private.md)

source: [CENO settings](browser/settings.md)
el: [Ρυθμίσεις CENO](browser/settings.md)
es: [Configuración de CENO](browser/settings.md)
uk: [Налаштування CENO](browser/settings.md)

source: [Testing the Browser](browser/testing.md)
ar: [اختبار المتصفح](browser/testing.md)
de: [Den Browser testen](browser/testing.md)
el: [Δοκιμή του προγράμματος περιήγησης](browser/testing.md)
es: [Probando el navegador](browser/testing.md)
fa: [آزمایش مرورگر](browser/testing.md)
fr: [Tester le navigateur](browser/testing.md)
id: [Menguji Browser](browser/testing.md)
my: [ဘရောက်ဇာ စမ်းသပ်ခြင်း](browser/testing.md)
pl: [Testowanie przeglądarki](browser/testing.md)
pt: [Testar o Navegador](browser/testing.md)
ru: [Тестирование браузера](browser/testing.md)
sv: [Att testa navigatorn](browser/testing.md)
tr: [Tarayıcıyı denemek](browser/testing.md)
uk: [Тестування браузера](browser/testing.md)
ur: [براؤزر کی جانچ کرنا](browser/testing.md)

source: [Helping others](browser/bridging.md)
ar: [مساعدة الآخرين](browser/bridging.md)
de: [Anderen helfen](Browser/Bridging.md)
el: [Βοηθώντας άλλους](browser/bridging.md)
es: [Ayudando a otros](browser/bridging.md)
fa: [کمک به دیگران](browser/bridging.md)
fr: [Aider les autres](browser/bridging.md)
id: [Membantu Orang Lain](browser/bridging.md)
my: [အခြားသူများအား ကူညီခြင်း](browser/bridging.md)
pl: [Pomaganie innym](browser/bridging.md)
pt: [Ajudar outras pessoas](browser/bridging.md)
ru: [Помощь другим](browser/bridging.md)
sv: [Hjälp andra](browser/bridging.md)
tr: [Başkalarına yardım etmek](browser/bridging.md)
uk: [Допомога іншим](browser/bridging.md)
ur: [دوسروں کی مدد کرنا](browser/bridge.md)

source: [Troubleshooting](browser/troubleshooting.md)
ar: [استكشاف الاخطاء](browser/troubleshooting.md)
de: [Fehlerbehebung](browser/troubleshooting.md)
el: [Αντιμετώπιση προβλημάτων](browser/troubleshooting.md)
es: [Solución de problemas](browser/troubleshooting.md)
fa: [شناسایی و رفع اشکال](browser/troubleshooting.md)
fr: [Dépannage](browser/troubleshooting.md)
id: [Pemecahan Masalah](browser/troubleshooting.md)
my: [ပြဿနာ ဖြေရှင်းခြင်း](browser/troubleshooting.md)
pl: [Rozwiązywanie problemów](browser/troubleshooting.md)
pt: [Solução de problemas](browser/troubleshooting.md)
ru: [Устранение неполадок](browser/troubleshooting.md)
sv: [Felsökning](browser/troubleshooting.md)
tr: [Sorun gidermek](browser/troubleshooting.md)
uk: [Усунення несправностей](browser/troubleshooting.md)
ur: [خرابیوں کا سراغ لگانا](browser/troubleshooting.md)

source: [Annex: The Ouinet client front-end](client/front-end.md)
ar: [ملحق: الواجهة الأمامية للعميل Ouinet](client/front-end.md)
de: [Anhang: Das Ouinet-Client-Frontend](client/front-end.md)
el: [Παράρτημα: Η διεπαφή του πελάτη Ouinet](client/front-end.md)
es: [Anexo: La interfaz del cliente Ouinet](client/front-end.md)
fa: [پیوست: فرانت‌اند سرویس‌گیرنده‌ی Ouinet](client/front-end.md)
fr: [Annexe : La page frontale du client Ouinet](client/front-end.md)
id: [Lampiran: Bagian depan klien Ouinet](client/front-end.md)
my: [နောက်ဆက်တွဲ- Ouinet လက်ခံစက် သုံးစွဲသူ ကြားခံစနစ်](client/front-end.md)
pt: [Anexo: o cliente front-end da Ouinet](client/front-end.md)
ru: [Приложение: Внешний интерфейс клиента Ouinet](client/front-end.md)
sv: [Annex: Framänden för Oiunet-klienten](client/front-end.md)
tr: [Ek: Ouinet istemcisi ön yüzü](client/front-end.md)
uk: [Додаток: Зовнішній інтерфейс клієнта Ouinet](client/front-end.md)
ur: [ملحقہ: Ouinet کلائنٹ فرنٹ اینڈ](client/front-end.md)

source: [What is Ceno Browser?](intro/ceno.md)
ar: [ما هو متصفح Ceno؟](intro/ceno.md)
de: [Was ist der Ceno Browser?](intro/ceno.md)
fr: [Qu’est-ce que le Navigateur Ceno ?](intro/ceno.md)
id: [Apa itu Browser Ceno?](intro/ceno.md)
my: [Ceno ဘရောက်ဇာဆိုတာ ဘာလဲ။](intro/ceno.md)
pt: [O que é o Navegador Ceno?](intro/ceno.md)
ru: [Что такое Браузер Ceno?](intro/ceno.md)

source: [Advantages of using Ceno/Ouinet](concepts/advantages.md)
ar: [مزايا استخدام Ceno/Ouinet](concepts/advantages.md)
de: [Vorteile der Verwendung von Ceno/Ouinet](concepts/advantages.md)
fr: [Avantages de l’utilisation de Ceno et Ouinet](concepts/advantages.md)
id: [Keuntungan menggunakan Ceno/Ouinet](concepts/advantages.md)
my: [Ceno/Ouinet အသုံးပြုခြင်း၏ အားသာချက်များ](concepts/advantages.md)
pt: [Vantagens de usar Ceno/Ouinet](concepts/advantages.md)
ru: [Преимущества использования Ceno/Ouinet](concepts/advantages.md)

source: [Risks in using Ceno/Ouinet](concepts/risks.md)
ar: [مخاطر استخدام Ceno/Ouinet](concepts/risks.md)
de: [Risiken bei der Verwendung von Ceno/Ouinet](concepts/risks.md)
fr: [Risques inhérents à Ceno et Ouinet](concepts/risks.md)
id: [Risiko dalam menggunakan Ceno/Ouinet](concepts/risks.md)
my: [Ceno/Ouinet အသုံးပြုခြင်း၏ အန္တရာယ်များ](concepts/risks.md)
pt: [Riscos de usar Ceno/Ouinet](concepts/risks.md)
ru: [Риски при использовании Ceno/Ouinet](concepts/risks.md)

source: [Using Ceno Browser](browser/README.md)
ar: [إستخدام متصفح Ceno](browser/README.md)
de: [Ceno Browser verwenden](browser/README.md)
fr: [Utiliser le Navigateur Ceno](browser/README.md)
id: [Menggunakan Browser Ceno](browser/README.md)
my: [Ceno ဘရောက်ဇာ အသုံးပြုခြင်း](browser/README.md)
pt: [Usar o Navegador Ceno](browser/README.md)
ru: [Использование Браузера Ceno](browser/README.md)

source: [Installing Ceno](browser/install.md)
ar: [تثبيت Ceno](browser/install.md)
de: [Ceno installieren](browser/install.md)
fr: [Installer Ceno](browser/install.md)
id: [Memasang Ceno](browser/install.md)
my: [Ceno ထည့်သွင်းခြင်း](browser/install.md)
pt: [Instalar o Ceno](browser/install.md)
ru: [Установка Ceno](browser/install.md)

source: [Ceno settings](browser/settings.md)
ar: [إعدادات Ceno](browser/settings.md)
de: [Ceno-Einstellungen](browser/settings.md)
fr: [Paramètres de Ceno](browser/settings.md)
id: [Pengaturan Ceno](browser/settings.md)
my: [Ceno ဆက်တင်များ](browser/settings.md)
pt: [Configurações do Ceno](browser/settings.md)
ru: [Настройки Ceno](browser/settings.md)

source: [What is the CENO Browser?](intro/ceno.md)
uk: [Що таке браузер CENO?](intro/ceno.md)

source: [Using the CENO Browser](browser/README.md)
uk: [Використання браузера CENO](browser/README.md)
