Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/bridging.po
Languages: ar, el, es, fa, fr, id, my, pt_br, ru, tr, uk

source: If your computer supports [Docker containers][docker], you can run a pre-configured Ceno client on it to act as a bridge. If Docker is not yet installed, please follow the instructions to [install the Docker Engine][docker-install] in your platform. For Debian derivatives like Ubuntu or Linux Mint, you can just run: `sudo apt install docker.io`
ar: إذا كان جهاز الكمبيوتر الخاص بك يدعم [حاويات دوكر][docker]، فيمكنك تشغيل عميل Ceno عليه تم تهيئته مسبقًا ليكون بمثابة جسر. إذا لم يتم تثبيت دوكر بعد، فالرجاء اتباع التعليمات لـ [تثبيت محرك دوكر][docker-install] في منصتك. بالنسبة لمشتقات دبيان مثل أوبونتو أو لينكس مينت، يمكنك فقط تشغيل: `sudo apt install docker.io`
fa: اگر کامپیوترتان [Docker containers][docker] را پشتیبانی می‌کند، می‌توانید یک سرویس‌گیرنده‌ی از پیش تنظیم‌شده‌ی Ceno را روی آن اجرا کنید تا نقش یک پل را ایفا کند. اگر Docker هنوز نصب نشده است، لطفاً راهنمای [نصب Docker Engine][docker-install] در پلتفرم‌تان را دنبال کنید. برای مشتقات Debian مثل Ubuntu یا Linux Mint می‌توانید فقط همین را اجرا کنید: `sudo apt install docker.io`
id: Jika komputer Anda mendukung [Kontainer Docker][docker], Anda dapat menjalankan klien Ceno yang telah dikonfigurasi sebelumnya untuk bertindak sebagai jembatan. Jika Docker belum diinstal, harap ikuti petunjuk untuk [memasang Docker Engine][pemasangan Docker] di platform Anda. Untuk turunan Debian seperti Ubuntu atau Linux Mint, Anda cukup menjalankan: `sudo apt install docker.io`
ru: Если ваш компьютер поддерживает [контейнеры Docker][docker], вы можете запустить на нем предварительно настроенный клиент Ceno для работы в качестве моста. Если Docker еще не установлен, следуйте инструкциям по [установке Docker Engine][docker-install] на вашей платформе. В производных дистрибутивах Debian, таких как Ubuntu или Linux Mint, вы можете просто запустить: `sudo apt install docker.io`
tr: Bilgisayarınız [Docker depoları][docker] kullanabiliyorsa, köprü olarak çalışması için yapılandırılmış Ceno istemcisi çalıştırabilirsiniz. Docker kurulu değilse bilgisayarınıza uygun [Docker yazılımını kurmak][docker-install] için yönergelere bakabilirsiniz. Debian tabanlı Ubuntu ya da Linux Mint gibi sistemler için, şu komutu yürütmeniz yeterlidir: `sudo apt install docker.io`
uk: Якщо Ваш компʼютер підтримує [контейнери Docker][docker], Ви можете запустити попередньо налаштований клієнт Ceno для роботи в режимі «міст». Якщо Docker ще не встановлено, дотримуйтесь інструкцій [як встановити Docker Engine][docker-install] на Вашій платформі. У похідних дистрибутивах Debian, таких як Ubuntu або Linux Mint, можна просто запустити: `sudo apt install docker.io`

source: To deploy a Ceno client container you only need to run the following command on a terminal (it looks scary but you can just copy and paste it as is on the command line):
ar: لنشر حاوية عميل Ceno، ما عليك سوى تشغيل الأمر التالي على محطة (يبدو الأمر مخيفًا ولكن يمكنك نسخه ولصقه كما هو في سطر الأوامر):
fa: برای به‌کارگیری و استقرار یک نگه‌دارنده‌ مخاطب در Ceno فقط لازم است این فرمان را روی یک پایانه اجرا کنید (به نظر ترسناک می‌آید اما می‌توانید به‌سادگی آن را روی نوار فرمان کپی کنید):
id: Untuk menerapkan kontainer klien Ceno, Anda hanya perlu menjalankan perintah berikut di terminal (kelihatannya menakutkan tetapi Anda dapat menyalin dan menempelkannya seperti yang ada di baris perintah):
ru: Чтобы распаковать контейнер клиента Ceno, достаточно выполнить следующую команду в терминале (она выглядит устрашающе, но вы можете просто скопировать и вставить ее как есть в командную строку):
tr: Ceno istemcisini depoda çalıştırmak için şu komutu uçbirim uygulamanızda yürütmeniz yeterlidir (korkutucu görünüyor ama kopyalayıp komut satırına yapıştırabilirsiniz):
uk: Щоб розпакувати контейнер клієнта Ceno, достатньо виконати наступну команду в терміналі (вона виглядає лячно, але Ви можете просто скопіювати та вставити її в командний рядок):

source: The command will start a container named `ceno-client` that will run on every boot unless you explicitly tell it to stop. Please check the [Ceno Docker client documentation][ceno-client-doc] for more information on how to manipulate the container.
ar: سيبدأ الأمر حاوية تسمى `ceno-client` والتي سيتم تشغيلها عند كل بدء تشغيل ما لم تطلب منها التوقف. يرجى مراجعة [وثائق دوكر عميل Ceno][ceno-client-doc] للحصول على مزيد من المعلومات حول كيفية التعامل مع الحاوية.
ru: Команда запустит контейнер с именем `ceno-client`, который будет запускаться при каждой загрузке, пока вы не остановите его. Пожалуйста, ознакомьтесь с [документацией клиента Docker Ceno][ceno-client-doc] для получения дополнительной информации о том, как управлять контейнером.
tr: Bu komut, durdurulmadığı sürece her açılışta `ceno-client` adında bir depo başlatır. Deponun yönetimi hakkında ayrıntılı bilgi almak için [Ceno Docker istemcisi belgeleri][ceno-client-doc] bölümüne bakabilirsiniz.
uk: Команда запустить контейнер із назвою `ceno-client`, який запускатиметься при кожному завантаженні, доки Ви не зупините цю команду. Будь ласка, ознайомтеся з [документацією клієнта Docker Ceno][ceno-client-doc] для отримання додаткової інформації про те, як керувати контейнером.

source: **Note:** This client has no *Ceno Settings*: when instructed below to access that page, open instead the [client front-end](../client/front-end.md), which contains mostly equivalent information.
ar: **ملاحظة:** هذا العميل ليس لديه *إعدادات Ceno*: عندما يُطلب منك أدناه الوصول إلى تلك الصفحة، افتح بدلاً من ذلك [واجهة المستخدم](../client/front-end.md)، والتي تحتوي في الغالب على معلومات مماثلة.
fa: **نکته:** این سرویس‌گیرنده هیچ *تنظیمات خاصی برای Ceno* ندارد: وقتی در پایین از شما خواسته شد تا به آن صفحه دسترسی پیدا کنید، به جای [client front-end](../client/front-end.md) را باز کنید، که حاوی اطلاعاتی کم‌وبیش همسان است.
id: **Catatan:** Klien ini tidak memiliki *Pengaturan Ceno*: saat diperintahkan untuk mengakses halaman tersebut, buka [bagian depan klien](../client/front-end.md), yang sebagian besar berisi informasi yang setara.
ru: **Примечание:** У этого клиента нет *настроек Ceno*: когда ниже будут даны указания перейти на страницу настроек, откройте вместо этого [интерфейс клиента](../client/front-end.md), который по большей части содержит ту же информацию.
tr: **Not:** Bu istemcinin *Ceno ayarları* yoktur: Aşağıda ayarlara erişmeniz istendiğinde, neredeyse aynı bilgilerin bulunduğu [istemci ön yüzünü](../client/front-end.md) açın.
uk: **Примітка:** У цього клієнта немає *налаштувань Ceno*: коли нижче будуть надані вказівки перейти на сторінку налаштувань, замість цього відкрийте [інтерфейс клієнта](../client/front-end.md), який здебільшого містить ту саму інформацію.

source: [UPnP][UPnP] is the easiest way of making your Ceno Browser (or computer client) reachable to the Ceno network. The [Ceno Settings](settings.md) page will indicate the UPnP status on your local network.
ar: [UPnP][UPnP] هي أسهل طريقة لجعل متصفح Ceno (أو عميل الكمبيوتر) قابلاً للوصول عبر شبكة Ceno. ستشير صفحة [إعدادات Ceno](settings.md) إلى حالة UPnP على شبكتك المحلية.
fa: [UPnP][UPnP] راحت ترین راه برای این است که مرورگر Ceno (یا کامپیوتر سرویس‌گیرنده) خود را به شبکه Ceno متصل کنید. صفحه‌ی [تنظیمات Ceno](settings.md) وضعیت UPnP را روی شبکه محلی شما نشان می‌دهد.
id: [UPnP][UPnP] adalah cara termudah untuk membuat Peramban Ceno (atau klien komputer) Anda dapat dijangkau oleh jaringan Ceno. Halaman [Pengaturan Ceno](settings.md) akan menunjukkan status UPnP di jaringan lokal Anda.
ru: [UPnP][UPnP] - это самый простой способ сделать ваш Браузер Ceno (или клиент для компьютера) доступным для сети Ceno. На странице [Ceno Settings](settings.md) будет указан статус UPnP в вашей локальной сети.
tr: [UPnP][UPnP], Ceno Browser uygulamanızın Ceno ağına erişilebilir olmasını sağlamanın en kolay yoludur. [Ceno ayarları](settings.md) bölümünde yerel ağınızdaki UPnP durumunu görebilirsiniz.
uk: [UPnP][UPnP] – це найпростіший спосіб зробити Ваш браузер Ceno (або клієнт для компʼютера) доступним для мережі Ceno. На сторінці [налаштування Ceno](settings.md) буде зазначено стан UPnP у Вашій локальній мережі.

source: The status below indicates that UPnP is likely working and Ceno is currently verifying connectivity:
ar: تشير الحالة أدناه إلى أن UPnP يعمل على الأرجح وأن Ceno يتحقق حاليًا من الاتصال:
fa: وضعیت زیر نشان می‌دهد که UPnP به احتمال زیاد در حال کار است و Ceno نیز در حال تایید اتصال است:
id: Status di bawah ini menunjukkan bahwa UPnP kemungkinan berfungsi dan Ceno saat ini sedang memverifikasi konektivitas:
ru: Состояние ниже указывает на то, что UPnP, вероятно, работает, и Ceno в настоящее время проверяет возможность подключения:
tr: Aşağıdaki durum UPnP özelliğinin büyük olasılıkla çalıştığını ve bağlantının Ceno tarafından denetlendiğini gösterir:
uk: Стан нижче вказує на те, що UPnP, ймовірно, працює, і Ceno зараз перевіряє можливість підключення:

source: The status below indicates that UPnP is working and you can bridge connections for other Ceno users:
ar: تشير الحالة أدناه إلى أن UPnP يعمل ويمكنك ربط الاتصال بمستخدمي Ceno الآخرين:
fa: وضعیت زیر نشان می‌دهد که UPnP در حال کار است و شما نیز می‌توانید برای دیگر کاربران Ceno پل اتصال بزنید:
id: Status di bawah ini menunjukkan bahwa UPnP berfungsi dan Anda dapat menjembatani koneksi untuk pengguna Ceno lainnya:
ru: Состояние ниже означает, что UPnP работает, и вы можете создавать мостовые соединения для других пользователей Ceno:
tr: Aşağıdaki durum UPnP özelliğinin çalıştığını ve bağlantıların diğer Ceno kullanıcılarına köprü olarak aktarılabileceğini gösterir:
uk: Стан нижче означає, що UPnP працює і Ви можете створювати мостові зʼєднання для інших користувачів Ceno:

source: **Note:** Even if UPnP is working, your router may still not be reachable from the outside. This can be the case when *Ceno Settings* reports *External UDP endpoints* which look like [CGNAT][CGNAT] addresses `100.X.Y.Z:N` with X between 64 and 127 (increasingly common among home ISPs), or like private addresses `10.X.Y.Z:N`, `172.X.Y.Z:N` with X between 16 and 31, and `192.168.X.Y:N`. If so, please contact your ISP or network administrator to get a public address on your router or to establish port forwardings to the external endpoint.
ar: **ملاحظة:** حتى إذا كان UPnP يعمل، فقد يتعذر الوصول إلى جهاز التوجيه الخاص بك من الخارج. يمكن أن يحدث هذا عندما تكون *إعدادات Ceno* تشير إلى *نقاط نهاية UDP الخارجية* التي تبدو مثل عناوين [CGNAT][CGNAT] `100.X.Y.Z:N` حيث X بين 64 و 127 (شائع جدًا عند مزودي خدمة الإنترنت المنزلية)، أو مثل العناوين الخاصة `10.X.Y.Z:N` و `172.X.Y.Z:N` حيث X بين 16 و 31، و `192.168.X.Y:N`. إذا كان الأمر كذلك، فيرجى الاتصال بمزود خدمة الإنترنت أو مسؤول الشبكة للحصول على عنوان عام على جهاز التوجيه الخاص بك أو لتأسيس عمليات إعادة توجيه المنفذ إلى نقاط النهاية الخارجية.
fa: **توجه:** حتی اگر UPnP کار می‌کند، ممکن است روتر شما هنوز از بیرون قابل دسترسی نباشد. این موضوع ممکن است زمانی اتفاق بیفتد که *تنظیمات Ceno* *نقطه‌های پایانی UDP خارجی* را اطلاع می‌دهد که شبیه آدرس‌های [CGNAT][CGNAT] «100.X.YZ:N» با X بین ۶۴ تا ۱۲۷ (به طور فزاینده‌ای در بین آی‌اس‌پی‌های خانگی رایج است) یا مانند آدرس‌های خصوصی چون «10.XYZ:N»، «172.XYZ:N» با X بین ۱۶ و ۳۱ و «192.168.XY:N» باشند. اگر چنین است، لطفاً با شركت خدمات سرويس‌هاي اينترنت (ISP) یا مسئول شبکه خود تماس بگیرید تا یک آدرس عمومی در روتر خود دریافت کنید یا برای ایجادکردن حالت ارسال پورت به نقطه پایانی خارجی به شما کمک کنند.
id: **Catatan:** Meskipun UPnP berfungsi, ruter Anda mungkin masih tidak dapat dijangkau dari luar. Hal ini dapat terjadi ketika *Pengaturan Ceno* melaporkan *titik akhir UDP Eksternal* yang terlihat seperti alamat [CGNAT][CGNAT] `100.X.Y.Z:N` dengan X antara 64 dan 127 (semakin umum di antara ISP rumahan), atau seperti alamat privat `10.X.Y.Z:N`, `172.X.Y.Z:N` dengan X antara 16 dan 31, dan `192.168.X.Y:N`. Jika demikian, harap hubungi ISP atau admin jaringan Anda untuk mendapatkan alamat publik di ruter Anda atau untuk menetapkan penerusan porta ke titik akhir eksternal.
ru: **Важно:** Даже если UPnP работает нормально, ваш роутер может быть всё ещё недоступен извне. Дело может быть в этом, если в *Настройках Ceno* *Внешние конечные точки UDP* выглядят как [CGNAT][CGNAT] адреса `100.X.Y.Z:N`, где X принимает значения между 64 и 127 (всё чаще встречается среди обслуживающих квартиры провайдеров), или как приватные адреса `10.X.Y.Z:N`, `172.X.Y.Z:N`, где X от 16 до 31, и `192.168.X.Y:N`. В таких случаях свяжитесь со своим провайдером или системным администратором чтобы получить публичный адрес для вашего роутера, или настроить перенаправление портов на внешние конечные точки.
tr: **Not:** UPnP çalışıyor olsa bile yönlendiricinize ağ dışından erişilemeyebilir. *Ceno ayarlarındaki* *Dış UDP uç noktaları* değerleri `100.A.B.C:D` şeklindeki bir IP adresinde A değeri 64 ile 127 arasında olan bir [CGNAT][CGNAT] adresiyse (kişisel kullanım sağlayan internet hizmeti sağlayıcılarında sık görülür), özel `10.A.B.C:D`, `172.A.B.C:D`,`192.168.B.C:D` ve A değeri 16 ile 31 arasında olan bir adres ise bu durum görülebilir. Bu durumda internet hizmeti sağlayıcınıza ya da ağ yöneticinize ulaşarak, yönlendiriciniz için herkese açık bir adres alın ya da dış uç noktalara bağlantı noktası yönlendirmesi yapın.
uk: **Примітка:** навіть якщо UPnP працює, Ваш маршрутизатор все одно може бути недоступним ззовні. Це трапляється у випадку, коли *налаштування Ceno* повідомляють про *зовнішні кінцеві точки UDP*, які виглядають як адреси [CGNAT][CGNAT] на кшталт `100.XYZ:N`, де X від 64 до 127 (частіше поширені серед домашніх Інтернет-постачальників), або як приватні адреси `10.XYZ:N`, `172.XYZ:N`, де X між 16 та 31, та `192.168.XY:N`. Якщо це трапилося, то зверніться до свого постачальника або адміністратора мережі, щоб отримати публічну адресу на Вашому маршрутизаторі або встановити переадресацію портів до зовнішньої кінцевої точки.

source: Instead of enabling UPnP on your router, you can create a port forwarding rule to make sure that connections from the Ceno network are forwarded to your device. You will need to login to the router's administrative interface and locate the *port forwarding* option. To see which IP address you need to forward the connections to and the relevant port, open the *Ceno Settings* page and look under the *Local UDP endpoints*.
ar: بدلاً من تمكين UPnP على جهاز التوجيه الخاص بك، يمكنك إنشاء قاعدة إعادة توجيه المنفذ للتأكد من إعادة توجيه الاتصالات من شبكة Ceno إلى جهازك. ستحتاج إلى تسجيل الدخول إلى الواجهة الإدارية لجهاز التوجيه وتحديد خيار *إعادة توجيه المنفذ*. لمعرفة عنوان IP الذي تحتاجه لإعادة توجيه الاتصالات والمنفذ الصحيح، افتح صفحة *إعدادات Ceno* وانظر *نقاط نهاية UDP المحلية*.
fa: به‌ جای فعال کردن UPnP روی مودم، شما می‌توانید یک دستور port forwarding ایجاد کنید تا از ارسال اتصالات از شبکه Ceno به سمت دستگاه شما مطمئن شوید. برای این کار شما باید به حساب ادمین مودم وارد شوید و گزینه *port forwarding* را فعال کنید. برای اینکه ببینید اتصال کدام آدرس آی‌پی را فوروارد کنید و همچنین پورت‌ مربوطه، تنظیمات Ceno را باز کنید و زیر گزینه *Local UDP endpoints* را نگاه کنید.
id: Alih-alih mengaktifkan UPnP di ruter Anda, Anda dapat membuat aturan penerusan porta untuk memastikan bahwa koneksi dari jaringan Ceno diteruskan ke perangkat Anda. Anda harus masuk ke antarmuka administratif ruter dan menemukan opsi *penerusan porta*. Untuk melihat alamat IP mana yang Anda perlukan untuk meneruskan koneksi dan porta yang relevan, buka halaman *Pengaturan Ceno* dan lihat di bawah *titik akhir UDP Lokal*.
ru: Вместо включения UPnP на роутере можно создать правило переадресации портов, чтобы соединения из сети Ceno направлялись на ваше устройство. Вам необходимо войти в панель управления роутера и найти опцию *переадресация портов*. Чтобы узнать, на какой IP-адрес и порт вам нужно перенаправлять соединения, откройте страницу *Настройки Ceno* и найдите раздел *Локальная конечные точки UDP*.
tr: Yönlendiricinizin UPnP seçeneğini açmak yerine Ceno ağındaki bağlantıların aygıtınıza yönlendirilmesi için bir bağlantı noktası yönlendirme kuralı oluşturabilirsiniz. Yönlendiricinin yönetim arayüzüne girmeli ve *bağlantı noktası (port) yönlendirme* seçeneğini bulmalısınız. Hangi IP adresi ve bağlantı noktasına yönlendirme yapmanız gerektiğini öğrenmek için, *Ceno ayarları* bölümünü açın ve *Yerel UDP uç noktaları* bölümüne bakın.
uk: Замість увімкнення UPnP на маршрутизаторі Ви можете створити правило переадресації портів, щоб зʼєднання з мережі Ceno прямували на Ваш пристрій. Вам необхідно ввійти до панелі керування маршрутизатора і знайти параметр *переадресація портів*. Щоб дізнатися, на яку IP-адресу та порт потрібно перенаправити зʼєднання, відкрийте сторінку *Налаштування Ceno* і знайдіть розділ *Локальна кінцева точка UDP*.

source: The port forwarding must be for the UDP protocol (not TCP). Ceno chooses a random port on first run and keeps it for subsequent runs, but your device's local network IP address may change from time to time. Thus you should periodically review the *Ceno Settings* page to see that your device is reachable to the Ceno network.
ar: يجب أن تكون إعادة توجيه المنفذ لبروتوكول UDP (وليس TCP). يختار Ceno منفذًا عشوائيًا عند التشغيل الأول ويحتفظ به لعمليات التشغيل اللاحقة، ولكن قد يتغير عنوان IP للشبكة المحلية لجهازك من وقت لآخر. وبالتالي، يجب عليك مراجعة صفحة *إعدادات Ceno* بشكل دوري لمعرفة هل جهازك يمكن الوصول إليه من خلال شبكة Ceno.
fa: port forwarding باید برای پروتکل UDP باشد (نه برای TCP). در ابتدا Ceno یک پورت تصادفی را انتخاب می‌کند و آن را برای اجرای بعدی نگه می‌دارد اما آدرس آی‌پی دستگاه محلی شما ممکن است گاه‌به‌گاه تغییر کند. بنابراین باید به طور مرتب *تنظیمات Ceno* خود را نگاه کنید تا مطمئن شوید که دستگاه شما به شبکه Ceno وصل باشد.
id: Penerusan porta harus dilakukan untuk protokol UDP (bukan TCP). Ceno memilih porta acak saat pertama kali dijalankan dan menyimpannya untuk proses berikutnya, tetapi alamat IP jaringan lokal perangkat Anda dapat berubah dari waktu ke waktu. Oleh karena itu, Anda harus meninjau halaman *Pengaturan Ceno* secara berkala untuk memastikan bahwa perangkat Anda dapat dijangkau oleh jaringan Ceno.
ru: Перенаправление портов должно осуществляться для протокола UDP (не TCP). При первом запуске Ceno выбирает случайный порт и сохраняет его для последующих запусков, но IP-адрес локальной сети вашего устройства может время от времени меняться. Поэтому вам следует периодически просматривать страницу *Настройки Ceno*, чтобы убедиться, что ваше устройство имеет доступ к сети Ceno.
tr: Bağlantı noktası yönlendirme UDP (TCP değil) iletişim kuralına özgü olmalıdır. Ceno ilk kez açıldığında rastgele bir bağlantı noktası seçer ve sonraki açılışlarında aynı bağlantı noktasını kullanır. Ancak aygıtınızın yerel ağdaki IP adresi zaman zaman değişebilir. Aygıtınızın Ceno ağına erişilebileceğinden emin olmak için arada bir *Ceno ayarları* bölümüne bakmalısınız.
uk: Перенаправлення портів має здійснюватися для протоколу UDP (не TCP). Під час першого запуску Ceno обирає випадковий порт і зберігає його для наступних запусків, але IP-адреса локальної мережі Вашого пристрою може іноді змінюватися. Тому слід періодично переглядати сторінку *Налаштування Ceno* й переконатися, що Ваш пристрій має доступ до мережі Ceno.

source: [Don't kill my app!]: https://dontkillmyapp.com/
ar: [Don't kill my app!] "(لا تقتل تطبيقي!): https://dontkillmyapp.com/
id: [Jangan bunuh aplikasiku]: https://dontkillmyapp.com/
ru: [Не убивайте мое приложение!]: https://dontkillmyapp.com/
uk: [Не вбивайте мою програму!]: https://dontkillmyapp.com/

source: [upnp-risks]: https://www.howtogeek.com/122487/htg-explains-is-upnp-a-security-risk
id: [risiko upnp]: https://www.howtogeek.com/122487/htg-explains-is-upnp-a-security-risk
tr: [upnp-risks]: https://tr.phhsnews.com/articles/howto/is-upnp-a-security-risk.html

source: [docker-install]: https://docs.docker.com/engine/install/
el: [εγκατάσταση docker]: https://docs.docker.com/engine/install/
id: [instal docker]: https://docs.docker.com/engine/install/

source: A peer-to-peer network is built from every node connected to it (yes, that means you as well!). The more nodes, the stronger and more versatile the network becomes. If you are running the CENO Browser from a country that does not censor the Internet (or not as heavily as some), consider helping other CENO users by becoming a **bridge** node. You will then begin to route traffic between clients living in heavily censored countries and CENO injectors. You will not be able to see their traffic (it will be sent through an encrypted tunnel), nor will any of this traffic remain on your device.
el: Ένα δίκτυο μεταξύ χρηστών, δημιουργείται από κάθε κόμβο που συνδέεται σε αυτό (ναι, αυτό σημαίνει και από εσάς!). Όσο περισσότεροι κόμβοι, τόσο ισχυρότερο και πιο ευέλικτο γίνεται το δίκτυο. Αν χρησιμοποιείτε το φυλλομετρητή CENO από μια χώρα που δε λογοκρίνει το Διαδίκτυο (ή όχι τόσο έντονα όσο κάποιες άλλες), σκεφτείτε να βοηθήσετε τους άλλους χρήστες του CENO με το να γίνετε ένας κόμβος **γέφυρα**. Τότε θα αρχίσετε να δρομολογείτε την κυκλοφορία μεταξύ των χρηστών που ζουν σε χώρες με έντονη λογοκρισία και των κόμβων CENO. Δεν μπορείτε να δείτε την κυκλοφορία (θα αποστέλλεται μέσω μιας κρυπτογραφημένης σήραγγας), ούτε θα παραμείνει οποιαδήποτε από αυτή την κυκλοφορία στη συσκευή σας.
my: အချင်းချင်း ချိတ်ဆက်သည့် ကွန်ရက်ကို ၎င်းနှင့် ချိတ်ဆက်ထားသည့် ဆက်သွယ်ရေးပွိုင့် တစ်ခုစီဖြင့် တည်ဆောက်ထားသည် (ဟုတ်ပါသည်၊ သင်လည်း ပါဝင်သည်ဟု ဆိုလိုပါသည်)။ ဆက်သွယ်ရေးပွိုင့် များလေလေ ကွန်ရက် ပိုမိုအားကောင်းပြီး ပိုမိုဘက်စုံ အသုံးပြုနိုင်လေလေ ဖြစ်သည်။ သင်သည် အင်တာနက်ကို ဆင်ဆာမလုပ်သော (သို့မဟုတ် အချို့ကဲ့သို့ အလွန်အကျွံ ဆင်ဆာမလုပ်သော) နိုင်ငံတစ်ခုမှနေ၍ CENO ဘရောက်ဇာကို လုပ်ဆောင်နေလျှင် **ပေါင်းကူး** ဆက်သွယ်ရေးပွိုင့် ဖြစ်လာခြင်းဖြင့် အခြား CENO သုံးစွဲသူများကို ကူညီရန် စဉ်းစားပါ။ ထို့နောက် သင်သည် အလွန်အကျွံ ဆင်ဆာလုပ်ထားသော နိုင်ငံများရှိ လက်ခံစက်များနှင့် CENO ထိုးသွင်းဖိုင်များအကြား အသွားအလာကို လမ်းကြောင်းအတိုင်း စတင်ပို့ပေးပါမည်။ သင်သည် ၎င်းတို့၏ အသွားအလာကို မြင်နိုင်မည် မဟုတ်သကဲ့သို့ (၎င်းကို ကုဒ်ဖြင့် ပြောင်းလဲထားသော လိုင်းကို ဖြတ်၍ ပေးပို့ပါမည်) ဤအသွားအလာသည် သင့်စက်တွင် လုံးဝ ကျန်ခဲ့မည် မဟုတ်ပါ။

source: This functionality is already built into the CENO Browser. Your device will need to be connected to a Wi-Fi network that has either UPnP enabled or explicit port forwarding configured for CENO. See the next sections for further details.
el: Αυτή η λειτουργία είναι ήδη ενσωματωμένη στο CENO Browser. Η συσκευή σας θα πρέπει να είναι συνδεδεμένη σε ένα ασύρματο δίκτυο που έχει είτε ενεργοποιημένο το UPnP είτε έχει ρυθμίσει η προώθηση θύρας για το CENO. Δείτε τις επόμενες ενότητες για περισσότερες λεπτομέρειες.
my: ဤအသုံးချမှုကို CENO ဘရောက်ဇာထံသို့ ထည့်သွင်းတည်ဆောက်ပြီးသား ဖြစ်သည်။ သင့်စက်ကို UPnP ဖွင့်ထားသော သို့မဟုတ် CENO အတွက် သိသာသည့် ပေါ့တ် တစ်ဆင့်ပို့ခြင်းကို စီစဉ်သတ်မှတ်ထားသော Wi-Fi ကွန်ရက်သို့ ချိတ်ဆက်ထားရန် လိုအပ်ပါမည်။ နောက်ထပ် အသေးစိတ် အချက်အလက်များအတွက် လာမည့် အပိုင်းများကို ကြည့်ပါ။

source: A status like the one below indicates that UPnP is not enabled on your WiFi router:
el: Μια κατάσταση όπως η παρακάτω υποδεικνύει ότι το UPnP δεν είναι ενεργοποιημένο στο δρομολογητή WiFi:

source: [ceno-client-doc]: https://github.com/censorship-no/ceno-docker-client#running-the-client
el: [τεκμηρίωση ceno-client]: https://github.com/censorship-no/ceno-docker-client#running-the-client
