Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/bridging.po
Languages: ar, el, es, fa, fr, id, my, pt_br, ru, tr, uk

source: If your computer supports [Docker containers][docker], you can run a pre-configured CENO client on it to act as a bridge. If Docker is not yet installed, please follow the instructions to [install the Docker Engine][docker-install] in your platform. For Debian derivatives like Ubuntu or Linux Mint, you can just run: `sudo apt install docker.io`
el: Εάν ο υπολογιστής σας υποστηρίζει το [Docker containers][docker], μπορείτε να εκτελέσετε μια προ ρυθμισμένη εφαρμογή πελάτη CENO, για να λειτουργήσει ως γέφυρα. Αν το Docker δεν είναι εγκατεστημένο, ακολουθήστε τις οδηγίες για την [εγκατάσταση της μηχανής Docker][docker-install] στην πλατφόρμα σας. Για παράγωγα του Debian όπως το Ubuntu ή το Linux Mint, μπορείτε απλά να εκτελέσετε: `sudo apt install docker.io`
es: Si tu computadora soporta [contenedores Docker][docker], puedes ejecutar un cliente CENO preconfigurado en ella para que actúe como puente. Si Docker aún no está instalado, por favor sigue las instrucciones para [instalar el Motor Docker][docker-install] en tu platforma. Para derivados de Debian como Ubuntu o Linux Mint, solamente ejecuta: `sudo apt install docker.io`
fr: Si votre ordinateur prend en charge les [conteneurs Docker][docker], vous pouvez faire fonctionner un client CENO préconfiguré qui fera office de passerelle. Si Docker n'est pas encore installé, veuillez suivre les instructions pour [installer le moteur Docker][docker-install] sur votre plateforme. Pour les dérivés de Debian, comme Ubuntu ou Linux Mint, vous pouvez simplement exécuter : `sudo apt install docker.io`
pt_br: Se o seu computador suporta [contâiners do Docker][docker], você pode executar nele um cliente pré-configurado do CENO para atuar como uma ponte. Se o Docker não estiver instalado ainda, por favor, siga as instruções para [instalar o Docker Engine][docker-install] na sua plataforma. Para derivados do Debian como Ubuntu ou Linux Mint, você pode apenas executar: `sudo apt install docker.io`

source: To deploy a CENO client container you only need to run the following command on a terminal (it looks scary but you can just copy and paste it as is on the command line):
el: Για να υλοποιήσετε μια εφαρμογή πελάτη CENO χρειάζεται μόνο να εκτελέσετε την ακόλουθη εντολή σε ένα τερματικό (φαίνεται τρομακτική, αλλά μπορείτε απλά να την αντιγράψετε και να την επικολλήσετε ως έχει, στη γραμμή εντολών):
es: Para implementar un contenedor con un cliente CENO, solamente necesitas ejecutar el siguiente comando en una terminal (da un poco de miedo, pero puedes copiar y pegarlo como está en la línea de comando):
fr: Pour lancer un conteneur client CENO, il vous suffit d'exécuter la commande suivante dans un terminal (elle a l'air effrayante, mais vous pouvez simplement la copier et la coller) :
pt_br: Para implantar um contâiner de cliente CENO você apenas precisa executar os seguintes comandos em um terminal (parece assustador, mas você pode simplesmente copiar e colar na linha de comando):

source: If your computer is not based on GNU/Linux, the command needs to be slightly different:
ar: إذا كان جهاز الكمبيوتر الخاص بك لا يعتمد على جنو/ لينكس، فيجب أن يكون الأمر مختلفًا قليلاً:
el: Αν ο υπολογιστής σας δε βασίζεται σε GNU/Linux, η εντολή πρέπει να είναι διαφορετική:
es: Si tu computadora no está basada en GNU/Linux, el comando necesita ser ligeramente diferente:
fa: اگر کامپیوترتان براساس سیستم GNU/Linux کار نمی‌کند، این فرمان را باید کمی تغییر دهید:
fr: Si votre ordinateur n'est pas basé sur GNU/Linux, la commande sera légèrement différente :
id: Jika komputer Anda tidak berbasis GNU/Linux, perintahnya harus sedikit berbeda:
pt_br: Se o seu computador não é baseado em GNU/Linux, o comando precisa ser ligeiramente diferente:
ru: Если ваша ОС — не GNU/Linux, команда должна быть немного другой:
tr: Bilgisayarınız GNU/Linux tabanlı değilse, komut biraz farklı olmalıdır:
uk: Якщо операційна система Вашого компʼютера не GNU/Linux, команда повинна бути трохи іншою:

source: The command will start a container named `ceno-client` that will run on every boot unless you explicitly tell it to stop. Please check the [CENO Docker client documentation][ceno-client-doc] for more information on how to manipulate the container.
el: Η εντολή θα εκκινήσει τη διαδικασία με όνομα `ceno-client`, το οποίο θα εκτελείται σε κάθε εκκίνηση, εκτός αν του πείτε ρητά να σταματήσει. Παρακαλούμε ελέγξτε την [τεκμηρίωση εφαρμογής πελάτη CENO][ceno-client-doc] για περισσότερες πληροφορίες.
es: El comando iniciará un contenedor llamado `ceno-client` que se ejecutará en cada inicio de la máquina a menos que explícitamente le digas que se detenga. Por favor comprueba la [Documentación del cliente CENO de Docker][ceno-client-doc] para más información sobre cómo manipular al contenedor.
fr: La commande lancera un conteneur nommé `ceno-client` qui s'exécutera à chaque démarrage, à moins que vous lui demandiez expressément de s'arrêter. Veuillez consulter la [documentation Docker du client CENO][ceno-client-doc] pour plus d'informations sur la façon de manipuler le conteneur.
pt_br: O comando iniciará um contâiner chamado `ceno-client`, que será executado a cada inicialização a menos que você explicitamente diga para ele parar. Por favor, verifique a [Documentação do cliente Dockerdo do CENO][ceno-client-doc] para mais informações sobre como manipular o contâiner.

source: **Note:** This client has no *CENO Settings*: when instructed below to access that page, open instead the [client front-end](../client/front-end.md), which contains mostly equivalent information.
el: **Σημείωση:** Η εφαρμογή πελάτη δεν έχει *Ρυθμίσεις CENO*: όταν ζητηθεί παρακάτω να αποκτήσετε πρόσβαση σε αυτή τη σελίδα, ανοίξτε το [client front-end](../client/front-end.md), το οποίο περιέχει κυρίως πληροφορίες.
es: **Nota:** Este cliente no tiene *Configuración de CENO*: cuando se lo instruya abajo para que acceda a esa página, abre en vez la [interfaz de usuario del cliente](../client/front-end.md), la cual contiene información mayormente equivalente.
fr: **Note :** Ce client n'a pas de *Paramètres CENO* : lorsqu'il vous est demandé plus bas d'accéder à cette page, ouvrez plutôt le [front-end du client](../client/front-end.md), qui contient des informations équivalentes.
pt_br: **Nota:** Este cliente não possui *Configurações do CENO*: quando indicarmos nas instruções abaixo para acessar essa página, ao invés disso abra a [front-end do cliente](../client/front-end.md), que contém em sua maioria informações equivalentes.

source: Enabling UPnP on your Wi-Fi router
ar: تمكين UPnP على جهاز توجيه Wi-Fi الخاص بك
el: Ενεργοποίηση UPnP στο δρομολογητή Wi-Fi
es: Habilitando UPnP en tu enrutador Wi-Fi
fa: فعال کردن UPnP روی مودم وای‌فای
fr: Activer l'UPnP sur votre routeur Wi-Fi
id: Mengaktifkan UPnP di ruter Wi-Fi Anda
my: သင့် Wi-Fi ‌ရောက်တာတွင် UPnP ကို ဖွင့်ခြင်း
pt_br: Habilitando UPnP em seu roteador WiFi
ru: Включение UPnP на роутере Wi-Fi
tr: Kablosuz yönlendiricinizde UPnP ayarını açmak
uk: Увімкнення UPnP на маршрутизаторі Wi-Fi

source: [UPnP][UPnP] is the easiest way of making your CENO Browser (or computer client) reachable to the CENO network. The [CENO Settings](settings.md) page will indicate the UPnP status on your local network.
el: [UPnP][UPnP] είναι ο ευκολότερος τρόπος για να καταστήσετε το CENO Browser (ή τον υπολογιστή) προσβάσιμο στο δίκτυο CENO. Η σελίδα [Ρυθμίσεις CENO](settings.md) θα υποδεικνύει την κατάσταση UPnP του δικτύου σας.
es: ["Plug and Play" Universal][UPnP] es la manera más fácil de hacer que tu Navegador CENO (o cliente de computadora) sea alcanzable para la red CENO. La página de [Configuración de CENO](settings.md) indicará el estado de UPnP en tu red local.
fr: [UPnP][UPnP] est le moyen le plus simple de rendre votre navigateur CENO (ou le client de votre ordinateur) accessible au réseau CENO. La page [Paramètres de CENO](settings.md) vous indiquera l'état de l'UPnP sur votre réseau local.
pt_br: [UPnP][UPnP] é a maneira mais fácil de tornar o seu Navegador CENO (ou cliente de computador) alcançável à rede CENO. A página [Configurações do CENO](settings.md) irá indicar o estado do UPnP em sua rede local.

source: **Note:** Enabling UPnP on the Wi-Fi router may expose devices on your network to external interference. Please make yourself [aware of the risks][upnp-risks] and also consider using alternative methods as explained below.
ar: **ملاحظة:** قد يؤدي تمكين UPnP على موجه Wi-Fi إلى تعريض الأجهزة الموجودة على شبكتك لتداخلات خارجية. يرجى أن تكون على [دراية بالمخاطر][upnp-risks] و خذ بعين الإعتبار استخدام طرق بديلة كما هو موضح أدناه.
el: **Σημείωση:** Η ενεργοποίηση του UPnP στο δρομολογητή σας, μπορεί να εκθέσει τις συσκευές του δικτύου σας σε εξωτερικούς παράγοντες. Παρακαλούμε [ενημερωθείτε για τους κινδύνους][upnp-risks] και εξετάστε το ενδεχόμενο χρήσης εναλλακτικών μεθόδων όπως εξηγείται παρακάτω.
es: **Nota:** Habilitar UPnP en el enrutador Wi-Fi podría exponer a los dispositivos en tu red a interferencia externa. Por favor sé [consciente de los riesgos][upnp-risks] y también considera usar métodos alternativos como se explica a continuación.
fa: **توجه:** فعال کردن UPnP روی مودم وای‌فای ممکن است باعث شود که دستگاه‌های موجود در شبکه دچار یک اختلال خارجی شوند. لطفا از [مخاطرات در این زمینه آگاه باشید][upnp-risks] و همچنین استفاده از گزینه‌های جایگزین را نیز در نظر داشته باشید.
fr: **Remarque :** L'activation d'UPnP sur le routeur Wi-Fi peut exposer les périphériques de votre réseau à des interférences externes. Veuillez prendre [conscience des risques][upnp-risks] et envisager l'utilisation de méthodes alternatives comme expliqué ci-dessous.
id: **Catatan:** Mengaktifkan UPnP di ruter Wi-Fi dapat membuat perangkat di jaringan Anda mengalami interferensi eksternal. Harap buat diri Anda [sadar akan risiko][risiko-upnp] dan pertimbangkan juga untuk menggunakan metode alternatif seperti yang dijelaskan di bawah ini.
my: **မှတ်ချက်-** Wi-Fi ရောက်တာတွင် UPnP ကို ဖွင့်ခြင်းက သင့်ကွန်ရက်ရှိ စက်များကို ပြင်ပ ကြားဝင်နှောင့်ယှက်မှု ကြုံရစေနိုင်သည်။ ကျေးဇူးပြု၍ သင်ကိုယ်တိုင် [စွန့်စားမှုများကို သတိထားပါ][upnp-risks]၊ ထို့ပြင် အောက်တွင် ရှင်းပြထားသော အခြားနည်းလမ်းများကို အသုံးပြုရန်လည်း စဉ်းစားပါ။
pt_br: **Nota:** Habilitar UPnP no roteador WIFI pode expor dispositivos em sua rede à interferência externa. Por favor, esteja [ciente dos riscos][upnp-risks] e considere também métodos alternativos, como explicado abaixo.
ru: **Примечание:** Включение UPnP на Wi-Fi-роутере может подвергнуть устройства в вашей сети внешним помехам. Пожалуйста, ознакомьтесь с [рисками UPnP][upnp-risks], а также рассмотрите возможность использования альтернативных методов, как описано ниже.
tr: **Not:** Kablosuz ağınızdaki UPnP ayarını açmak aygıtlarınızın dışarıya açık olmasına neden olabilir. [Tehlikelerin][upnp-risks] farkında olun ve aşağıda belirtilen farklı yöntemlere göz atın.
uk: **Примітка:** Увімкнення UPnP на маршрутизаторі Wi-Fi може створити перешкоди іншим пристроям у Вашій мережі. Будь ласка, ознайомтеся з [ризиками UPnP][upnp-risks], а також розгляньте можливість використання альтернативних методів, як це описано нижче.

source: A status like the one below indicates that UPnP is not available or not working on your WiFi router:
ar: تشير الحالة أدناه إلى أن UPnP غير متوفر أو لا يعمل على جهاز توجيه WiFi الخاص بك:
es: Un estado como el siguiente indica que UPnP no está disponible o no funciona en tu enrutador Wi-Fi:
fa: وضعیتی مانند مورد زیر نشان می‌دهد که UPnP روی روتر وای‌فای شما در دسترس نیست یا کار نمی‌کند:
fr: Un état comme celui ci-dessous indique que l'UPnP n'est pas disponible ou ne fonctionne pas sur votre routeur WiFi :
id: Status seperti di bawah ini menunjukkan bahwa UPnP tidak tersedia atau tidak berfungsi di ruter WiFi Anda:
pt_br: Um estado como o mostrado abaixo indica que UPnP não está disponível ou não está funcionando em seu roteador WIFI:
ru: Состояние как на следующей картинке означает что UPnP не работает или недоступен на вашем WiFi роутере:
tr: Aşağıdaki durum UPnP özelliğinin çalışmadığını ya da kablosuz yönlendiricinizde kullanılamadığını gösterir:
uk: Стан, подібний до того, як це показано на попередньому малюнку, означає, що UPnP не доступний або не працює на Вашому маршрутизаторі Wi-Fi:

source: **Reachability status**
ar: **حالة إمكانية الوصول**
el: **Κατάσταση προσβασιμότητας**
es: **Estado de alcanzabilidad**
fa: **وضعیت قابلیت دسترسی**
fr: **État d'accessibilité**
id: **Status keterjangkauan**
pt_br: **Estado de acessibilidade**
ru: **Состояние доступности**
tr: **Erişilebilirlik durumu**
uk: **Стан доступності**

source: **UPnP status**
ar: **حالة UPnP**
el: **Κατάσταση UPnP**
es: **Estado UPnP**
fa: **وضعیت UPnP**
fr: **État de l'UPnP**
id: **Status UPnP**
pt_br: **Estado do UPnP**
ru: **Состояние UPnP**
tr: **UPnP durumu**
uk: **Стан UPnP**

source: The status below indicates that UPnP is likely working and CENO is currently verifying connectivity:
el: Η παρακάτω κατάσταση υποδεικνύει ότι το UPnP λειτουργεί και το CENO επιβεβαιώνει τη συνδεσιμότητα:
es: El estado de siguiente indica que UPnP probablemente está funcionando, y en este momento CENO está verificando la conectividad:
fr: L'état ci-dessous indique que l'UPnP fonctionne probablement et que CENO est en train de vérifier la connectivité :
pt_br: O estado abaixo indica que o UNnP provavelmente está funcionando e que o CENO está, no momento, verificando a conectividade:

source: The status below indicates that UPnP is working and you can bridge connections for other CENO users:
el: Η παρακάτω κατάσταση υποδεικνύει ότι το UPnP λειτουργεί και μπορείτε να δημιουργήσετε μια γέφυρα για άλλους χρήστες του CENO:
es: El estado a continuación indica que UPnP está funcionando, y puedes actuar como puente para las conexiones de otros usuarios de CENO:
fr: L'état ci-dessous indique que l'UPnP fonctionne et que vous pouvez établir des connexions pour d'autres utilisateurs de CENO :
pt_br: O estado abaixo indica que o UPnP está funcionando e que você pode ser ponte para conexões de outros usuários do CENO:

source: **Note:** Even if UPnP is working, your router may still not be reachable from the outside. This can be the case when *CENO Settings* reports *External UDP endpoints* which look like [CGNAT][CGNAT] addresses `100.X.Y.Z:N` with X between 64 and 127 (increasingly common among home ISPs), or like private addresses `10.X.Y.Z:N`, `172.X.Y.Z:N` with X between 16 and 31, and `192.168.X.Y:N`. If so, please contact your ISP or network administrator to get a public address on your router or to establish port forwardings to the external endpoint.
es: **Nota:** Incluso si UPnP funciona, tu enrutador podría no ser alcanzable desde el exterior. Esto puede ocurrir cuando la *Configuración de CENO* indique *Puntos finales UDP externos* que correspondan a direcciones [CGNAT][CGNAT] `100.X.Y.Z:N` con X entre 64 y 127 (cada vez más comunes entre ISP domésticos), o a direcciones privadas `10.X.Y.Z:N`, `172.X.Y.Z:N` con X entre 16 y 31, y `192.168.X.Y:N`. En tal caso, contacta con tu ISP o administrador de red para obtener una dirección pública en tu enrutador o para establecer redireccionamientos de puertos hacia el punto final externo.
fr: **Remarque :** Même si l'UPnP fonctionne, votre routeur peut ne pas être joignable de l'extérieur. Cela peut être le cas lorsque les *Paramètres de CENO* signalent des *Point limite UDP externes* similaires aux adresses [CGNAT][CGNAT] `100.X.Y.Z:N` avec X compris entre 64 et 127 (de plus en plus fréquent chez les FAI domestiques), ou aux adresses privées `10.X.Y.Z:N`, `172.X.Y.Z:N` avec X compris entre 16 et 31, et `192.168.X.Y:N`. Si c'est le cas, veuillez contacter votre FAI ou votre administrateur réseau pour obtenir une adresse publique sur votre routeur ou pour créer des redirections de port vers le point limite externe.

source: There are many Wi-Fi routers on the market and each has their own particular features. Herein a list of some manufacturers' instructions for enabling UPnP:
ar: هناك العديد من أجهزة توجيه Wi-Fi في السوق ولكل منها ميزاته الخاصة. فيما يلي قائمة ببعض إرشادات الشركات المصنعة لتمكين UPnP:
el: Υπάρχουν πολλοί δρομολογητές και ο καθένας έχει τα δικά του ιδιαίτερα χαρακτηριστικά. Παρακάτω θα βρείτε μια λίστα με οδηγίες ορισμένων κατασκευαστών για ενεργοποίηση του UPnP:
es: Hay muchos enrutadores Wi-Fi en el mercado, y cada uno tiene sus propias características particulares. He aquí una lista de las instrucciones de algunos fabricantes para habilitar UPnP:
fa: در حال حاضر انواع مودم‌های وای‌فای در بازار وجود دارد و هریک نیز ویژگی‌های خود را دارد. در زیر فهرستی از دستورالعمل‌های تولیدکنندگان مختلف مودم برای فعال کردن UPnP آورده شده‌ است:
fr: Il existe de nombreux routeurs Wi-Fi sur le marché et chacun possède ses propres caractéristiques. Voici une liste des consignes de certains fabricants pour activer l'UPnP :
id: Ada banyak ruter Wi-Fi di pasaran dan masing-masing memiliki fitur khusus. Ini adalah daftar instruksi beberapa pabrikan untuk mengaktifkan UPnP:
my: ဈေးကွက်တွင် Wi-Fi ရောက်တာများစွာ ရှိပြီး တစ်ခုစီတွင် ၎င်းတို့၏ တိကျသော ကိုယ်ပိုင် လုပ်ဆောင်ချက်များ ရှိသည်။ ဤသည်တို့မှာ UPnP ဖွင့်ရန်အတွက် ထုတ်လုပ်သူအချို့၏ လမ်းညွှန်ချက် စာရင်း ဖြစ်သည်-
pt_br: Há muitos roteadores WIFI no mercado, e cada um tem suas características específicas. Aqui está uma lista das instruções de alguns fabricantes para habilitar o UPnP:
ru: На рынке представлено множество роутеров Wi-Fi, и каждый из них имеет свои особенности. Ниже приведен список инструкций некоторых производителей по включению UPnP:
tr: Piyasada bir çok kablosuz yönlendirici var ve hepsinin kendine özgü çeşitli özellikleri var. Bazı markaların UPnP açma yönergelerinin (İngilizce) bulunduğu listeye bakabilirsiniz:
uk: На ринку представлено багато маршрутизаторів Wi-Fi і кожен з них має свої особливості. Нижче наведено список інструкцій деяких виробників щодо увімкнення UPnP:

source: [Linksys](https://www.linksys.com/us/support-article?articleNum=138290)
ar: [Linksys](https://www.linksys.com/ae/support-article?articleNum=138290)
fr: [Linksys](https://www.linksys.com/fr/support-article?articleNum=138290)

source: [Huawei](https://consumer.huawei.com/ph/support/content/en-us00275342/)
ar: [Huawei](https://consumer.huawei.com/ae/support/content/ar-eg15806294/)
fr: [Huawei](https://consumer.huawei.com/fr/support/content/fr-fr15806294/)

source: [TP-Link](https://community.tp-link.com/us/home/kb/detail/348)
fr: [TP-Link](https://www.tp-link.com/fr/support/faq/1543/)

source: [Netgear](https://kb.netgear.com/24306/How-do-I-enable-Universal-Plug-and-Play-on-my-Nighthawk-router)
fr: [Netgear](https://kb.netgear.com/fr/24306/Comment-activer-le-Plug-and-Play-Universel-sur-mon-routeur-NETGEAR?language=fr)

source: Using port forwarding as an alternative to UPnP
ar: استخدام إعادة توجيه المنفذ كبديل لـ UPnP
el: Χρήση της προώθησης θύρας, ως εναλλακτική του UPnP
es: Usando redireccionamiento de puertos como alternativa a UPnP
fa: استفاده از port forwarding به عنوان جایگزین UPnP
fr: Utiliser la redirection de port comme alternative à l'UPnP
id: Menggunakan penerusan porta sebagai alternatif untuk UPnP
my: UPnP အစား ပေါ့တ် တစ်ဆင့်ပို့ခြင်းကို အသုံးပြုခြင်း
pt_br: Usando o redirecionamento de porta como uma alternativa ao UPnP
ru: Использование переадресации портов в качестве альтернативы UPnP
tr: UPnP yerine bağlantı noktası yönlendirmesi kullanmak
uk: Використання переадресації портів як альтернативи UPnP

source: Instead of enabling UPnP on your router, you can create a port forwarding rule to make sure that connections from the CENO network are forwarded to your device. You will need to login to the router's administrative interface and locate the *port forwarding* option. To see which IP address you need to forward the connections to and the relevant port, open the *CENO Settings* page and look under the *Local UDP endpoints*.
el: Αντί να ενεργοποιήσετε το UPnP στο δρομολογητή σας, μπορείτε να δημιουργήσετε έναν κανόνα προώθησης θύρας, για να βεβαιωθείτε ότι οι συνδέσεις από το δίκτυο CENO προωθούνται στη συσκευή σας. Θα χρειαστεί να συνδεθείτε στη διαχείριση ρυθμίσεων του δρομολογητή και να εντοπίσετε την επιλογή "προώθηση θύρας". Για να δείτε ποια διεύθυνση IP πρέπει να προωθήσετε τις συνδέσεις και τη σχετική θύρα, ανοίξτε τη σελίδα "Ρυθμίσεις CENO" και εντοπίστε το "Τοπικά τελικά σημεία UDP".
es: En vez de habilitar UPnP en tu enrutador, puedes crear una regla de redireccionamiento de puerto para asegurarte que las conexiones desde la red CENO sean dirigidas a tu dispositivo. Necesitarás iniciar sesión en la interfaz administrativa del enrutador, y ubicar la opción *redireccionamiento de puertos*. Para ver a cuál dirección IP necesitas redirigir las conexiones y el puerto relevante, abre la página *Configuración de CENO* y mira la sección *Puntos finales UDP locales*.
fr: Au lieu d'activer l'UPnP sur votre routeur, vous pouvez créer une règle de redirection de port pour vous assurer que les connexions du réseau CENO sont bien transférées vers votre appareil. Vous devrez vous connecter à l’interface d'administration du routeur et trouver l’option *redirection de port*. Pour voir vers quelle adresse IP vous devez rediriger les connexions et le port correspondant, ouvrez la page *Paramètres de CENO* et regardez dans les *Points limites UDP locaux*.

source: **Local UDP endpoints**
ar: **نقاط نهاية UDP المحلية**
el: **Τοπικά τελικά σημεία UDP**
es: **Puntos finales UDP locales**
fa: **نقطه‌های انتهایی «یو‌دی‌پی UDP» محلی**
fr: **Points limite UDP locaux**
id: **Titik akhir UDP lokal**
ru: **Локальные конечные точки UDP**
tr: **Yerel UDP uç noktaları**
uk: **Локальні кінцеві точки UDP**
