Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/bridging.po
Languages: ar, el, es, fa, fr, id, my, pt_br, ru, tr, uk

source: Helping other CENO users browse the Web
el: Βοηθώντας άλλους χρήστες του CENO να περιηγηθούν στο Διαδίκτυο
es: Ayudando a otros usuarios de CENO a navegar la Web
fr: Aider les autres utilisateurs de CENO à naviguer sur le web
my: အခြား CENO သုံးစွဲသူများအား ဝဘ်ရှာဖွေရာတွင် ကူညီခြင်း
pt_br: Ajudando outros usuários CENO a navegar a Web

source: A peer-to-peer network is built from every node connected to it (yes, that means you as well!). The more nodes, the stronger and more versatile the network becomes. If you are running CENO Browser from a country that does not censor the Internet (or not as heavily as some), consider helping other CENO users by becoming a **bridge** node. You will then begin to route traffic between clients living in heavily censored countries and CENO injectors. You will not be able to see their traffic (it will be sent through an encrypted tunnel), nor will any of this traffic remain on your device.
es: Una red par a par es construída desde cada nodo conectado a ella (sí, ¡eso significa que tú también!). A mayor cantidad de nodos, más fuerte y más versátil se torna la red. Si estás ejecutando al Navegador CENO desde un país que no censura a Internet (o no tan pesadamente como algunos), considera ayudar a otros usuarios de CENO volviéndote un nodo **puente**. Entonces empezarás a enrutar tráfico entre clientes viviendo en países abrumadoramente censurados e inyectores CENO. No serás capaz de ver su tráfico (será enviado a través de un túnel cifrado), y nada de este tráfico permanecerá en tu dispositivo.
fr: Un réseau pair-à-pair se construit à partir de chaque nœud qui y est connecté (oui, y compris vous !). Plus il y a de nœuds, plus le réseau se renforce et devient polyvalent. Si vous utilisez le navigateur CENO dans un pays qui ne pratique pas la censure sur Internet (ou dans une moindre mesure que certains), vous pouvez aider les autres utilisateurs de CENO en devenant un nœud **passerelle**. Vous commencerez alors à acheminer le trafic entre les clients vivant dans des pays fortement censurés et les injecteurs de CENO. Vous ne serez pas en mesure de voir leur trafic (qui sera transmis à travers un tunnel crypté), et aucune trace de ce trafic ne restera dans votre appareil.
pt_br: Uma rede P2P é construída a partir de cada nó conectado a ela (sim, isso significa você, tambpem!). Quanto mais nós, mais forte e mais versátil a rede se torna. Se estiver executando o Navegador CENO de um país que não censura a Internet (ou não o faz tão incisivamente quanto alguns), considere ajudar outros usuários do CENO se tornando um nó **ponte**. Você começará, então, a encaminhar tráfego entre clientes vivendo em países fortemente censurados e injetores do CENO. Você não conseguirá ver o tráfego deles (este será enviado através de um túnel critpografado), tampouco haverá em seu dispositivo qualquer registro remanescente desse tráfego.

source: **Note:** The configuration described in this section may also help your device to effectively seed content to others on the distributed cache, so please consider applying it as well when using CENO in a censoring country (but keep in mind the [risks](../concepts/risks.md) of serving such content to others).
el: **Σημείωση:** Η ρύθμιση που περιγράφεται σε αυτή την ενότητα μπορεί επίσης να βοηθήσει τη συσκευή σας να στείλει αποτελεσματικά περιεχόμενο σε άλλους στην κατανεμημένη κρυφή μνήμη, οπότε σκεφτείτε να την εφαρμόσετε και όταν χρησιμοποιείτε το CENO σε μια χώρα που λογοκρίνει (αλλά λάβετε υπόψη σας τους [κινδύνους](../concepts/risks.md) της παροχής τέτοιου περιεχομένου σε άλλους).
es: **Nota:** La configuración descrita en esta sección también podría ayudar a tu dispositivo a sembrar contenido efectivamente a otros en la caché distribuída, por lo que por favor considera aplicarla también cuando uses CENO en un país censurador (pero ten en mente los [riesgos](../concepts/risks.md) de servir tal contenido a otros).
fr: **Remarque :** La configuration décrite dans cette section peut aussi aider votre appareil à transmettre efficacement du contenu aux autres sur le cache distribué. Pensez donc à l'appliquer lorsque vous utilisez CENO dans un pays qui pratique la censure (mais gardez à l'esprit les [risques](../concepts/risks.md) liés à la diffusion de ce contenu à d'autres personnes).
my: **မှတ်ချက်-** ဤအပိုင်းတွင် ဖော်ပြထားသော စီစဉ်သတ်မှတ်မှုသည် ဖြန့်ဝေထားသည့် ယာယီ သိမ်းဆည်းထားသော မှတ်ဉာဏ်တွင် သင့်စက်က အခြားစက်များထံ အကြောင်းအရာကို ထိရောက်စွာ တင်ပို့နိုင်ရန်လည်း ကူညီနိုင်သောကြောင့် ဆင်ဆာလုပ်သော နိုင်ငံတွင် CENO ကို အသုံးပြုချိန်တွင်လည်း ၎င်းကို အသုံးချရန် ကျေးဇူးပြု၍ စဉ်းစားပါ (သို့သော် ထိုအကြောင်းအရာကို အခြားစက်များအား ပေးခြင်း၏ [စွန့်စားမှုများ](../concepts/risks.md) ကို သတိထားပါ)။
pt_br: **Nota:** A configuração descrita nesta seção pode também ajudar o seu dispositivo a semear com eficiência conteúdo para outros no cache distribuído. Assim, por favor, considere aplicá-la igualmente quando usar o CENO em um país censurador (mas tenha em mente os [riscos](../concepts/risks.md)) de oferecer tal conteúdo para outros).

source: How to become a CENO bridge
el: Πώς να δημιουργήσετε μια γέφυρα CENO
es: Cómo volverse un puente CENO
fr: Comment devenir une passerelle CENO
my: CENO ပေါင်းကူး ဖြစ်လာနည်း
pt_br: Como se tornar uma ponte do CENO

source: This functionality is already built into CENO Browser. Your device will need to be connected to a Wi-Fi network that has either UPnP enabled or explicit port forwarding configured for CENO. See the next sections for further details.
es: Esta funcionalidad ya está incorporada dentro del Navegador CENO. Tu dispositivo necesitará estar conectado a una red Wi-Fi que tenga habilitado UPnP o bien configurada explícitamente para redirigir puertos para CENO. Mira las siguientes secciones para mayores detalles.
fr: Cette fonctionnalité est déjà intégrée au navigateur CENO. Votre appareil devra être connecté à un réseau Wi-Fi dont l'UPnP est activé ou dont la redirection de port explicite est configurée pour CENO. Voir les sections suivantes pour plus de détails.
pt_br: Esta funcionalidade já esta embutida no Navegador CENO. Seu dispositivo precisará ser conectado a uma rede WiFi que tenha ou UPnP ativado ou redirecionamento de porta explicitamente configurado para o CENO. Veja as próximas seções para maiores detalhes.

source: However, please note that Android will only allow a mobile device to act as a proper bridge while you are actively using it, as power-saving features will throttle the operation of CENO otherwise.
el: Λάβετε υπόψη, ότι το Android επιτρέπει σε μια κινητή συσκευή να λειτουργεί ως κατάλληλη γέφυρα μόνο όταν τη χρησιμοποιείτε, καθώς οι λειτουργίες εξοικονόμησης ενέργειας περιορίζουν τη λειτουργία του CENO.
es: Sin embargo, por favor nota que Android solamente le permitirá a un dispositivo móvil actuar como un puente apropiado mientras que estés usándolo activamente, de lo contrario, las características de ahorro de energía reducirán la operación de CENO.
fr: Toutefois, veuillez noter qu'Android n'autorisera votre appareil mobile à faire office de passerelle que lorsque vous l'utilisez activement. À défaut, les fonctions d'économie d'énergie limiteront le fonctionnement de CENO.
my: သို့သော် Android သည် ၎င်းကို တက်ကြွစွာ အသုံးပြုနေချိန်တွင်သာ သင့်လျော်သော ပေါင်းကူးအဖြစ် လုပ်ဆောင်ရန် မိုဘိုင်းစက်ကို ခွင့်ပြုမည်ဖြစ်ကြောင်း ကျေးဇူးပြု၍ သတိပြုပါ။ ထိုသို့မဟုတ်ပါက ပါ‌ဝါချွေတာရေး လုပ်ဆောင်ချက်များသည် CENO ၏ လည်ပတ်မှုကို ထိခိုက်စေမည် ဖြစ်သည်။
pt_br: No entanto, por favor observe que o Android só permitirá ao dispositivo móvel agir como uma porta adequada enquanto você o estiver usando ativamente. Do contrário, as funcionalidades de economia de energia limitarão as operações do CENO.

source: **Technical note:** This is mainly due to Android's [Doze mode](https://developer.android.com/training/monitoring-device-state/doze-standby "Android Developers – Optimize for Doze and App Standby") slowing down the operation of the native Ouinet library. Unfortunately, disabling battery optimization for CENO does not seem to exclude Ouinet from it. Your particular device may also include its own power-saving features which may interfere with CENO; please check [Don't kill my app!][Don't kill my app!] for your device's brand.
el: **Τεχνική σημείωση:** Αυτό οφείλεται κυρίως στο Android's [Doze mode](https://developer.android.com/training/monitoring-device-state/doze-standby "Android Developers - Optimize for Doze and App Standby") που επιβραδύνει τη λειτουργία της βιβλιοθήκης Ouinet. Δυστυχώς, η απενεργοποίηση της βελτιστοποίησης μπαταρίας για το CENO δε φαίνεται να αποκλείει το Ouinet από αυτήν. Η συσκευή σας μπορεί να περιλαμβάνει τις λειτουργίες εξοικονόμησης ενέργειας που παρεμβαίνουν στο CENO. Παρακαλούμε ελέγξτε το [Don't kill my app!] [Don't kill my app!] για τη συσκευής σας.
es: **Nota técnica:** Esto principalmente es debido al [modo doze](https://developer.android.com/training/monitoring-device-state/doze-standby "Desarrolladores de Android – Optimizar para Doze y Standby de Aplicación") de Android haciendo más lenta la operación de la biblioteca Ouinet nativa. Desafortunadamente, deshabilitar la optimización de la batería para CENO no parece excluir a Ouinet de ello. Tu dispositivo particular también podría incluir sus propias características de ahorro de energía, las cuales podrían interferir con CENO; por favor comprueba [¡No mates a mi aplicación!][Don't kill my app!] para la marca de tu dispositivo.
fr: **Note technique :** Ceci est principalement lié au [mode Doze](https://developer.android.com/training/monitoring-device-state/doze-standby « Android Developers - Optimize for Doze and App Standby ») d'Android, qui ralentit le fonctionnement de la bibliothèque native Ouinet. Malheureusement, la désactivation de l'optimisation de la batterie pour CENO ne semble pas agir sur Ouinet. Votre appareil peut également inclure ses propres fonctions d'économie d'énergie qui peuvent interférer avec CENO ; veuillez consulter les informations de [Don't kill my app!][Don't kill my app!] concernant la marque de votre appareil.
pt_br: **Nota técnica:** Isso se deve principalmente ao [Modo soneca](https://developer.android.com/training/monitoring-device-state/doze-standby "Android Developers – Optimize for Doze and App Standby") do Android, o qual retarda as operações da biblioteca nativa Ouinet. Infelizmente, desabilitar a otimização de bateria para o CENO parece não excluir a Ouinet da ação. Seu dispositivo específico pode também incluir suas próprias funcionalidades de economia de energia, o que pode interferir no funcionamento do CENO. Por favor, consulte o website [Don't kill my app!][Don't kill my app!] para informações sobre a marca do seu dispositivo.

source: Thus if you intend to have CENO acting as a permanent, always-reachable bridge, besides a properly configured Wi-Fi network you will need to:
el: Εάν σκοπεύετε το CENO να λειτουργεί ως μια μόνιμα προσβάσιμη γέφυρα, εκτός από σωστά ρυθμισμένο δίκτυο Wi-Fi θα χρειαστεί:
es: Por lo que si tu intención es tener a CENO actuando como un puente permanente, alcanzable siempre, además de una red Wi-Fi apropiadamente configurada, necesitarás:
fr: Ainsi, si vous souhaitez que CENO agisse comme une passerelle permanente, toujours joignable, en plus d'un réseau Wi-Fi correctement configuré, il vous sera nécessaire de :
my: ထို့ကြောင့် သင်သည် CENO ကို အဆုံးတိုင် အမြဲရောက်ရှိနိုင်သော ပေါင်းကူးအဖြစ် လုပ်ဆောင်ရန် ရည်ရွယ်ပါက မှန်ကန်စွာ စီစဉ်သတ်မှတ်ထားသော Wi-Fi ကွန်ရက်အပြင် သင်သည် အောက်ပါတို့ကို လိုအပ်ပါမည်-
pt_br: Assim, se pretende manter o CENO agindo como uma ponte permanente, sempre alcançável, além de uma rede WiFi configurada apropriadamente, você precisará:

source: Have your device plugged in to power at all times.
ar: أترك جهازك يُشحن طوال الوقت.
el: Να έχετε συνεχώς τη συσκευή σας συνδεδεμένη με παροχή ρεύματος.
es: Tener tu dispositivo conectado al suministro eléctrico en todo momento.
fa: گوشی‌تان به طور مدام به برق باشد.
fr: Gardez votre appareil constamment branché sur le secteur.
id: Menyambungkan perangkat Anda ke daya listrik setiap saat.
my: သင့်စက်ကို အချိန်ပြည့် အားသွင်းထားရန်။
pt_br: Ter o seu dispositivo ligado à rede elétrica a todo tempo.
ru: Всегда держать устройство подключенным к сети.
tr: Aygıtınız sürekli fişe takılı olmalı.
uk: Завжди тримати пристрій підʼєднаним до мережі живлення.

source: Have the device's screen on at all times.
ar: أترك شاشة الجهاز مُشغلة طوال الوقت.
el: Να έχετε πάντα ενεργοποιημένη την οθόνη της συσκευής.
es: Tener la pantalla del dispositivo siempre activa.
fa: صفحه گوشی‌تان همیشه روشن باشد.
fr: Gardez l'écran de l'appareil allumé en permanence.
id: Menyalakan layar perangkat setiap saat.
my: စက်၏ မျက်နှာပြင်ကို အချိန်ပြည့် ဖွင့်ထားရန်။
pt_br: Ter a tela do dispositivo ativa a todo tempo.
ru: Постоянно держать экран устройства включенным.
tr: Aygıtın ekranı sürekli açık olmalı.
uk: Постійно тримати екран увімкненим.

source: One convenient way of doing this without much power consumption and obnoxious, permanent lighting is using Android's screen saver: enable it under *Settings / Display / Screen saver* (or *Daydream* in some versions), pick the *Clock* widget, choose *When to start screen saver* in the menu and select *While charging* or *Either*. A very dimmed down clock will appear on a black background while the device is not active.
ar: إحدى الطرق الملائمة للقيام بذلك دون استهلاك الكثير من الطاقة والإضاءة الدائمة المزعجة هي استخدام شاشة التوقف في أندرويد: قم بتمكينها ضمن *الإعدادات / العرض / شاشة التوقف* (أو *أحلام اليقظة* في بعض الإصدارات)، اختر أداة *الساعة*، اختر *متى تبدأ شاشة التوقف* في القائمة وحدد *أثناء الشحن* أو * إما هذا و إما ذاك*. ستظهر ساعة خافتة للغاية على خلفية سوداء عندما يكون الجهاز غير نشط.
el: Ένας εύκολος τρόπος να το κάνετε χωρίς μεγάλη κατανάλωση ενέργειας και ενοχλητικό, μόνιμο φωτισμό είναι η χρήση της προφύλαξης οθόνης του Android: ενεργοποιήστε την από *Ρυθμίσεις / Οθόνη / Προφύλαξη οθόνης* (ή *Daydream* σε ορισμένες εκδόσεις), επιλέξτε το πρόσθετο *Ρολόι*, επιλέξτε *Πότε να ξεκινήσει η προφύλαξη οθόνης* στο μενού και επιλέξτε *Κατά τη διάρκεια της φόρτισης* ή *Πάντα*. Θα εμφανιστεί ένα ρολόι πολύ χαμηλωμένο σε μαύρο φόντο, ενώ η συσκευή δεν είναι ενεργή.
es: Una manera conveniente de hacer esto sin demasiado consumo eléctrico e iluminación desagradable y permanente es usar el protector de pantalla de Android: habilítalo bajo *Ajustes / Pantalla / Protector de Pantalla* (o *Daydream* en algunas versiones), elige el widget *Clock* y *Cuando iniciar el protector de pantalla* en el menú, y selecciona *Mientras se esté cargando* o *Cualquiera*. Un reloj muy tenue aparecerá sobre un fondo negro mientras que el dispositivo no esté activo.
fa: یک راه ساده برای استفاده از Ceno بدون مصرف بیش از اندازه باتری و روشن بودن دائمی این است که از ویژگی محافظ صفحه نمایش اندروید (Android's screen saver) استفاده کنید. شما می‌توانید این ویژگی را در بخش تنظیمات به آدرس Settings / Display / Screen saver (یا در برخی نسخه‌ها Daydream) فعال کنید. به این صورت که گزینه Clock سپس When to start screen saver و در نهایت While charging یا Either را انتخاب کنید. پس از فعال شدن این گزینه وقتی که موبایل شما فعال نیست، یک ساعت محو روی دستگاه شما نمایان می‌شود.
fr: Un moyen pratique d'y parvenir sans consommer beaucoup d'énergie et sans éclairage permanent est d'utiliser l'économiseur d'écran d'Android : activez-le dans *Paramètres / Affichage / Économiseur d'écran* (ou *Daydream* dans certaines versions), choisissez le widget *Horloge*, sélectionnez *Quand activer l'économiseur d'écran* dans le menu, puis *En charge* ou *Dans les deux cas*. Une horloge estompée apparaitra sur fond noir pour indiquer que l'appareil est inactif.
id: Salah satu cara mudah untuk melakukan ini tanpa banyak mengonsumsi daya dan pencahayaan yang menjengkelkan adalah dengan menggunakan screen saver Android: aktifkan di bawah *Pengaturan / Tampilan / Penghemat Layar* (atau *Lamunan* di beberapa versi), pilih widget *Jam*, pilih *Kapan memulai screen saver* di menu dan pilih *Saat mengisi daya* atau *Baik*. Jam yang sangat redup akan muncul di latar belakang hitam saat perangkat tidak aktif.
my: ဤသို့ပြုလုပ်ရာတွင် ပါဝါသုံးစွဲမှုများခြင်းနှင့် မလိုလားအပ်သော အမြဲတမ်း မီးလင်းနေခြင်း မရှိမည့် အဆင်ပြေသည့် နည်းလမ်းတစ်ခုမှာ Android ၏ မျက်နှာပြင် ရုပ်ပုံပြောင်းလဲပြသမှုကို အသုံးပြုခြင်း ဖြစ်သည်- ၎င်းကို *ဆက်တင်များ / ပြသမှု / မျက်နှာပြင် ရုပ်ပုံပြောင်းလဲပြသမှု* (သို့မဟုတ် အချို့ဗားရှင်းများတွင် *စိတ်ကူးယဉ်မှု*) အောက်တွင် ဖွင့်ပါ၊ *နာရီ* ဝစ်ဂျစ်ကို ရွေးချယ်ပါ၊ မီနူးရှိ *မျက်နှာပြင် ရုပ်ပုံပြောင်းလဲပြသမှု စတင်ချိန်* ကို ရွေးချယ်ပြီး *အားသွင်းစဉ်* သို့မဟုတ် *နှစ်ခုမှတစ်ခု* ကို ရွေးချယ်ပါ။ စက်ကို အသုံးပြုမနေသည့်အချိန်တွင် အနက်ရောင် နောက်ခံ၌ အလွန်အရောင်မှိန်သော နာရီ ပေါ်လာပါမည်။
pt_br: Uma forma conveniente de fazer isso sem muito consumo de energia ou a incômoda iluminação permanente é usar o protetor de tela do Android: ative-o em *Configurações/ Tela / Protetor de Tela* (ou *Daydream* em algumas versões), abra o widget *Relógio*, escolha *Quando iniciar a proteção de tela* no menu e selecione *Enquanto estiver carregando* ou *Nenhuma das opções*. Um relógio muito atenuado aparecerá em um fundo preto enquanto o dispositivo não estiver ativo.
ru: Один из удобных способов сделать это без большого потребления энергии и назойливой постоянной подсветки — использовать экранную заставку Android: включите ее в разделе *Настройки / Дисплей / Экранная заставка* (или *Daydream* в некоторых версиях), выберите виджет *Часы*, в меню выберите *Когда запускать экранную заставку* и выберите *Во время зарядки* или *И то и другое*. Пока устройство неактивно, на черном фоне будут отображаться очень тусклые часы.
tr: Bu kullanım Android ekran koruyucusunu kullanarak aşırı güç tüketimi olmadan sağlanabilir. *Ayarlar > Ekran > Ekran koruyucu (ya da Daydream)* bölümünden etkinleştirebilirsiniz. *Saat* seçeneğini seçin. Menüden *Ekran koruyucu başlangıç zamanı* seçip, *Şarj olurken* ya da *Her zaman* seçeneğini seçin. Aygıt etkin kullanılmadığında siyah arka planda karartılmış olarak saat görüntülenir.
uk: Один із зручних способів зробити це без великого споживання енергії та настирливого постійного підсвічування — це використовувати екранну заставку Android: увімкніть її в розділі *Налаштування / Екран / Екранна заставка* (або *Daydream* у деяких версіях), оберіть віджет *Годинник*, оберіть у меню *Коли запускати екранну заставку* та оберіть *Під час заряджання* або *І те й інше*. Поки пристрій неактивний, на чорному фоні відображатиметься дуже тьмяний годинник.

source: Please note that you should not use the power button to lock the device as this will turn the screen off. Instead, just wait for the device to lock itself with the screen on.
ar: يرجى ملاحظة أنه لا يجب استخدام زر الطاقة لقفل الجهاز لأن هذا سيؤدي إلى إيقاف تشغيل الشاشة. بدلاً من ذلك، فقط انتظر حتى يقفل الجهاز نفسه مع ترك الشاشة مشغلة.
el: Δεν πρέπει να χρησιμοποιείτε το κουμπί λειτουργίας για να κλειδώσετε τη συσκευή, καθώς έτσι θα απενεργοποιηθεί η οθόνη. Περιμένετε απλώς να κλειδώσει η συσκευή μόνη της.
es: Por favor ten en cuenta que no deberías usar el botón de encendido para bloquear al dispositivo, ya que esto apagará la pantalla. En vez de eso, solo espera que el dispositivo se bloquee por sí mismo con la pantalla encendida.
fa: لطفا در نظر داشته باشید که برای قفل کردن گوشی خود نباید از کلید روشن‌-خاموش استفاده کنید چرا که این کار صفحه را خاموش می‌کند. در عوض، صبر کنید که گوشی‌تان خود به خود و همانطور که صفحه روشن است، قفل شود.
fr: Veuillez noter que vous ne devez pas utiliser le bouton d'alimentation pour verrouiller l'appareil, car cela éteindrait l'écran. Attendez plutôt que l'appareil se verrouille de lui-même avec l'écran allumé.
id: Harap perhatikan bahwa Anda tidak boleh menggunakan tombol daya untuk mengunci perangkat karena ini akan mematikan layar. Sebagai gantinya, tunggu saja perangkat hingga mengunci sendiri dengan layar menyala.
my: စက်ကို လော့ခ်ချရန် ပါဝါခလုတ်ကို အသုံးပြုခြင်းသည် မျက်နှာပြင်ကို ပိတ်စေမည်ဖြစ်သောကြောင့် ယင်းသို့ မပြုလုပ်သင့်ကြောင်း သတိပြုပါ။ ထိုအစား မျက်နှာပြင် ဖွင့်ထားလျက်နှင့် စက်ကို ၎င်းကိုယ်တိုင် လော့ခ်ချရန်သာ စောင့်ဆိုင်းပါ။
pt_br: Por favor, note que você não deveria usar botão de desligar para travar o dispositivo, pois essa ação desligará a tela. Ao invés disso, apenas mantenha a tela ligada e aguarde o dispositivo bloquear a si mesmo.
ru: Обратите внимание, что не следует использовать кнопку питания для блокировки устройства, так как это приведет к выключению экрана. Вместо этого просто подождите, пока устройство заблокируется с включенным экраном.
tr: Ekranı kapatacağı için aygıtı kilitlemek için güç tuşunu kullanmayın. Aygıt ekranı açıkken bir süre sonra kendini kilitler.
uk: Зверніть увагу: не слід використовувати кнопку живлення для блокування пристрою, оскільки це призведе до вимкнення екрана. Замість цього зачекайте, поки пристрій заблокується з увімкненим екраном.

source: If that setup is not an option for you, do not desist yet! If you have a computer with good connectivity that stays on most of the time, please continue reading.
ar: إذا لم يكن هذا الإعداد متاحًا لك، فلا تستسلم بعد! إذا كان لديك جهاز كمبيوتر يتمتع باتصال جيد ويظل مشغلا معظم الوقت، فيرجى متابعة القراءة.
el: Εάν δεν μπορείτε να υποστηρίξετε με αυτό τον τρόπο, μην το εγκαταλείψετε ακόμα! Αν έχετε έναν υπολογιστή με καλή συνδεσιμότητα που παραμένει ενεργοποιημένος τον περισσότερο χρόνο, δείτε παρακάτω.
es: Si esa configuración no es una opción para tí, ¡no te des aún por vencido! Si tienes una computadora con buena conectividad que está activa la mayor parte del tiempo, por favor continúa leyendo.
fa: اگر این امکان را در اختیار ندارید، منصرف نشوید! اگر یک کامپیوتر با اتصال خوبی به اینترنت دارید که بیشتر اوقات روشن است، لطفاً به خواندن ادامه دهید.
fr: Si cette configuration n'est pas envisageable dans votre cas, ne vous découragez pas pour autant ! Si vous avez un ordinateur avec une bonne connectivité, qui reste allumé la plupart du temps, veuillez continuez la lecture de cette section.
id: Jika penyiapan itu bukan pilihan bagi Anda, jangan berhenti dulu! Jika Anda memiliki komputer dengan konektivitas yang baik dan selalu aktif, silakan lanjutkan membaca.
pt_br: Se essa configuração não é possível para você, não desista ainda! Se possuir um computador com uma boa conectividade que fique ligado a maior parte do tempo, por favor continue lendo.
ru: Если такая настройка вам не подходит, не отчаивайтесь! Если у вас есть компьютер с хорошим подключением, который остается включенным большую часть времени, продолжайте читать.
tr: Bu seçenek uygun değilse, henüz pes etmeyin! Sürekli açık iyi bir internet bağlantısı bulunan bir bilgisayarınız varsa okumayı sürdürün.
uk: Якщо таке налаштування Вам не підходить, не засмучуйтесь! Якщо у Вас є компʼютер з гарним живленням і він залишається переважно ввімкненим – продовжуйте читати.

source: Running a bridge on a computer
ar: تشغيل جسر على جهاز كمبيوتر
el: Εκτέλεση γέφυρας σε σταθερό υπολογιστή
es: Ejecutando un puente en una computadora
fa: اجرای یک پل روی یک کامپیوتر
fr: Mettre en place une passerelle sur un ordinateur
id: Menjalankan jembatan di komputer
pt_br: Executando uma ponte em um computador
ru: Запуск моста на компьютере
tr: Bilgisayarda köprü çalıştırmak
uk: Запуск моста на компʼютері
