Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/bridging.po
Languages: ar, el, es, fa, fr, id, my, pt_br, ru, tr, uk

source: **Technical note:** This is mainly due to Android's [Doze mode](https://developer.android.com/training/monitoring-device-state/doze-standby "Android Developers – Optimize for Doze and App Standby") slowing down the operation of the native Ouinet library. Unfortunately, disabling battery optimization for CENO does not seem to exclude Ouinet from it. Your particular device may also include its own power-saving features which may interfere with CENO; please check [Dont't kill my app!][Dont't kill my app!] for your device's brand.
my: **နည်းပညာဆိုင်ရာ မှတ်ချက်-** ယင်းသည် အဓိကအားဖြင့် Android ၏ [ခဏအိပ်မုဒ်](https://developer.android.com/training/monitoring-device-state/doze-standby "Android ဆော့ဖ်ဝဲရေးသူများ - ခဏအိပ်နှင့် အက်ပ် အသင့်အနေအထားအတွက် အကောင်းဆုံးချိန်ညှိပါ") က မူလ Ouinet စာကြည့်တိုက်၏ လုပ်ဆောင်ချက်ကို နှေးစေသောကြောင့် ဖြစ်သည်။ ကံမကောင်းစွာဖြင့် CENO အတွက် ဘက်ထရီ အကောင်းဆုံးချိန်ညှိမှုကို ပိတ်ခြင်းက Ouinet ကို ၎င်းမှ ဖယ်လိုက်သည့်ပုံ မပေါ်ပါ။ သင်၏ တိကျသော စက်တွင်လည်း Ouinet ကို ကြားဝင်နှောင့်ယှက်နိုင်သည့် ၎င်း၏ ကိုယ်ပိုင် ပါဝါချွေတာရေး လုပ်ဆောင်ချက်များ ပါဝင်နိုင်သည်။ သင့်စက်၏ တံဆိပ်အတွက် [Dont't kill my app!][Dont't kill my app!] ကို ကျေးဇူးပြု၍ စစ်ဆေးပါ။

source: [UPnP][UPnP] is the easiest way of making your CENO Browser reachable to the CENO network. The [CENO Settings](settings.md) page will indicate the UPnP status on your local network.
my: [UPnP][UPnP] သည် သင့် CENO ဘရောက်ဇာကို CENO ကွန်ရက်သို့ ရောက်ရှိစေရန်အတွက် အလွယ်ဆုံး နည်းလမ်းဖြစ်သည်။ [CENO ဆက်တင်များ](settings.md) စာမျက်နှာသည် သင့်ဒေသတွင်း ကွန်ရက်တွင် UPnP အခြေအနေကို ဖော်ပြပါမည်။

source: ![Figure: UPnP not enabled](images/upnp-no.png)
my: ![ပုံ- UPnP ဖွင့်မထားပါ](images/upnp-no.png)

source: A status like the one shown in the previous figure indicates that UPnP is not enabled on your WiFi router.
my: ယခင်ပုံတွင် ပြထားသကဲ့သို့ အခြေအနေသည် သင့် WiFi ရောက်တာတွင် UPnP ကို ဖွင့်မထားကြောင်း ညွှန်ပြသည်။

source: ![Figure: UPnP likely enabled](images/upnp-maybe.png)
my: ![ပုံ- UPnP ဖွင့်ထားသည့်ပုံပေါ်သည်](images/upnp-maybe.png)

source: The status above indicates that UPnP is likely working and CENO is currently verifying connectivity.
my: အထက်ပါ အခြေအနေသည် UPnP အလုပ်လုပ်နိုင်ခြေရှိပြီး CENO က လက်ရှိတွင် ချိတ်ဆက်နိုင်မှုကို မှန်ကန်ကြောင်း စစ်ဆေးနေသည်ဟု ညွှန်ပြသည်။

source: ![Figure: UPnP enabled](images/upnp-yes.png)
my: ![ပုံ- UPnP ဖွင့်ထားသည်](images/upnp-yes.png)

source: The status above indicates that UPnP is working and you can bridge connections for other CENO users.
my: အထက်ပါ အခြေအနေသည် UPnP အလုပ်လုပ်နေပြီး သင်သည် အခြား CENO သုံးစွဲသူများအတွက် ချိတ်ဆက်မှုများကို ပေါင်းကူးနိုင်ကြောင်း ညွှန်ပြသည်။

source: Instead of enabling UPnP on your router, you can create a port forwarding rule to make sure that connections from the CENO network are forwarded to your device. You will need to login to the router's administrative interface and locate the *port forwarding* option. To see which IP address you need to forward the connections to and the relevant port, open the *CENO Settings* page and look under the *Local UDP endpoint(s)*.
my: သင့်ရောက်တာတွင် UPnP ကို ဖွင့်မည့်အစား သင်သည် CENO ကွန်ရက်မှ ချိတ်ဆက်မှုများကို သင့်စက်သို့ တစ်ဆင့်ပို့ကြောင်း သေချာစေရန် ပေါ့တ်တစ်ဆင့်ပို့ခြင်း စည်းကမ်းတစ်ခုကို သတ်မှတ်နိုင်သည်။ သင်သည် ရောက်တာ၏ စီမံခန့်ခွဲမှု ကြားခံစနစ်သို့ ဝင်ရောက်ပြီး *ပေါ့တ်တစ်ဆင့်ပို့ခြင်း* ရွေးချယ်စရာကို ရှာဖွေရန် လိုအပ်ပါမည်။ သင် ချိတ်ဆက်မှုများ တစ်ဆင့်ပို့ရန် လိုအပ်သည့် IP လိပ်စာကို ကြည့်ရန် *CENO ဆက်တင်များ* စာမျက်နှာကို ဖွင့်ပြီး *ဒေသတွင်း UDP အဆုံးမှတ်(များ)* အောက်တွင် ကြည့်ပါ။

source: ![Figure: Local UDP endpoints](images/udp-port.png)
my: ![ပုံ- စက်တွင်း UDP အဆုံးမှတ်များ](images/udp-port.png)
