Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/bridging.po
Languages: ar, el, es, fa, fr, id, my, pt_br, ru, tr, uk

source: The port forwarding must be for the UDP protocol (not TCP). CENO chooses a random port on first run and keeps it for subsequent runs, but your device's local network IP address may change from time to time. Thus you should periodically review the *CENO Settings* page to see that your device is reachable to the CENO network.
el: Η προώθηση θύρας πρέπει να γίνει για το πρωτόκολλο UDP (όχι TCP). Το CENO επιλέγει μια τυχαία θύρα κατά την πρώτη εκτέλεση και τη διατηρεί, αλλά η διεύθυνση IP του τοπικού δικτύου της συσκευής σας μπορεί να αλλάζει από καιρό σε καιρό. Συνεπώς, θα πρέπει να επανεξετάζετε περιοδικά τη σελίδα *Ρυθμίσεις CENO* για να βεβαιωθείτε ότι η συσκευή σας είναι προσβάσιμη.
es: La redirección de puerto debe ser para el protocolo UDP (no TCP). CENO elige un puerto aleatorio en la primera ejecución y lo mantiene por las subsiguientes, pero la dirección IP de tu dispositivo en la red local podría cambiar de tiempo en tiempo. Por lo que periódicamente deberías revisar la página *Configuración de CENO* para ver que tu dispositivo sea alcanzable para la red CENO.
fr: La redirection de port doit viser le protocole UDP (et non TCP). CENO choisit un port aléatoire lors de sa première exécution et le conserve pour les exécutions suivantes, mais l'adresse IP du réseau local de votre appareil peut changer de temps en temps. Vous devez donc consulter régulièrement la page des *Paramètres de CENO* pour vérifier que votre appareil est accessible au réseau CENO.
my: ပေါ့တ်တစ်ဆင့်ပို့ခြင်းသည် UDP ပရိုတိုကောအတွက် ဖြစ်ရမည် (TCP မဖြစ်ရပါ)။ CENO သည် ပထမအကြိမ် လုပ်ဆောင်ချိန်တွင် အလျဉ်းသင့်သော ပေါ့တ်တစ်ခုကို ရွေးချယ်ပြီး နောင်လာမည့် လုပ်ဆောင်ချက်များအတွက် ၎င်းကို သိမ်းထားသော်လည်း သင့်စက်၏ ဒေသတွင်း ကွန်ရက် IP လိပ်စာသည် မကြာခဏ ပြောင်းလဲနိုင်သည်။ ထို့ကြောင့် သင်သည် CENO ကွန်ရက်က သင့်စက်ထံ ရောက်ရှိနိုင်ကြောင်း ကြည့်ရန် *CENO ဆက်တင်များ* စာမျက်နှာကို ပုံမှန် စစ်ဆေးသင့်သည်။
pt_br: O redirecionamento de porta deve ser para o protocolo UDP (não TCP). O CENO escolhe uma porta randômica na primeira execução e mantém tal escolha para as execuções subsequentes. Mas o endereço de IP rede local do seu dispositivo pode mudar de tempos em tempos. Por isso, você deveria periodicamente rever a página *Configurações do CENO* para confirmar se seu dispositivo está alcançável pela rede CENO.

source: **Technical note:** Alternatively, you can make sure that the router always assigns the same IP address to your device (e.g. via a static DHCP lease for the device's MAC address).
ar: **ملاحظة تقنية:** بدلاً من ذلك، يمكنك التأكد من أن جهاز التوجيه يعيّن دائمًا عنوان IP نفسه لجهازك (على سبيل المثال، عبر عقد إيجار DHCP ثابت لعنوان MAC الخاص بالجهاز).
el: **Τεχνική σημείωση:** Εναλλακτικά, μπορείτε να βεβαιωθείτε ότι ο δρομολογητής εκχωρεί πάντα την ίδια διεύθυνση IP στη συσκευή σας (π.χ. μέσω ορισμού μιας στατικής IP, για τη διεύθυνση MAC της συσκευής).
es: **Nota técnica:** Alternativamente, puedes asegurarte de que el enrutador siempre confiera la misma dirección IP a tu dispositivo (ej., a través de una asignación DHCP estática para la dirección MAC del dispositivo).
fa: **نکات فنی:** به عنوان راه‌حل جایگزین، می‌توانید همیشه دقت کنید که مودم آدرس آی‌پی یکسانی را به‌کار می‌گیرد. (به طور مثال، از طریق یک DHCP ثابت برای دستگاه‌های MAC).
fr: **Note technique :** Vous pouvez également vous assurer que le routeur attribue toujours la même adresse IP à votre appareil (par exemple via un abonnement DHCP statique pour l'adresse MAC de l'appareil).
id: **Catatan teknis:** Sebagai alternatif, Anda dapat memastikan bahwa ruter selalu menetapkan alamat IP yang sama ke perangkat Anda (misalnya melalui penyewaan DHCP statis untuk alamat MAC perangkat).
my: **နည်းပညာဆိင်ရာ မှတ်ချက်-** တစ်နည်းအားဖြင့် သင်သည် ရောက်တာက သင့်စက်ကို တူညီသော IP လိပ်စာ အမြဲသတ်မှတ်ပေးရန် (ဥပမာ- စက်၏ MAC လိပ်စာအတွက် တည်တံ့သော DHCP အငှားမှတစ်ဆင့်) သေချာအောင်ပြုလုပ်နိုင်သည်။
pt_br: **Nota técnica:** Alternativamente, você pode garantir que o roteador sempre destine o mesmo endereço de IP para o seu dispostivo (por exemplo, via assinatura DHCP estática para o endereço MAC do disposiivo).
ru: **Техническое примечание:** В качестве альтернативы вы можете убедиться, что роутер всегда назначает один и тот же IP-адрес вашему устройству (например, с помощью статической аренды DHCP для MAC-адреса устройства).
tr: **Teknik not:** Ayrıca yönlendiricinizden aygıtınızın yerel IP adresini sabitleyebilirsiniz (örneğin DHCP ayarlarından aygıtınızın MAC adresine bir sabit IP atayabilirsiniz.
uk: **Технічне примітка:** Як альтернатива, Ви можете переконатися, що маршрутизатор завжди призначає ту саму IP-адресу Вашому пристрою (наприклад, за допомогою статичної оренди DHCP для MAC-адреси пристрою).

source: [Doze mode]: https://developer.android.com/training/monitoring-device-state/doze-standby
ar: [وضع الغفوة]: https://developer.android.com/training/monitoring-device-state/doze-standby
es: [Modo doze]: https://developer.android.com/training/monitoring-device-state/doze-standby
fr: [Mode Doze]: https://developer.android.com/training/monitoring-device-state/doze-standby
id: [Mode istirahat]: https://developer.android.com/training/monitoring-device-state/doze-standby
my: [ခဏအိပ်မုဒ်]: https://developer.android.com/training/monitoring-device-state/doze-standby
pt_br: [Modo soneca]: https://developer.android.com/training/monitoring-device-state/doze-standby
ru: [режим Doze]: https://developer.android.com/training/monitoring-device-state/doze-standby
tr: [Doze kipi]: https://developer.android.com/training/monitoring-device-state/doze-standby
uk: [режим Doze]: https://developer.android.com/training/monitoring-device-state/doze-standby

source: [docker]: https://en.wikipedia.org/wiki/Docker_(software)
ar: [docker]: https://ar.wikipedia.org/wiki/%D8%AF%D9%88%D9%83%D8%B1_(%D8%A8%D8%B1%D9%85%D8%AC%D9%8A%D8%A9)
el: [docker]: https://en.wikipedia.org/wiki/Docker_(λογισμικό)
es: [docker]: https://es.wikipedia.org/wiki/Docker_(software)
fr: [docker]: https://fr.wikipedia.org/wiki/Docker_(logiciel)
pt_br: [docker]: https://pt.wikipedia.org/wiki/Docker_(software)
ru: [docker]: https://ru.wikipedia.org/wiki/Docker
tr: [docker]: https://tr.wikipedia.org/wiki/Docker
uk: [docker]: https://uk.wikipedia.org/wiki/Docker

source: [UPnP]: https://en.wikipedia.org/wiki/Universal_Plug_and_Play
ar: [UPnP]: https://ar.wikipedia.org/wiki/%D8%A7%D9%84%D8%AA%D9%88%D8%B5%D9%8A%D9%84_%D9%88%D8%A7%D9%84%D8%AA%D8%B4%D8%BA%D9%8A%D9%84_%D8%A7%D9%84%D8%B9%D8%A7%D9%84%D9%85%D9%8A
es: [UPnP]: https://es.wikipedia.org/wiki/Universal_Plug_and_Play
fr: [UPnP]: https://fr.wikipedia.org/wiki/Universal_Plug_and_Play
pt_br: [UPnP]: https://pt.wikipedia.org/wiki/Universal_Plug_and_Play
ru: [UPnP]: https://ru.wikipedia.org/wiki/UPnP
tr: [UPnP]: https://tr.wikipedia.org/wiki/UPnP
uk: [UPnP]: https://uk.wikipedia.org/wiki/UPnP

source: [CGNAT]: https://en.wikipedia.org/wiki/Carrier-grade_NAT
fr: [CGNAT]: https://fr.wikipedia.org/wiki/Carrier-grade_NAT
pt_br: [CGNAT]: https://pt.wikipedia.org/wiki/Carrier_Grade_NAT
tr: [CGNAT]: https://www.technopat.net/2021/06/13/cgnat-carrier-grade-nat-nedir/

source: Helping other Ceno users browse the Web
ar: مساعدة مستخدمي Ceno الآخرين على تصفح الويب
fa: کمک به سایر کاربران Ceno برای مرور وب
id: Membantu pengguna Ceno lainnya menjelajahi Web
ru: Помощь другим пользователям Ceno в просмотре веб-страниц
tr: Diğer Ceno kullanıcılarının internet üzerinde gezinmesine yardımcı olmak
uk: Допомога іншим користувачам Ceno у перегляді веб-сторінок

source: A peer-to-peer network is built from every node connected to it (yes, that means you as well!). The more nodes, the stronger and more versatile the network becomes. If you are running Ceno Browser from a country that does not censor the Internet (or not as heavily as some), consider helping other Ceno users by becoming a **bridge** node. You will then begin to route traffic between clients living in heavily censored countries and Ceno injectors. You will not be able to see their traffic (it will be sent through an encrypted tunnel), nor will any of this traffic remain on your device.
ar: يتم بناء شبكة نظير إلى نظير من كل عقدة متصلة بها (نعم، هذا يعنيك أيضًا!). كلما زاد عدد العقد، كلما أصبحت الشبكة أقوى وأكثر تنوعًا. إذا كنت تقوم بتشغيل متصفح Ceno من بلد لا يفرض رقابة على الإنترنت (أو أقل من بعض الدول)، ففكر في مساعدة مستخدمي Ceno الآخرين من خلال أن تصبح عقدة **جسر**. ستبدأ حينها في توجيه حركة المرور بين العملاء الذين يعيشون في البلدان الخاضعة للرقابة الشديدة وبين حاقنات Ceno. لن تكون قادرًا على رؤية حركة المرور الخاصة بهم (سيتم إرسالها عبر نفق مشفر)، ولن تظل أي من حركة المرور هذه على جهازك.
fa: یک شبکه همتا به همتا (Peer to Peer) از طریق اتصال تک‌تک نقطه‌ها (Nodes) به آن ساخته می‌شود. این بدین معنی است که شما نیز بخشی از این اتصال هستید. هرچقدر که نقاط اتصال بیشتر باشند، شبکه قوی‌تر و کاربردی‌تر می‌شود. اگر شما در کشوری که اینترنت را سانسور نمی‌کند یا دست کم در مقایسه با دیگر کشورها کمتر سانسور می‌کند، از مرورگر Ceno استفاده می‌کنید، می‌توانید با برقراری پل اتصال به دیگر کاربران Ceno کمک کنید. به این شکل می‌توانید ترافیک شبکه را میان کاربران Ceno در کشورهای با سانسور شدید اینترنت و انژکتورهای Ceno هدایت کنید. البته شما قادر به دیدن ترافیک آن‌ها نخواهید بود چرا که این ترافیک از یک تونل رمزنگاری شده عبور می‌کند. همچنین هیچ‌کدام از این ترافیک‌ ها در دستگاه شما ذخیره نخواهد شد.
id: Jaringan klien ke klien dibangun dari setiap simpul yang terhubung dengannya (ya, itu berarti Anda juga!). Semakin banyak simpul, semakin kuat dan serbaguna jaringan tersebut. Jika Anda menjalankan Peramban Ceno dari negara yang tidak menyensor Internet (atau sensornya tidak begitu ketat), pertimbangkan untuk membantu pengguna Ceno lainnya dengan menjadi simpul **jembatan**. Anda kemudian akan mulai merutekan lalu lintas antara klien yang tinggal di negara dengan sensor ketat dan injektor Ceno. Anda tidak akan dapat melihat lalu lintas mereka (itu akan dikirim melalui terowongan terenkripsi), lalu lintas ini juga tidak akan tetap ada di perangkat Anda.
ru: Пиринговая сеть строится из каждого подключенного к ней узла (да, это означает и вас!). Чем больше узлов, тем сильнее и гибче становится сеть. Если вы используете Браузер Ceno в стране, где нет цензуры в интернете (или она не такая жесткая, как в некоторых других), подумайте о том, чтобы помочь другим пользователям Ceno, став **мостовым** узлом. Тогда вы начнете маршрутизировать трафик между клиентами, живущими в странах с жесткой цензурой, и инжекторами Ceno. Вы не сможете видеть их данные (он будет отправляться через зашифрованный туннель), и на вашем устройстве эти данные тоже не останутся.
tr: Bağlanan tüm katılımcılardan (bu sizi de içeriyor) eşler arası bir ağ kurulur. Katılımcıların artması, ağı hızlandırır ve güçlendirir. Ceno Browser uygulamasını internet sansürü uygulamayan (veya az uygulayan) bir ülkeden kullanıyorsanız, bir **köprü** katılımcısı olarak diğer Ceno kullanıcılarına yardım etmeyi düşünebilirsiniz. Böylece aşırı sansür uygulanan ülkelerde yaşayan istemciler ve içerik ekleyiciler arasındaki trafiği aktarabilirsiniz. Onların trafiğini göremeyecek (şifrelenmiş olarak aktarılır) veya aygıtınızda tutmayacaksınız.
uk: Однорангова мережа будується з кожного підключеного до неї вузла (так, це означає і Вас!). Чим більше вузлів, тим сильнішою і гнучкішою стає мережа. Якщо Ви використовуєте браузер Ceno в країні, де немає цензури Інтернету (або цензура не така жорстка, як в інших країнах), допоможіть іншим користувачам Ceno, ставши **мостовим** вузлом. У цьому випадку Ви почнете маршрутизувати трафік між інʼєкторами Ceno та клієнтами, що живуть у країнах із жорсткою цензурою. Ви не будете бачити трафік цих користувачів (він буде надсилатися через зашифрований тунель), і на Вашому пристрої ці дані теж не залишаться.

source: **Note:** The configuration described in this section may also help your device to effectively seed content to others on the distributed cache, so please consider applying it as well when using Ceno in a censoring country (but keep in mind the [risks](../concepts/risks.md) of serving such content to others).
ar: **ملاحظة:** قد تساعد التهيئة الموضحة في هذا القسم جهازك على توزيع المحتوى بشكل فعال للآخرين على ذاكرة التخزين المؤقت الموزعة، لذا خذ بعين الإعتبار إمكانية تطبيقها أيضًا عند استخدام Ceno في دولة تخضع للرقابة (ولكن تذكر [المخاطر](../concepts/risks.md) عند تقديم محتوى كهذا للآخرين).
fa: **توجه:** همچنین پیکربندی مورد اشاره در این بخش می‌تواند به دستگاه شما در قرار دادن محتوا در حافظه پنهان (کش) دستگاه دیگر کاربران کمک کند. بنابراین خواهشمندیم که هنگام استفاده از Ceno در کشوری که اینترنت را سانسور می‌کند، این گزینه را نیز در نظر بگیرید. (البته به یاد داشته باشید که این کار [خطرات](../concepts/risks.md) مخصوص خود را نیز دارد).
id: **Catatan:** Konfigurasi yang dijelaskan di bagian ini juga dapat membantu perangkat Anda untuk menyebarkan konten secara efektif ke orang lain di tembolok terdistribusi, jadi harap pertimbangkan untuk menerapkannya juga saat menggunakan Ceno di negara yang menyensor internet (namun ingat [risikonya](../concepts/risks.md) saat menyajikan konten tersebut kepada orang lain).
ru: **Примечание:** Конфигурация, описанная в этом разделе, также может помочь вашему устройству эффективно передавать контент другим пользователям в распределенном кэше, поэтому рассмотрите возможность ее применения при использовании Ceno в стране с цензурой (но помните о [рисках](../concepts/risks.md) при передаче такого контента другим пользователям).
tr: **Not:** Bu bölümde anlatılan yapılandırma aynı zamanda dağıtılmış ön bellekteki diğer istemcilere verimli olarak içerik göndermenizi sağlayabilir. Bu yüzden sansür uygulanan bir ülkede bulunuyorsanız bu Ceno yapılandırmasını kullanmayı değerlendirin (ama [tehlikeleri](../concepts/risks.md) unutmayın).
uk: **Примітка:** Описана в цьому розділі конфігурація також дозволить Вашому пристрою ефективно передавати вміст іншим користувачам у розподіленому кеші, тому розгляньте можливість застосування цієї конфігурації при використанні Ceno в країні з цензурою (але памʼятайте про [ризики](../concepts/risks.md) при передачі такого вмісту іншим користувачам).

source: How to become a Ceno bridge
ar: كيف تصبح جسرًا لـ Ceno
fa: چگونه تبدیل به یک پل Ceno بشویم
id: Bagaimana menjadi jembatan Ceno
ru: Как стать мостом Ceno
tr: Nasıl bir Ceno köprüsü olunur
uk: Як стати мостом Ceno

source: This functionality is already built into Ceno Browser. Your device will need to be connected to a Wi-Fi network that has either UPnP enabled or explicit port forwarding configured for Ceno. See the next sections for further details.
ar: هذه الخاصية مضمنة بالفعل في متصفح Ceno. سيحتاج جهازك إلى الاتصال بشبكة Wi-Fi ثم تمكين UPnP أو إعادة توجيه منفذ صريح تم تهيئته لـ Ceno. انظر الأقسام التالية لمزيد من التفاصيل.
fa: این ویژگی کاربردی در مرورگر Ceno از قبل طراحی شده است. دستگاه شما باید به اینترنت وای‌فای متصل باشد به طوری که در شبکه وای فای (UPnP (universal plug and play یا همان معیار اجرا و اتصال همگانی فعال باشد یا پورت مستقیم به Ceno داشته باشد.
id: Fungsionalitas ini sudah ada di dalam Peramban Ceno. Perangkat Anda harus terhubung ke jaringan Wi-Fi yang mengaktifkan UPnP atau penerusan porta eksplisit yang dikonfigurasi untuk Ceno. Lihat bagian selanjutnya untuk detail lebih lanjut.
ru: Эта функция уже встроена в Браузер Ceno. Ваше устройство должно быть подключено к сети Wi-Fi, в которой либо включен UPnP, либо настроена явная переадресация портов для Ceno. Более подробную информацию см. в следующих разделах.
tr: Bu özellik zaten Ceno Browser uygulamasının içinde vardır. Aygıtınızın, UPnP etkinleştirilmiş veya Ceno için açık bağlantı noktası yönlendirmesi yapılandırılmış olan bir kablosuz ağa bağlı olması gereklidir. Ayrıntılar için bir sonraki bölüme bakın.
uk: Ця функція вже вбудована в браузер Ceno. Ваш пристрій має підключатися до мережі Wi-Fi, в якій або ввімкнено UPnP, або налаштовано переадресацію портів для Ceno. Докладнішу інформацію дивіться в наступних розділах.

source: However, please note that Android will only allow a mobile device to act as a proper bridge while you are actively using it, as power-saving features will throttle the operation of Ceno otherwise.
ar: ومع ذلك، يرجى ملاحظة أن أندرويد لا يسمح للجهاز المحمول بالعمل كجسر إلا أثناء استخدامه فعليا، بما أن ميزات توفير الطاقة تؤدي إلى إعاقة تشغيل Ceno.
fa: به هر حال به خاطر داشته باشید که سیستم‌عامل اندروید تنها در شرایطی به یک دستگاه موبایل اجازه فعالیت به عنوان یک پل Ceno را می‌دهد که شما در حال کار با آن باشید. به طور مثال حالت ذخیره انرژی عملکرد Ceno را مختل می‌کند.
id: Namun, perlu diketahui bahwa Android hanya akan mengizinkan perangkat seluler untuk bertindak sebagai jembatan yang tepat saat Anda menggunakannya secara aktif, karena jika tidak, fitur hemat daya akan membatasi pengoperasian Ceno.
ru: Однако обратите внимание, что Android позволит мобильному устройству работать в качестве моста только при активном использовании, иначе функции энергосбережения будут ограничивать работу Ceno.
tr: Bununla birlikte, Android aygıtlar yalnızca etkin olarak kullanılırken köprü işlevi görebilir. Güç koruma özellikleri Ceno işlemlerini kısıtlar.
uk: Однак, зверніть увагу: Android дозволить мобільному пристрою працювати як міст тільки під час активного використання, інакше функції енергозбереження обмежуватимуть роботу Ceno.

source: **Technical note:** This is mainly due to Android's [Doze mode](https://developer.android.com/training/monitoring-device-state/doze-standby "Android Developers – Optimize for Doze and App Standby") slowing down the operation of the native Ouinet library. Unfortunately, disabling battery optimization for Ceno does not seem to exclude Ouinet from it. Your particular device may also include its own power-saving features which may interfere with Ceno; please check [Don't kill my app!][Don't kill my app!] for your device's brand.
ar: **ملاحظة تقنية:** يرجع هذا أساسًا إلى [وضع الغفوة](https://developer.android.com/training/monitoring-device-state/doze-standby "Android Developers – Optimize for Doze and App Standby") في أندرويد والذي يبطئ تشغيل مكتبة Ouinet الأصلية. لسوء الحظ، لا يبدو أن تعطيل توفير البطارية لـ Ceno لا يستبعد Ouinet من ذلك. قد يشتمل جهازك الخاص أيضًا على ميزات توفير الطاقة الخاصة به والتي قد تتداخل مع Ceno؛ يرجى التحقق من [Don't kill my app!][Don't kill my app!] للعلامة التجارية لجهازك.
fa: **نکته‌ی فنی:** این موضوع بیشتر به ویژگی‌های اندروید اختصاص دارد : در حالت [Doze](https://developer.android.com/training/monitoring-device-state/doze-standby) یا استندبای اندروید عملکرد اصلی مجموعه Ouinet را کند می‌کند. متاسفانه غیر فعال کردن گزینه بهینه‌‌سازی باتری برای Ceno کتابخانه Ouinet را از این وضعیت مستثنی نمی‌کند. ممکن است دستگاه خاص شما تنظیمات ذخیره انرژی ویژه خود را داشته باشد که این هم در عملکرد سنو اختلال ایجاد می‌کند. در این مورد به این وب سایت بروید و گزینه [Don't kill my app!][Don't kill my app!] را برای مدل دستگاه خود چک کنید.
id: **Catatan teknis:** Hal ini terutama disebabkan oleh [Mode istirahat](https://developer.android.com/training/monitoring-device-state/doze-standby "Pengembang Android – Mengoptimalkan Aplikasi untuk Mode Istirahat dan Siaga") Android yang memperlambat pengoperasian pustaka asli Ouinet. Sayangnya, menonaktifkan pengoptimalan baterai untuk Ceno sepertinya tidak mengecualikan Ouinet juga. Perangkat Anda mungkin juga menyertakan fitur penghemat dayanya sendiri yang dapat mengganggu Ceno. Silakan periksa [Jangan bunuh aplikasiku!][Jangan bunuh aplikasiku!] untuk merek perangkat Anda.
ru: **Техническое примечание:** В основном это связано с тем, что [режим Doze](https://developer.android.com/training/monitoring-device-state/doze-standby "Android Developers - Optimize for Doze and App Standby") в Android замедляет работу родной библиотеки Ouinet. К сожалению, даже отключение оптимизации батареи для Ceno, похоже, не выводит Ouinet из этого режима. Ваше конкретное устройство также может включать свои собственные функции энергосбережения, которые могут мешать работе Ceno; пожалуйста, проверьте [Не убивайте мое приложение!][Не убивайте мое приложение!] на предмет марки вашего устройства.
tr: **Teknik not:** Bunun asıl nedeni Android üzerindeki [hazırda bekleme kipi](https://developer.android.com/training/monitoring-device-state/doze-standby "Android Developers – Optimize for Doze and App Standby") tarafından Ouinet kitaplığının çalışmasının yavaşlatılmasıdır. Ne yazık ki Ceno uygulamasını pil iyileştirme ayarlarından çıkartmak Ouinet için geçerli olmuyor. Bunun yanında aygıtınızın Ceno uygulamasını da etkileyebilecek pil koruma özellikleri olabilir. Lütfen aygıtınızın markasına [Don't kill my app!][Don't kill my app!] üzerinden bakın.
uk: **Технічне примітка:** В основному це повʼязано з тим, що [режим Doze](https://developer.android.com/training/monitoring-device-state/doze-standby "Android Developers – Optimize for Doze and App Standby") від Android уповільнює роботу своєї бібліотеки Ouinet. На жаль, навіть відключення оптимізації батареї для Ceno, схоже, не виводить Ouinet із цього режиму. Ваш конкретний пристрій також може мати власні функції енергозберігання, що здатні заважати роботі Ceno; будь ласка, перевірте [Не вбивайте мою програму!][Не вбивайте мою програму!] для Вашої моделі пристрою.

source: Thus if you intend to have Ceno acting as a permanent, always-reachable bridge, besides a properly configured Wi-Fi network you will need to:
ar: وبالتالي، إذا كنت تنوي جعل Ceno يعمل كجسر دائم يمكن الوصول إليه دائمًا، إلى جانب شبكة Wi-Fi مهيأة بشكل صحيح، فستحتاج إلى:
fa: بنابراین اگر می‌خواهید که Ceno همیشه به عنوان یک پل در دسترس، روی دستگاه شما فعال باشد علاوه بر داشتن وای‌فای مناسب باید:
id: Jadi, jika Anda ingin Ceno bertindak sebagai jembatan permanen yang selalu dapat dijangkau, selain jaringan Wi-Fi yang dikonfigurasi dengan benar, Anda perlu:
ru: Таким образом, если вы планируете, чтобы Ceno работал как постоянный, всегда доступный мост, помимо правильно настроенной сети Wi-Fi вам потребуется:
tr: Ceno uygulamasını yapılandırılmış bir kablosuz ağ üzerinde kalıcı olarak çalışan ve her zaman erişilebilecek bir köprü olarak kullanmak istiyorsanız, şunları yapmalısınız:
uk: Таким чином, якщо для Вас важливо, щоб Ceno працював як постійний і завжди доступний міст, окрім правильно налагодженої мережі Wi-Fi, Вам необхідно:
