Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/install.po
Languages: ar, el, es, fa, fr, id, my, pt, ru, tr, uk, ur

source: **Note:** If the actions below the notification are not visible, drag the notification from its center towards the bottom to unfold it. If you can only see the *Home* action, your device may be too old to support the *Erase* action.
ar: **ملاحظة:** إذا كانت الإجراءات الموجودة أسفل الإشعار غير مرئية، فاسحب الإشعار من مركزه باتجاه الجزء السفلي لفتحه. إذا كان بإمكانك رؤية الإجراء *الرئيسية* فقط، فقد يكون جهازك قديمًا جدًا لدعم إجراء *مسح*.
el: **Σημείωση:** Εάν οι ενέργειες κάτω από την ειδοποίηση δεν είναι ορατές, σύρετε την ειδοποίηση από το κέντρο προς τα κάτω για να εμφανιστεί. Εάν βλέπετε μόνο την επιλογή *Αρχική*, η συσκευή σας πιθανός δεν υποστηρίζει την ενέργεια *Διαγραφή*.
es: **Nota:** Si las acciones debajo de la notificación no son visibles, arrastra la notificación desde su centro hacia el fondo para desplegarla. Si sólo aparece la acción *Inicio*, puede que tu dispositivo sea demasiado antiguo para permitir la acción *Borrar*.
fr: **Note :** Si vous ne voyez pas les actions situées sous la notification, dépliez la notification en la faisant glisser de son centre vers le bas. Si vous ne voyez que l’action *Accueil*, il se peut que votre appareil soit trop ancien pour prendre l’action *Effacer* en charge.
id: **Catatan:** Jika tindakan di bawah notifikasi tidak terlihat, seret notifikasi dari tengah ke arah bawah untuk membukanya. Jika Anda hanya dapat melihat tindakan *Beranda*, perangkat Anda mungkin terlalu tua untuk mendukung tindakan *Hapus*.
my: **မှတ်ချက် -** အသိပေးချက်အောက်ရှိ လုပ်ဆောင်ချက်များကို မမြင်နိုင်ပါက အသိပေးချက်ကို ဖြန့်ရန် ၎င်း၏ ဗဟိုမှ အောက်ခြေဘက်သို့ ဆွဲပါ။ *Home* လုပ်ဆောင်ချက်ကိုသာ မြင်နိုင်ပါက၊ သင်၏စက်ပစ္စည်းသည် *Erase* လုပ်ဆောင်ချက်ကို ပံ့ပိုးရန်အတွက် အလွန်ဟောင်းနေခြင်း ဖြစ်နိုင်သည်။
pt: **Nota:** Se as ações abaixo da notificação não estiverem visíveis, arraste a notificação do centro até a parte inferior para mostrá-la. Se apenas consegue ver a ação *Início*, pode ser que o seu aparelho seja muito antigo para suportar a ação *Apagar*.
ru: **Примечание:** Если действия под уведомлением не видны, перетащите уведомление от центра к низу, чтобы развернуть его. Если вы видите только действие *Домой*, возможно, ваше устройство слишком старое для поддержки действия *Стереть*.
tr: **Not:** Bildirimin altındaki işlemler görüntülenmiyorsa bildirimin ortasından aşağıya doğru çekerek bildirimi genişletmeye çalışın. Yalnızca *Giriş sayfası* işlemini görüyorsanız, aygıtınız *Sil* işlemini desteklemeyecek kadar eski olabilir.
ur: **نوٹ:** اگر نوٹیفکیشن کے نیچے کی کارروائیاں نظر نہیں آ رہی ہیں، تو اسے کھولنے کے لیے نوٹیفکیشن کو اس کے مرکز سے نیچے کی طرف کھینچیں۔ اگر آپ صرف * ہوم * ایکشن دیکھ سکتے ہیں تو ، آپ کا ڈیوائس *مٹا دیں* عمل کی حمایت کرنے کے لئے بہت پرانا ہوسکتا ہے۔

source: Shall you ever need to quickly stop Ceno and clear absolutely all data related to it (not only cached content, but also settings like favorites, passwords and all browsing history), you can tap on *Erase*. To avoid losing your data accidentally, this will not remove anything yet, but just show an additional action for a brief moment, as pictured below:
ar: إذا احتجت في أي وقت إلى إيقاف Ceno بسرعة ومسح جميع البيانات المتعلقة به تمامًا (ليس فقط المحتوى المخزن مؤقتًا، ولكن أيضًا الإعدادات مثل المفضلات وكلمات المرور وسجل تاريخ التصفح كله)، يمكنك النقر فوق *مسح*. لتجنب فقدان بياناتك عن طريق الخطأ، لن يؤدي هذا إلى إزالة أي شيء مباشرة، ولكن سيعرض إجراءًا إضافيًا للحظة وجيزة، كما هو موضح أدناه:
el: Εάν χρειαστεί να σταματήσετε γρήγορα το Ceno και να διαγράψετε απολύτως όλα τα δεδομένα που σχετίζονται με αυτό (όχι μόνο το αποθηκευμένο περιεχόμενο αλλά και ρυθμίσεις όπως τα αγαπημένα, οι κωδικοί πρόσβασης και όλο το ιστορικό περιήγησης), μπορείτε να πατήσετε το *Διαγραφή*. Για να μη χάσετε κατά λάθος τα δεδομένα σας, δε θα διαγράψει τίποτα, αλλά απλώς θα εμφανίσει μια σύντομη πρόσθετη ενέργεια, όπως παρακάτω:
es: Si alguna vez necesitaras detener Ceno rápidamente y limpiar absolutamente todos los datos relacionados con él (no solamente el contenido cacheado, sino también configuraciones como favoritos, contraseñas y todo el historial de navegación), puedes pulsar sobre *Borrar*. Para evitar perder tus datos accidentalmente, esto aún no eliminará nada, solo te mostrará una acción adicional por un breve momento, como se ilustra abajo:
fr: Si vous devez arrêter Ceno rapidement et effacer toutes ses données sans exception (non seulement le contenu du cache, mais aussi les paramètres tels que les favoris, les mots de passe et tout l’historique de navigation), vous pouvez toucher *Effacer*. Pour éviter de perdre accidentellement vos données, rien ne sera supprimé à ce stade, mais une action supplémentaire apparaîtra pendant un instant, comme illustré ci-dessous :
id: Mungkin anda pernah membutuhkan untuk menghentikan secara cepat Ceno dan menghapus semua data terkait dengan pasti (tidak hanya konten tembolok, tetapi juga pengaturan seperti favorit, kata sandi, dan semua jejak peramban), anda dapat mengetuk pada *Hapus*. Untuk menghindari kehilangan data secara tidak sengaja, ini tidak akan menghapus apapun, tetapi hanya menampilkan aksi tambahan untuk momen singkat, sebagaimana digambarkan dibawah:
my: သင်သည် Ceno ကို လျင်မြန်စွာ ရပ်တန့်ပြီး ၎င်းနှင့်သက်ဆိုင်သော (ယာယီ သိမ်းဆည်းထားသော အကြောင်းအရာသာမက အနှစ်သက်ဆုံးများ၊ စကားဝှက်များနှင့် ရှာဖွေမှု မှတ်တမ်း အားလုံးကိုပါ) ဒေတာအားလုံးကို လုံးဝ ရှင်းလင်းရန် လိုအပ်ပါက သင်သည် *ဖျက်ရန်* ကို နှိပ်နိုင်သည်။ သင့်ဒေတာ မတော်တဆ ဆုံးရှုံးခြင်းကို ရှောင်ရှားရန်အတွက် ယင်းသည် မည်သည့်အရာကိုမျှ မဖယ်ရှားသေးဘဲ အောက်ပါပုံတွင် ပြထားသည့်အတိုင်း ထပ်ဆောင်း လုပ်ဆောင်ချက်တစ်ခုကို ခဏ ပြသပါမည်-
pt: Caso alguma vez precise interromper o Ceno rapidamente e limpar absolutamente todos os dados lhe relacionados (não apenas o conteúdo em cache, mas também configurações como favoritos, palavras-passe e todo o histórico de navegação), pode tocar em *Apagar*. Para evitar perder todos os seus dados acidentalmente, essa ação ainda não removerá tudo, mas apenas mostrar uma ação adicional por um breve momento, como ilustrado abaixo:
ru: Если вам нужно быстро остановить Ceno и очистить все данные, связанные с ним (кэшированное содержимое, настройки, избранное, пароли и всю истории просмотров), вы можете нажать на *Стереть*. Во избежание случайной потери данных, необходимо подтвердить запрос на удаление. Как показано на рисунке ниже:
tr: Ceno uygulamasını hızlıca durdurup ilişkili tüm verileri (ön bellekteki verilerin yanında, yer imleri, parolalar ve gezinme geçmişi gibi ayarlar) silmeniz gerekirse, *Sil* düğmesine dokunabilirsiniz. Yanlışlıkla dokunduğunuzda verilerinizi kaybetmemeniz için, veriler hemen silinmez ve kısa bir süre için aşağıdaki gibi bir ek ileti görüntülenir:
ur: کیا آپ کو کبھی بھی Ceno کو فوری طور پر روکنے اور اس سے متعلق تمام ڈیٹا کو صاف کرنے کی ضرورت پڑے گی (نہ صرف کیش شدہ مواد، بلکہ ترتیبات جیسے پسندیدہ، پاس ورڈ اور تمام براؤزنگ کی سرگزشت بھی)، آپ *مٹا دیں* كو دبا سکتے ہیں۔ آپ کا ڈیٹا حادثاتی طور پر ضائع ہونے سے بچنے کے لیے، یہ ابھی تک کچھ بھی نہیں ہٹائے گا، لیکن صرف ایک مختصر لمحے کے لیے ایک اضافی کارروائی دکھائیں، جیسا کہ ذیل کی تصویر میں دکھایا گیا ہے:

source: ![Figure: The last action stops Ceno and clears all its data](images/tap-purge.png)
ar: ![الشكل: الإجراء الأخير يوقف Ceno ويمسح جميع بياناته](images/tap-purge.png)
el: ![Εικόνα: Η τελευταία ενέργεια σταματά και διαγράφει όλα τα δεδομένα του Ceno](images/tap-purge.png)
es: ![Figura: La última acción detiene Ceno y limpia todos sus datos](images/tap-purge.png)
fr: ![Figure: La dernière action arrête Ceno et efface toutes ses données](images/tap-purge.png)
id: ![Figure: Aksi terakhir untuk menghentikan Ceno dan menghapus semua datanya](images/tap-purge.png)
my: ![ပုံ - နောက်ဆုံး လုပ်ဆောင်ချက်သည် Ceno ကို ရပ်တန့်ပြီး ၎င်း၏ ဒေတာအားလုံးကို ရှင်းလင်းသည်](images/tap-purge.png)
pt: ![Figura: A última ação interrompe o Ceno e limpa todos os seus dados](images/tap-purge.png)
ru: ![Рисунок: Последнее действие останавливает Ceno и очищает все его данные](images/tap-purge.png)
tr: ![Görsel: Tüm Ceno verilerini silip uygulamayı durdurmak için son işlem](images/tap-purge.png)
ur: ![تصویر: آخری کارروائی Ceno کو روکتی ہے اور اس کے تمام ڈیٹا کو صاف کرتی ہے](images/tap-purge.png)

source: If you tap on the *Yes* action, Ceno will be stopped and all its data removed *without further questions*, effectively leaving your device as if Ceno had never been used.
ar: إذا قمت بالنقر فوق الإجراء *نعم*، فسيتم إيقاف Ceno وإزالة جميع بياناته *دون أسئلة أخرى*، مما يترك جهازك كما لو لم يتم استخدام Ceno من قبل.
el: Εάν πατήσετε το *Ναι*, το Ceno θα σταματήσει και όλα τα δεδομένα θα αφαιρεθούν *χωρίς περαιτέρω ερωτήσεις*, αφήνοντας ουσιαστικά τη συσκευή σας σαν να μην είχε ποτέ το Ceno.
es: Si pulsas sobre la acción *Sí*, Ceno será detenido y todos sus datos removidos *sin más preguntas*, dejando efectivamente tu dispositivo como si Ceno nunca hubiese sido usado.
fr: Si vous touchez l’action *Oui*, Ceno s’arrêtera et toutes ses données seront supprimées *sans autre question*, laissant votre appareil comme si Ceno n’avait jamais été utilisé.
id: Jika anda mengetuk pada aksi *Ya*, Ceno akan menghentikan dan menghapus semua datanya *tanpa pertanyaan lanjutan*, sangat efektif meninggalkan perangkat selama jika Ceno telah lama tidak digunakan.
my: သင်သည် *လုပ်မည်* လုပ်ဆောင်ချက်ကို နှိပ်လျှင် Ceno ကို ရပ်တန့်ပြီး ၎င်း၏ ဒေတာအားလုံးကို *နောက်ထပ် မေးခွန်း မမေးဘဲ* ဖယ်ရှားမည်ဖြစ်ပြီး သင့်စက်တွင် Ceno ကို လုံးဝ အသုံးမပြုဖူးသကဲ့သို့ ထိရောက်စွာ ချန်ခဲ့ပါမည်။
pt: Se tocar na ação *Sim*, o Ceno irá ser interrompido e todos os seus dados serão removidos *sem mais perguntas*, efetivamente deixando o seu aparelho como se o Ceno nunca tivesse sido usado.
ru: Если вы нажмете на кнопку *Да*, Ceno будет остановлен и все его данные будут удалены *без дополнительных вопросов*, фактически оставляя ваше устройство таким, как если бы Ceno никогда не использовался.
tr: *Evet* (görseldeki Yes) işlemine dokunursanız Ceno durdurulur ve tüm veriler *hiçbir soru sorulmadan* silinir. Aygıtınız hiç Ceno kullanmamış gibi olur.
ur: اگر آپ *جی ہاں* ایکشن پر دباتے ہیں، تو Ceno روک دیا جائے گا اور اس کا تمام ڈیٹا *بغیر مزید سوالات کے* ہٹا دیا جائے گا، مؤثر طریقے سے آپ کے ڈیوائس کو ایسے چھوڑ دیا جائے گا جیسے Ceno کبھی استعمال نہیں کیا گیا ہو۔

source: If you do not tap on the action, it will go away in a few seconds.
ar: إذا لم تضغط على الإجراء، فسيختفي في غضون ثوانٍ قليلة.
el: Αν δεν πατήσετε την επιλογή, θα εξαφανιστεί μετά από λίγο.
es: Si no pulsas sobre la acción, desaparecerá en unos pocos segundos.
fa: اگر روی این گزینه تقه نزنید در عرض چند ثانیه از بین خواهد رفت.
fr: Si vous ne touchez pas l’action, elle disparaîtra en quelques secondes.
id: Jika Anda tidak mengetuk tindakan tersebut, itu akan hilang sendiri dalam beberapa detik.
my: သင်သည် လုပ်ဆောင်ချက်ကို မနှိပ်ပါက ၎င်းသည် စက္ကန့်အနည်းငယ်အကြာတွင် ပျောက်သွားပါမည်။
pt: Se não tocar na ação, ela desaparecerá em alguns segundos.
ru: Если не нажать на кнопку действия, оно исчезнет через несколько секунд.
tr: Bu işleme dokunmazsanız birkaç saniye sonra kendiliğinden kaybolur.
uk: Якщо не натиснути кнопку дії, вона зникне через кілька секунд.
ur: اگر آپ کارروائی پر نہیں دباتے ہیں، تو یہ چند سیکنڈ میں ختم ہو جائے گا۔

source: **Note:** The method described above requires that Ceno be running on your device. To accomplish the same effect when Ceno is stopped, you can use Android's general *Settings* page and, under the *Apps* entry, choose Ceno and then *Clear data*.
ar: **ملاحظة:** تتطلب الطريقة الموضحة أعلاه أن يكون Ceno مشغلًا على جهازك. للوصول لنفس النتيجة عند إيقاف Ceno، يمكنك استخدام صفحة *إعدادات* العامة في أندرويد، وتحت قائمة *تطبيقات*، اختر Ceno ثم *مسح البيانات*.
el: **Σημείωση:** Η μέθοδος που περιγράφεται παραπάνω απαιτεί να εκτελείται το Ceno στη συσκευή σας. Για να επιτύχετε το ίδιο αποτέλεσμα όταν το Ceno είναι σταματημένο, μπορείτε να χρησιμοποιήσετε τη σελίδα *Ρυθμίσεις* του Android και στην ενότητα *Εφαρμογές* να επιλέξετε Ceno και στη συνέχεια *Εκκαθάριση δεδομένων*.
es: **Nota:** El método descrito arriba requiere que Ceno esté ejecutándose en tu dispositivo. Para lograr el mismo efecto cuando Ceno está detenido, puedes usar la página general de *Ajustes* de Android y, bajo la entrada *Apps*, elegir Ceno y luego *Limpiar datos*.
fr: **Note : ** Ceno doit être lancé sur votre appareil pour que la méthode décrite ci-dessus fonctionne. Pour obtenir le même résultat si Ceno est arrêté, vous pouvez utiliser la page des *Paramètres* généraux d’Android, *Applications* > *Ceno* > *Effacer les données*.
id: **Catatan:** Deskripsi metode diatas itu membutuhkan Ceno berjalan pada perangkat anda. Untuk melengkapi efek yang sama ketika Ceno dihentikan, anda dapat menggunakan halaman *Pengaturan* Android umumnya dan, dibawah masukkan *Aplikasi*, pilih Ceno dan kemudian *Hapus data*.
my: **မှတ်ချက် -** အထက်ပါနည်းလမ်းအတွက် သင့်စက်တွင် Ceno ကို လုပ်ဆောင်ထားရန် လိုအပ်သည်။ Ceno ကို ရပ်ထားချိန်တွင် တူညီသော အကျိုးသက်ရောက်မှု ရရှိရန် သင်သည် Android ၏ ယေဘုယျ *ဆက်တင်များ* စာမျက်နှာကို အသုံးပြုနိုင်ပြီး *အက်ပ်များ* အကြောင်းအရာအောက်တွင် Ceno ကို ရွေးချယ်ပြီးနောက် *ဒေတာရှင်းမည်* ကို ရွေးချယ်ပါ။
pt: **Nota:** O método descrito acima requer que o Ceno esteja sendo executado no seu aparelho. Para atingir o mesmo efeito quando o Ceno estiver interrompido, pode usar a página das *Configurações* gerais do Android e, sob a entrada *Apps*, escolher Ceno e depois *Limpar dados*.
ru: **Примечание:** Описанный выше метод требует, чтобы Ceno был запущен на вашем устройстве. Для достижения того же эффекта, когда Ceno остановлен, вы можете использовать общую страницу Android *Настройки* и в разделе *Приложения* выбрать Ceno, а затем *Очистить данные*.
tr: **Not:** Yukarıda belirtilen yöntem için Ceno aygıtınızda çalışıyor olmalıdır. Ceno kapalıyken aynı işlemi yapmak için Android genel *Ayarlar* bölümüne giderek *Uygulamalar* kısmından Ceno'yu seçip *Verileri temizle* seçeneğini kullanabilirsiniz.
ur: **نوٹ:** اوپر بیان کردہ طریقہ کا تقاضا ہے کہ Ceno آپ کے ڈیوائس پر چل رہا ہو۔ اسی اثر کو پورا کرنے کے لیے جب Ceno روک دیا جاتا ہے، آپ اینڈرائیڈ کا عمومی *ترتیبات* صفحہ استعمال کرسکتے ہیں اور *ایپس* کے اندراج کے تحت، Ceno اور پھر *ڈیٹا صاف کریں* کا انتخاب کرسکتے ہیں۔

source: As a harsher alternative, you may completely uninstall the app.
ar: كبديل أقسى، يمكنك إلغاء تثبيت التطبيق تمامًا.
el: Εναλλακτικά, μπορείτε να απεγκαταστήσετε πλήρως την εφαρμογή.
es: Como alternativa más drástica, podrías desinstalar la app completamente.
fa: به‌عنوان یک جایگزین شدیدتر، می‌توانید این نرم‌افزار را به‌طور کامل حذف کنید.
fr: Une méthode la plus radicale consiste à complètement désinstaller l’appli.
id: Sebagai alternatif yang lebih keras, Anda dapat menghapus aplikasi Ceno sepenuhnya.
my: ပိုမိုခက်ခဲသော ရွေးချယ်စရာအနေနှင့် သင်သည် အက်ပ်ကို လုံးဝ ဖျက်နိုင်သည်။
pt: Como alternativa mais radical, pode desinstalar a app completamente.
ru: В качестве более жесткой альтернативы вы можете полностью удалить приложение.
tr: Ya da daha sert bir yöntem olarak, uygulamayı kaldırabilirsiniz.
uk: Як жорсткіша альтернатива — ви можете повністю видалити програму.
ur: ایک سخت متبادل کے طور پر، آپ ایپ کو مکمل طور پر اَن انسٹال کر سکتے ہیں۔

source: **Warning:** Android may still keep other traces of having used an app besides its data, for instance in its system log.
ar: **تحذير:** قد يحتفظ أندرويد بآثار أخرى لاستخدام التطبيق إلى جانب بياناته، على سبيل المثال في سجل النظام الخاص به.
el: **Προσοχή:** Το Android ενδέχεται να διατηρεί και άλλα ίχνη χρήσης μιας εφαρμογής εκτός από τα δεδομένα της, για παράδειγμα στο αρχείο καταγραφής συστήματος.
es: **Advertencia:** Android aún podría mantener otros rastros de haber usado una app además de sus datos, por ejemplo en su registro del sistema.
fa: **هشدار:** اندروید ممکن است همچنان ردپاهای دیگری از کاربرد یک نرم‌افزار را به غیر از داده‌هایش نگه دارد؛ برای نمونه در گزارش سیستم‌.
fr: **Avertissement :** Outre ses données, Android pourrait conserver d’autres traces de l’utilisation d’une appli, par exemple dans son journal système.
id: **Peringatan:** Android mungkin masih menyimpan jejak penggunaan aplikasi selain datanya, misalnya di log sistemnya.
my: **သတိပေးချက် -** Android သည် ၎င်း၏ ဒေတာအပြင် အက်ပ်တစ်ခုကို အသုံးပြုထားကြောင်း အခြားသဲလွန်စများကို ဥပမာအားဖြင့် ၎င်း၏ စနစ်မှတ်တမ်းတွင် ဆက်လက်သိမ်းဆည်းထားနိုင်သည်။
pt: **Aviso:** O Android ainda pode manter, além dos dados, outros traços de uso de uma app; por exemplo no seu log do sistema.
ru: **Внимание:** Android может сохранять другие следы использования приложения помимо данных, например, в системном журнале.
tr: **Dikkat:** Android Ceno uygulamasının kullanılmasından kalan izleri uygulama verileri dışında sistem kayıtları gibi konumlarda tutabilir.
uk: **Увага:** Android може зберігати інші сліди використання програми крім даних, наприклад, у системному журналі.
ur: **انتباہ:** اینڈرائیڈ اب بھی اپنے ڈیٹا کے علاوہ کسی ایپ کے استعمال کرنے کے دیگر نشانات رکھ سکتا ہے، مثال کے طور پر اس کے سسٹم لاگ میں۔

source: [ceno-gh]: https://github.com/censorship-no/Ceno-browser/releases
pt: [ceno-gh]: https://gitlab.com/censorship-no/ceno-browser/releases
ur: [ceno-gh]: https://gitlab.com/censorship-no/ceno-browser/releases

source: [Gitlab][ceno-gh]: for Android devices without Google Play.
es: [Gitlab][ceno-gh]: para dispositivos Android sin Google Play.
pt: [Gitlab][ceno-gh]: para aparelhos Android sem o Google Play.
ur: [Gitlab][ceno-gh]: Google Play کے بغیر اینڈرائیڈ ڈیوائسز کے لیے۔

source: [ceno-gh]: https://gitlab.com/censorship-no/ceno-browser/-/releases
es: [ceno-gh]: https://github.com/censorship-no/ceno-browser/releases
pt: [ceno-gh]: https://github.com/censorship-no/ceno-browser/releases
ur: [ceno-gh]: https://github.com/censorship-no/ceno-browser/releases

source: Installing CENO
fa: نصب CENO
uk: Встановлення CENO

source: CENO Browser can be installed via the following means:
fa: مرورگر CENO را می‌توان از طریق این روش‌ها نصب کرد:

source: [Google Play][ceno-gplay] (*CENO Browser* from *eQualitie*): the recommended source for most Android users.
fa: [گوگل‌پلی][ceno-gplay] (*مرورگر سنو* از *eQualitie*): منبع پیشنهادشده برای اغلب کاربران اندروید.
uk: [Google Play][ceno-gplay] (*Браузер CENO* від *eQualitie*): рекомендоване джерело для більшості користувачів Android.

source: CENO requires an ARM64 or Neon-capable ARM32 device running at least Android 4.1 Jelly Bean, thus most mobile devices released from late 2012 onward should work. CENO needs *no special permissions* to run.
fa: CENO به یک دستگاه با معماری کامپیوتری ARM64 یا ARM32 با قابلیت نئون نیاز دارد که دارای سیستم‌عامل اندروید نسخه Android 4.1 Jelly Bean به بالا باشد، بنابراین برای اکثر دستگاه‌های تلفن همراه منتشر شده از اواخر سال ۲۰۱۲ به بعد باید امکان‌پذیر باشد. CENO برای اجرا به مجوزهای خاص نیاز ندارد.

source: **Warning:** Please be *extremely skeptical* about installing CENO Browser from sources other than the ones listed above. Because of the application's nature, their potential users may become a target for all kinds of fake or manipulated versions used to violate user privacy or attack other CENO and Ouinet users. If in doubt, please contact [cenoers@equalit.ie](mailto:cenoers@equalit.ie) before installing a suspicious app.
fa: **هشدار:** لطفاً درباره‌ی نصب مرورگر CENO از منابعی غیر از موارد فهرست‌شده در بالا *به‌شدت مراقب و مشکوک* باشید. به خاطر ماهیت این نرم‌افزار، کاربران بالقوه‌ی آن می‌توانند هدف انواع و اقسام نسخه‌های جعلی یا دستکاری‌شده‌ای قرار گیرند که برای نقض حریم خصوصی کاربر یا حمله به سایر کاربران CENO و Ouinet به کار می‌روند. اگر در این‌باره تردیدی دارید، لطفاً پیش از نصب یک نرم‌افزار مشکوک با نشانی [cenoers@equalit.ie](mailto:cenoers@equalit.ie) تماس بگیرید.

source: Stopping CENO completely
fa: متوقف‌کردن کامل CENO
uk: Повна зупинка CENO

source: Every time you start the app, a CENO icon will appear on your device's notification bar. This icon represents the *CENO Browser service*, which is the part of CENO that runs permanently (even when you are not browsing) and allows other clients to use your device as a bridge and retrieve content from it at any time.
fa: هربار که نرم‌افزار را آغاز می‌کنید، یک نشان CENO روی نوار اطلاع‌رسانی دستگاه‌تان ظاهر خواهد شد. این نشان *خدمات مرورگر CENO* را بازمی‌کند، که بخشی از CENO است که به‌طور دائمی و همیشگی اجرا می‌شود (حتی وقتی شما مرور نمی‌کنید) و به سایر سرویس‌گیرندگان اجازه می‌دهد تا از دستگاه‌تان به‌عنوان یک پل استفاده کنند و محتوا را هرزمان از آن بازیابی کنند.
uk: Щоразу, коли ви запускаєте CENO, на панелі повідомлень вашого пристрою з'являтиметься значок. Цей значок є службою браузера CENO, яка є частиною CENO, що працює постійно (навіть коли ви не переглядаєте веб-сторінки) і дозволяє іншим клієнтам використовувати ваш пристрій як міст та отримувати з нього контент у будь-який час.

source: Since running such service uses network and processor resources, you may want to stop it whenever you are on the move (i.e. not connected to Wi-Fi or far from a charger). Tapping on the notification attached to the icon will stop both CENO and its service at once (until you open CENO again).
fa: از آن‌جا که اجرای خدماتی ازاین‌دست از شبکه و منابع پردازشگر استفاده می‌کند، شاید بخواهید در حال حرکت و در بیرون از خانه آن را متوقف کنید (یعنی هرگاه به اینترنت بی‌سیم یا وای‌فای وصل نیستید یا شارژری در دسترس ندارید). انگشت‌فشردن بر اطلاع‌رسان پیوسته به این نشان هم CENO و هم خدمات‌اش را در آن واحد متوقف خواهد کرد (تا زمانی که سنو را از نو باز کنید).
uk: Оскільки робота такої служби використовує трафік і ресурси процесора, ви можете захотіти зупинити її, коли ви перебуваєте в поїздці (тобто не підключені до Wi-Fi або перебуваєте далеко від зарядного пристрою). Натискання на повідомлення, яке прикріплене до значка, призведе до негайної зупинки CENO та його служби (поки ви знову не відкриєте CENO).

source: ![Figure: Tap on the notification to stop the CENO service](images/tap-stop.png)
fa: ![شکل: روی گزینه اطلاع‌رسانی ضربه بزنید تا خدمات سنو را متوقف کنید](images/tap-stop.png)
uk: ![Малюнок: Натисніть на повідомлення для зупинки служби CENO](images/tap-stop.png)

source: Purging all CENO data (the "panic button")
fa: پالایش تمام داده‌های سنو («دکمه‌ هراس»)
uk: Очищення всіх даних CENO («тривожна кнопка»)

source: The *CENO Browser service* notification shown above includes a few accompanying actions which can be triggered by tapping on them. The *Home* action will just open CENO with a new public browsing tab showing its home page. The *Erase* action demands more explanation.
fa: اطلاع‌رسان *خدمات مرورگر CENO* که در بالا نشان داده شد چند گزینه را همراه با هم دربردارد که می‌توانند با فشردن انگشت روی آن‌ها فعال شوند. گزینه‌ی *خانه* فقط CENO را با یک زبانه‌ جدید مرور عمومی خواهد گشود که صفحه‌ی خانگی‌اش را نشان می‌دهد. گزینه‌ی *پاک‌کردن* نیازمند توضیح بیشتری است.
uk: Сповіщення *служби браузера CENO*, показане вище, включає кілька супутніх дій, які можна викликати, натиснувши на них. *Додому* — просто відкриє CENO з новою вкладкою публічного перегляду, що показує його головну сторінку. *Стерти* — вимагає більш детального пояснення.

source: **Note:** If the actions below the notification are not visible, drag the notification from its center towards the bottom to unfold it.
fa: **نکته:** اگر گزینه‌های زیر بخش اطلاع‌رسانی را نمی‌بینید، مستطیل اطلاع‌رسانی را از وسط بگیرید و به طرف پایین بکشید تا آن را نمایان کنید.
uk: **Примітка:** Якщо дії під повідомленням не видно, перетягніть повідомлення від центру донизу, щоб розгорнути його.
