Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/install.po
Languages: ar, el, es, fa, fr, id, my, pt, ru, tr, uk, ur

source: Shall you ever need to quickly stop CENO and clear absolutely all data related to it (not only cached content, but also settings like favorites, passwords and all browsing history), you can tap on *Erase*. To avoid losing your data accidentally, this will not remove anything yet, but just show an additional action for a brief moment, as pictured below:
fa: اگر زمانی نیاز داشتید که CENO را به‌سرعت متوقف کنید و تمام داده‌های مرتبط با آن را به کلی پاک کنید (نه فقط محتوای انبارشده، بلکه همچنین تنظیماتی مانند صفحه‌های محبوب، رمزهای عبور و تمام سوابق مرور)، می‌توانید روی گزینه‌ی *پاک‌کردن* ضربه بزنید. برای پرهیز از پاک‌شدن تصادفی داده‌هایتان، این گزینه هنوز هیچ‌چیز را حذف نخواهد کرد، بلکه فقط یک گزینه‌ی افزوده را برای لحظه‌ای کوتاه نشان می‌دهد، همان‌طور که در پایین به تصویر کشیده شده است:
uk: Якщо вам потрібно швидко зупинити CENO та очистити всі дані, пов'язані з ним (не тільки кешований вміст, але й налаштування, такі як вибране, паролі та вся історія переглядів), ви можете натиснути на *Стерти*. Щоб уникнути випадкової втрати даних, це ще нічого не видалить, а лише на короткий час покаже додатковий запит на дію, як показано на малюнку нижче:

source: ![Figure: The last action stops CENO and clears all its data](images/tap-purge.png)
fa: ![شکل: آخرین گزینه سنو را متوقف می‌کند و تمام داده‌های آن را پاک می‌کند](images/tap-purge.png)
uk: ![Малюнок: Остання дія зупиняє CENO та очищає всі його дані](images/tap-purge.png)

source: If you tap on the *Yes* action, CENO will be stopped and all its data removed *without further questions*, effectively leaving your device as if CENO had never been used.
fa: اگر روی *بله* انگشت بفشارید، سنو متوقف خواهد شد و تمام داده‌هایش *بی‌هیچ پرسش دیگری* حذف خواهد شد، طوری که انگار هیچ‌گاه از سنو استفاده نکرده بودید.
uk: Якщо ви натиснете на *Так*, CENO буде зупинено і всі його дані будуть видалені *без додаткових питань*, фактично залишаючи ваш пристрій таким, якби CENO ніколи не використовувався.

source: **Note:** The method described above requires that CENO be running on your device. To accomplish the same effect when CENO is stopped, you can use Android's general *Settings* page and, under the *Apps* entry, choose CENO and then *Clear data*.
fa: **نکته:** روش توصیف‌شده در بالا نیازمند آن است که CENO روی دستگاه‌تان در حال اجرا باشد. برای رسیدن به همین اثر وقتی CENO متوقف می‌شود، شما می‌توانید از صفحه‌ی *تنظیمات* عمومی اندروید استفاده کنید و، تحت مدخل *نرم‌افزارها*، CENO را انتخاب کنید و سپس *داده‌ها را پاک کنید*.
uk: **Примітка:** Цей метод вимагає, щоб CENO був запущений на вашому пристрої. Для досягнення того ж ефекту, коли CENO зупинено, ви можете використовувати загальну сторінку Android *Налаштування* та в розділі *Програми* вибрати CENO, а потім *Очистити дані*.

source: **Warning:** Please be *extremely skeptical* about installing Ceno Browser from sources other than the ones listed above. Because of the application's nature, their potential users may become a target for all kinds of fake or manipulated versions used to violate user privacy or attack other Ceno and Ouinet users. If in doubt, please contact [cenoers@equalit.ie](mailto:cenoers@equalit.ie) before installing a suspicious app.
id: **Perhatian:** Mohon untuk *skeptis secara ekstrim* tentang memasang Ceno Browser dari sumber lainnya dari salah satu yang disebutkan diatas. Sebab dari asalnya aplikasi, pengguna potensial mereka dapat menjadi seorang target untuk semua jenis dari versi palsu atau dimanipulasi untuk melanggar privasi pengguna atau menyerang pengguna Ceno and Ouinet. Jika ragu, mohon hubungi [cenoers@equalit.ie](mailto:cenoers@equalit.ie) sebelum memasang sebuah aplikasi mencurigakan.
ru: **Внимание:** Пожалуйста, будьте *крайне осторожны* при установке Браузера Ceno из любых источников, кроме перечисленных выше. Из-за характера приложения, потенциальные пользователи могут стать мишенью для всевозможных поддельных или манипулируемых версий, используемых для нарушения конфиденциальности пользователя или атаки на других пользователей Ceno и Ouinet. Если вы сомневаетесь, пожалуйста, свяжитесь с [cenoers@equalit.ie](mailto:cenoers@equalit.ie) перед установкой подозрительного приложения.

source: The CENO Browser can be installed via the following means:
uk: Браузер CENO можна встановити так:

source: CENO requires *no special permissions* to run.
uk: Для запуску CENO не потрібні *ніякі додаткові дозволи *.

source: **Warning:** Please be *extremely skeptical* about installing the CENO Browser from sources other than the ones listed above. Because of the application's nature, their potential users may become a target for all kinds of fake or manipulated versions used to violate user privacy or attack other CENO and Ouinet users. If in doubt, please contact [cenoers@equalit.ie](mailto:cenoers@equalit.ie) before installing a suspicious app.
uk: **Увага:** Будь ласка, будьте *дуже обережні* при встановлеенні Браузера CENO з будь-яких джерел, крім перерахованих вище. Через характер програми, потенційні користувачі можуть стати мішенню для всіляких підроблених або маніпулюваних версій, що використовуються для порушення конфіденційності користувача або атаки на інших користувачів CENO та Ouinet. Якщо ви сумніваєтеся, будь ласка, зв'яжіться з [cenoers@equalit.ie](mailto:cenoers@equalit.ie) перед встановленням підозрілої програми.
