Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/install.po
Languages: ar, el, es, fa, fr, id, my, pt, ru, tr, uk, ur

source: Installing Ceno
ar: تثبيت Ceno
el: Εγκατάσταση Ceno
es: Instalando Ceno
fr: Installer Ceno
id: Menginstal Ceno
my: Ceno ထည့်သွင်းခြင်း
pt: Instalar o Ceno
ru: Установка Ceno
tr: Ceno kurmak
ur: Ceno انسٹال کرنا

source: Ceno Browser can be installed via the following means:
ar: يمكن تثبيت متصفح Ceno عبر الوسائل التالية:
el: Ο φυλλομετρητής Ceno μπορεί να εγκατασταθεί με τους ακόλουθους τρόπους:
es: Navegador Ceno puede ser instalado a través de los siguientes medios:
fr: Le Navigateur Ceno peut être installé comme suit :
id: Ceno Browser dapat dipasang dengan mengikuti cara:
my: Ceno ဘရောက်ဇာကို အောက်ပါနည်းလမ်းများဖြင့် ထည့်သွင်းနိုင်သည် -
pt: O Navegador Ceno pode ser instalado via os seguintes meios:
ru: Браузер Ceno можно установить следующими способами:
tr: Ceno Browser şu kaynaklardan kurulabilir:
ur: Ceno براؤزر کو درج ذیل ذرائع سے انسٹال کیا جا سکتا ہے:

source: [Google Play][ceno-gplay] (*Ceno Browser* from *eQualitie*): the recommended source for most Android users.
ar: [جوجل بلاي][ceno-gplay] (*متصفح Ceno* من *eQualitie*): المصدر الموصى به لمعظم مستخدمي أندرويد Android.
el: [Google Play][ceno-gplay] (*Ceno Browser* από *eQualitie*): προτεινόμενη πηγή για τους περισσότερους χρήστες Android.
es: [Google Play][ceno-gplay] (*Navegador Ceno*, de *eQualitie*): la fuente recomendada para la mayoría de usuaria(o)s de Android.
fr: [Google Play][ceno-gplay] (*Navigateur Ceno* d’*eQualitie*) : la source recommandée pour la plupart des utilisateur(-trice)s Android.
id: [Google Play][ceno-gplay] (*Ceno Browser* dari *eQualitie*): sumber paling direkomendasikan untuk pengguna Android.
my: [Google Play][ceno-gplay] (*eQualitie* မှ *Ceno Browser*) - Android သုံးစွဲသူအများစုအတွက် အကြံပြုထားသော ရင်းမြစ်ဖြစ်သည်။
pt: [Google Play][ceno-gplay] (*Navegador Ceno* da *eQualitie*): a fonte recomendada para maioria dos utilizadores de Android.
ru: [Google Play][ceno-gplay] (*Браузер Ceno* от *eQualitie*): рекомендуемый источник для большинства пользователей Android.
tr: [Google Play][ceno-gplay] (*eQualitie* tarafından *Ceno Browser*): çoğu Android kullanıcı için önerilen kaynak.
ur: [Google Play][ceno-gplay] (*Ceno براؤزر* eQualitie* کی طرف سے): زیادہ تر اینڈرائیڈ صارفین کے لیے تجویز کردہ ذریعہ۔

source: [GitHub][ceno-gh]: for Android devices without Google Play.
el: [GitHub][ceno-gh]: για συσκευές Android χωρίς Google Play.
fa: [گیت‌هاب][ceno-gh]: برای دستگاه اندرویدی بدون گوگل‌پلی.
id: [GitHub][ceno-gh]: untuk perangkat Android tanpa Google Play.
my: [GitHub][ceno-gh] - Google Play မပါသော Android စက်များအတွက် ဖြစ်သည်။
pt: [GitHub][ceno-gh]: para aparelhos Android sem o Google Play.
ru: [GitHub][ceno-gh]: для устройств Android без Google Play.
tr: [GitHub][ceno-gh]: Google Play bulunmayan Android aygıtlar için.
uk: [GitHub][ceno-gh]: для пристроїв Android без Google Play.
ur: [GitHub][ceno-gh]: Google Play کے بغیر اینڈرائیڈ ڈیوائسز کے لیے۔

source: [Paskoocheh][ceno-pask]: for users in countries blocking access to the previous channels.
ar: [Paskoocheh][ceno-pask]: للمستخدمين في البلدان التي تمنع الوصول إلى الوسائل السابقة.
el: [Paskoocheh][ceno-pask]: για χρήστες σε χώρες που εμποδίζουν την πρόσβαση στις προηγούμενες πηγές.
es: [Paskoocheh][ceno-pask]: para usuaria(o)s en países que bloquean el acceso a los canales previos.
fa: [پس‌کوچه][ceno-pask]: برای کاربران ساکن در کشورهایی که دسترسی به کانال‌های قبلی در آن‌ها مسدود است.
fr: [Paskoocheh][ceno-pask] : pour les utilisateur(-trice)s de pays qui bloquent l’accès aux moyens précédents.
id: [Paskoocheh][ceno-pask]: untuk pengguna di negara yang aksesnya diblokir menuju kanal sebelumnya.
my: [Paskoocheh][ceno-pask] - ယခင်လိုင်းများကို ဝင်ရောက်သုံးစွဲခွင့် ပိတ်ဆို့ထားသော နိုင်ငံများရှိ သုံးစွဲသူများအတွက် ဖြစ်သည်။
pt: [Paskoocheh][ceno-pask]: para utilizadores em países que bloqueiam o acesso aos canais anteriores.
ru: [Paskoocheh][ceno-pask]: для пользователей в странах, блокирующих доступ к предыдущим каналам.
tr: [Paskoocheh][ceno-pask]: Diğer yöntemlere erişilmesine izin verilmeyen ülkelerdeki kullanıcılar için.
uk: [Paskoocheh][ceno-pask]: для користувачів у країнах, які блокують доступ до попередніх каналів.
ur: [Paskoocheh][ceno-pask]: پچھلے چینلز تک رسائی کو مسدود کرنے والے ممالک کے صارفین کے لیے۔

source: Ceno requires an ARM64 or Neon-capable ARM32 device running at least Android 4.1 Jelly Bean, thus most mobile devices released from late 2012 onward should work. Ceno needs *no special permissions* to run.
ar: يتطلب Ceno جهاز ARM64 أو ARM32 متوافق مع Neon ويعمل بنظام Jelly Bean لأندرويد 4.1 على الأقل، وبالتالي يجب أن يعمل مع معظم الأجهزة المحمولة التي تم إصدارها من أواخر عام 2012 فصاعدًا. لا يحتاج Ceno إلى *أذونات خاصة* للتشغيل.
el: Το Ceno απαιτεί συσκευή με ARM64 ή Neon ARM32 που να εκτελεί τουλάχιστον Android 4.1 Jelly Bean, επομένως οι περισσότερες κινητές συσκευές που κυκλοφόρησαν από τα τέλη του 2012 και μετά θα πρέπει να λειτουργούν. Το Ceno δε χρειάζεται *καμία ειδική άδεια* για να εκτελεστεί.
es: Ceno requiere un dispositivo basado en ARM64 o ARM32 compatible con Neo que ejecute al menos Android 4.1 Jelly Bean, por lo que la mayoría de dispositivos móviles posteriores a finales de 2012 deberían funcionar. Ceno *no requiere permisos especiales* para ejecutarse.
fr: Ceno demande un appareil ARM64 ou ARM32 compatible Neon qui fonctionne au moins sous Android 4.1 « Jelly Bean ». Donc, la plupart des appareils mobiles sortis à partir de la fin 2012 devraient fonctionner. Ceno ne nécessite *aucune permission spéciale* pour fonctionner.
id: Ceno membutuhkan sebuah perangkat ARM64 atau Neon-capable ARM32 berjalan paling sedikit Android 4.1 Jelly Bean, jadi kebanyakkan perangkat bergerak yang diluncurkan dari 2012 akhir dan seterusnya harusnya bekerja. Ceno membutuhkan *tidak ada izin khusus* untuk dijalankan.
my: Ceno သည် အနည်းဆုံး ARM64 သို့မဟုတ် Neon-capable ARM32 ပါဝင်တဲ့ Android 4.1 Jelly Bean စက်အမျိုးအစားကို လိုအပ်ပါသည်။ ထို့ကြောင့် ၂၀၁၂ နောက်ပိုင်းထွက်တဲ့ မိုဘိုင်းဖုန်းအမျိုးအစားတွေမှာ အလုပ်လုပ်နိုင်ပါသည်။ Ceno ကို အလုပ်လုပ်ဖို့အတွက် *အထူးခွင့်ပြုချက်များ မလိုအပ်ပါ*။
pt: Ceno requer um aparelho ARM64 ou um ARM32 compatível com Neon, executando no mínimo Android 4.1 Jelly Bean. Logo, deve funcionar na maioria dos aparelhos móveis lançados do fim de 2012 em diante. Ceno *não precisa de permissões especiais* para ser executado.
ru: Ceno работает на устройствах с ARM64 или ARM32 с поддержкой Neon, под управлением Android Jelly Bean версии не старше 4.1. Таким образом, большинство мобильных устройств выпущенных после конца 2012 года будут совместимы. Для работы Ceno *не требуются специальные разрешения*.
tr: Ceno için en az Android 4.1 Jelly Bean ile çalışan, ARM64 ya da Neon destekli ARM32 bir aygıt gerekir. 2012 yılının sonundan bugüne kadar çıkmış çoğu aygıt desteklenir. Ceno çalışmak için *özel bir izne* gerek duymaz.
ur: Ceno کو کم از کم اینڈرائیڈ 4.1 Jelly Bean چلانے والے ARM64 یا Neon کے قابل ARM32 ڈیوائس کی ضرورت ہے، اس طرح 2012 کے اواخر سے جاری ہونے والے زیادہ تر موبائل ڈیوائسز کو کام کرنا چاہیے۔ Ceno کو چلانے کے لیے *کسی خاص اجازت کی ضرورت نہیں* ہے۔

source: **Warning:** Please be *extremely skeptical* about installing Ceno Browser from sources other than the ones listed above. Because of the application's nature, their potential users may become a target for all kinds of fake or manipulated versions used to violate user privacy or attack other Ceno and Ouinet users. If in doubt, please contact [cenoers@equalitie.org](mailto:cenoers@equalitie.org) before installing a suspicious app.
es: **Advertencia:** Por favor sé *extremadamente escéptica(o)* al instalar el Ceno Browser desde otras fuentes que no sean las listadas arriba. Debido a la naturaleza de la aplicación, sus usuaria(o)s potenciales podrían tornarse en el blanco de toda clase de versiones falsas o manipuladas usadas para violar la privacidad del usuaria(o) o atacar a otra(o)s usuaria(o)s de Ceno y Ouinet. Ante la duda, por favor contacta a [cenoers@equalitie.org](mailto:cenoers@equalitie.org) antes de instalar una app sospechosa.
pt: **Aviso:** Por favor, seja uma pessoa *extremamente cética* quanto à instalar o Navegador Ceno de fontes diferentes das listadas acima. Por causa da natureza da aplicação, os seus utilizadores em potencial podem se tornar um alvo para todos os tipos de versões falsas ou manipuladas, usadas para violar a privacidade do utilizador ou atacar outros utilizadores do Ceno e da Ouinet. Quando estiver em dúvida, por favor contate [cenoers@equalitie.org](mailto:cenoers@equalitie.org) antes de instalar a app suspeita.
tr: ** Uyarı:** Lütfen yukarıda listelenenler dışında bir kaynaktan Ceno Browser kurarken *son derece şüpheci* olun. Uygulamanın doğası gereği kullanıcıları, diğer Ceno ve Ouinet kullanıcılarına saldırmak ve kullanıcıların özel bilgilerini ele geçirmek için kullanılan her türlü sahte veya değiştirilmiş sürümün hedefi olabilir. Şüpheniz varsa, lütfen uygulamayı kurmadan önce [cenoers@equalitie.org](mailto:cenoers@equalitie.org) adresinden bize iletin.
ur: **انتباہ:** براہ کرم اوپر درج کردہ ذرائع کے علاوہ دیگر ذرائع سے Ceno براؤزر انسٹال کرنے کے بارے میں *انتہائی محتاط* رہیں۔ ایپلیکیشن کی نوعیت کی وجہ سے، ان کے ممکنہ صارفین ہر قسم کے جعلی یا ہیرا پھیری والے ورژنز کا نشانہ بن سکتے ہیں جو صارف کی رازداری کی خلاف ورزی کرنے یا دوسرے Ceno اور Ouinet صارفین پر حملہ کرنے کے لیے استعمال ہوتے ہیں۔ اگر شک ہو تو، مشتبہ ایپ کو انسٹال کرنے سے پہلے براہ کرم [cenoers@equalitie.org](mailto:cenoers@equalitie.org) سے رابطہ کریں۔

source: Stopping Ceno completely
ar: إيقاف Ceno تماما
el: Πλήρης τερματισμός του Ceno
es: Deteniendo Ceno completamente
fr: Arrêter Ceno complètement
id: Memberhentikan Ceno keseluruhan
my: Ceno ကို လုံးဝ ရပ်တန့်ခြင်း
pt: Interromper o Ceno completamente
ru: Полная остановка Ceno
tr: Ceno uygulamasını tamamen kapatmak
ur: Ceno کو مکمل طور پر روکنا

source: Every time you start the app, a Ceno icon will appear on your device's notification bar. This icon represents the *Ceno Browser service*, which is the part of Ceno that runs permanently (even when you are not browsing) and allows other clients to use your device as a bridge and retrieve content from it at any time.
ar: في كل مرة تقوم فيها ببدأ تشغيل التطبيق، سيظهر رمز Ceno على شريط التنبيهات بجهازك. يمثل هذا الرمز *خدمة متصفح Ceno*، وهي جزء من Ceno يعمل بشكل دائم (حتى عندما لا تتصفح) ويسمح للعملاء الآخرين باستخدام جهازك كجسر واسترداد المحتوى منه في أي وقت.
el: Σε κάθε έναρξη της εφαρμογής, ένα εικονίδιο Ceno θα εμφανίζεται στη γραμμή ειδοποιήσεων της συσκευής σας. Αυτό το εικονίδιο αντιπροσωπεύει την *υπηρεσία Ceno Browser*, η οποία είναι το τμήμα που εκτελείται μόνιμα (ακόμη και όταν δεν περιηγείστε) και επιτρέπει σε άλλους πελάτες να χρησιμοποιούν τη συσκευή σας ως γέφυρα και να ανακτούν περιεχόμενο από αυτήν.
es: Cada vez que inicies la app, un icono de Ceno aparecerá en la barra de notificaciones de tu dispositivo. Este icono representa al *servicio del Navegador Ceno*, que es la parte de Ceno que se ejecuta permanentemente (aún cuando no estés navegando) y permite a otra(o)s clientes usar tu dispositivo como puente y descargar contenido desde él en cualquier momento.
fr: Chaque fois que vous démarrez l’appli, l’icône de Ceno apparaît dans la barre de notification de votre appareil. Cette icône représente le *service du Navigateur Ceno*, qui est la partie de Ceno qui fonctionne en permanence (même si vous ne naviguez pas) et qui permet à d’autres clients d’utiliser votre appareil comme un pont pour en récupérer du contenu n’importe quand.
id: Setiap kali anda memulai aplikasi, ikon Ceno akan tampil pada bar notifikasi perangkat anda. Ikon ini merepresentasikan *layanan Ceno Browser*, yang mana merupakan bagian dari Ceno yang berjalan permanen (sekalipun ketika anda sedang tidak menjelajah) dan mengizinkan klien lain untuk menggunakan perangkat anda sebagai bridge dan mengambil konten dari itu kapanpun.
my: သင် အက်ပ်ကို စတင်သည့် အချိန်တိုင်းတွင် Ceno အိုင်ကွန်သည် သင့်စက်၏ အသိပေးချက်ဘားတွင် ပေါ်လာပါမည်။ ဤအိုင်ကွန်သည် *Ceno ဝက်ဘ် ဘရောက်ဇာ ဝန်ဆောင်မှု* ကို ကိုယ်စားပြုပြီး ၎င်းသည် (သင်ရှာဖွေမနေသည့် အချိန်တွင်ပင်) အမြဲတမ်း လုပ်ဆောင်သည့် Ceno ၏ တစ်စိတ်တစ်ပိုင်းဖြစ်ပြီး အခြားလက်ခံစက်များအား သင့်စက်ကို ပေါင်းကူးအဖြစ် အသုံးပြု၍ ၎င်းထံမှ အချက်အလက်ကို အချိန်မရွေး ပြန်ထုတ်ရန် ခွင့်ပြုသည်။
pt: Todas as vezes em que iniciar a app, um ícone do Ceno aparecerá na barra de notificações do seu aparelho. Esse ícone representa o *serviço do Navegador Ceno*, a parte do Ceno que é executada permanentemente (mesmo quando não navega) e permite que outros clientes usem o seu aparelho como uma ponte e recuperem conteúdo dela a qualquer momento.
ru: Каждый раз, когда вы запускаете Ceno, на панели уведомлений вашего устройства будет появляться значок. Этот значок представляет собой *службу Браузера Ceno*, которая является частью Ceno, работающей постоянно (даже когда вы не просматриваете веб-страницы) и позволяющей другим клиентам использовать ваше устройство в качестве моста и получать с него содержимое в любое время.
tr: Uygulama her açıldığında aygıtınızın bildirim çubuğunda bir Ceno simgesi belirir. Bu simge görünürken *Ceno Browser hizmeti* arka planda (uygulamayı kullanmadığınızda bile) çalışıyor ve içeriklere erişmek isteyen başkalarının aygıtınızı köprü olarak kullanmasını sağlıyor demektir.
ur: جب بھی آپ ایپ شروع کریں گے، آپ کے ڈیوائس کے نوٹیفکیشن بار پر ایک Ceno آئیکن ظاہر ہوگا۔ یہ آئیکن *Ceno براؤزر سروس* کی نمائندگی کرتا ہے، جو Ceno کا وہ حصہ ہے جو مستقل طور پر چلتا ہے (یہاں تک کہ جب آپ براؤز نہیں کر رہے ہوتے ہیں) اور دوسرے کلائنٹس کو آپ کے ڈیوائس کو ایک پل کے طور پر استعمال کرنے اور کسی بھی وقت اس سے مواد بازیافت کرنے کی اجازت دیتا ہے۔

source: Since running such service uses network and processor resources, you may want to stop it whenever you are on the move (i.e. not connected to Wi-Fi or far from a charger). Tapping on the notification attached to the icon will stop both Ceno and its service at once (until you open Ceno again).
ar: نظرًا لأن تشغيل هذه الخدمة تستخدم موارد الشبكة والمعالج، فقد ترغب في إيقافها كلما كنت في حالة تنقل (أي غير متصل بشبكة Wi-Fi أو بعيدًا عن الشاحن). سيؤدي النقر فوق الإشعار المرفق بالرمز إلى إيقاف كل من Ceno وخدمته في الحين (حتى تفتح Ceno مرة أخرى).
el: Δεδομένου ότι η εκτέλεση μιας τέτοιας υπηρεσίας χρησιμοποιεί πόρους δικτύου και επεξεργαστή, μπορεί να θέλετε να τη διακόπτετε όποτε βρίσκεστε εν κινήσει (δηλ. δεν είστε συνδεδεμένοι σε Wi-Fi ή μακριά από φορτιστή). Πατώντας στο εικονίδιο ειδοποίησης, τερματίζετε ταυτόχρονα το Ceno και την υπηρεσία (μέχρι να ανοίξετε ξανά το Ceno).
es: Ya que ejecutar tal servicio usa recursos de red y procesador, podrías querer detenerlo cada vez que estés desplazándote (esto es, no conectado al Wi-Fi o lejos de un cargador). Pulsando sobre la notificación adjunta al icono detendrá tanto Ceno como a su servicio al mismo tiempo (hasta que abras Ceno de nuevo).
fr: Comme l’exécution d’un tel service utilise les ressources du réseau et du processeur, vous pourriez l’arrêter lors de vos déplacements (c’est-à-dire si vous n’êtes pas connecté.e au Wi-Fi ou loin d’un chargeur). En touchant la notification affichée pour l’icône, vous arrêterez immédiatement Ceno et son service (jusqu’à ce que vous relanciez Ceno).
id: Sejak berjalannya seperti layanan menggunakan sumber daya jaringan dan prosesor, anda mungkin ingin menghentikannya kapanpun anda bergerak (seperti tidak terkoneksi pada WiFi atau jauh dari sumber charger). Ketuk pada notifikasi yang terlampir pada icon akan menghentikan keduanya baik Ceno dan layanannya dalam satu waktu (sampai anda membuka Ceno lagi).
my: ထိုဝန်ဆောင်မှုကို လုပ်ဆောင်ခြင်းသည် ကွန်ရက်နှင့် ပရိုဆက်ဆာ ရင်းမြစ်များကို အသုံးပြုသည့်အတွက် သင်သည် လှုပ်ရှားသွားလာနေချိန်တွင် (ဆိုလိုသည်မှာ Wi-Fi နှင့် ချိတ်ဆက်မထားချိန် သို့မဟုတ် အားသွင်းကိရိယာနှင့် ဝေးနေချိန်တွင်) ၎င်းကို ရပ်တန့်လိုစိတ် ရှိနိုင်သည်။ အိုင်ကွန်တွင် တွဲချိတ်ထားသော အသိပေးချက်ကို နှိပ်ခြင်းဖြင့် Ceno နှင့် ၎င်း၏ ဝန်ဆောင်မှုကို (သင် Ceno ကို ထပ်မံဖွင့်သည့် အချိန်အထိ) ချက်ချင်း ရပ်တန့်ပါမည်။
pt: Já que a execução desse serviço consome muitos recursos de rede e processamento, pode interrompê-la a qualquer momento que estiver em trânsito (isto é, não conectado ao WiFi ou longe de um carregador). Tocar na notificação acoplada ao ícone irá interromper tanto o Ceno quanto o seu serviço de uma só vez (até que abra o Ceno novamente).
ru: Поскольку работа такой службы использует трафик и ресурсы процессора, вы можете захотеть остановить ее, когда находитесь в поездке (т.е. не подключены к Wi-Fi или находитесь далеко от зарядного устройства). Нажатие на уведомление, прикрепленное к значку, приведет к немедленной остановке Ceno и его службы (пока вы снова не откроете Ceno).
tr: Böyle bir hizmetin sürekli çalışması ağ ve işlemci kaynaklarını kullanacağından, dışardayken (kablosuz ağa bağlı olmadığınızda ya da şarj aletiniz yanınızda olmadığında) bunu kapatmak isteyebilirsiniz. Simgedeki bildirime dokunduğunuzda, Ceno hizmeti, Ceno yeniden açılana kadar kapatılır.
ur: چونکہ اس طرح کی سروس چلانے میں نیٹ ورک اور پروسیسر کے وسائل استعمال ہوتے ہیں، اس لیے جب بھی آپ چلتے پھرتے ہوں (یعنی وائی فائی سے منسلک نہ ہوں یا چارجر سے دور ہوں) تو آپ اسے روک سکتے ہیں۔ آئیکن کے ساتھ منسلک نوٹیفکیشن پر دبانے سے Ceno اور اس کی سروس دونوں ایک ساتھ بند ہو جائیں گی (جب تک کہ آپ Ceno کو دوبارہ نہیں کھولیں گے)۔

source: ![Figure: Tap on the notification to stop the Ceno service](images/tap-stop.png)
ar: ![الشكل: اضغط على الإشعار لإيقاف خدمة Ceno](images/tap-stop.png)
el: ![Εικόνα: Πατήστε στην ειδοποίηση για τερματισμό της υπηρεσίας Ceno](images/tap-stop.png)
es: ![Figura: Pulsar sobre la notificación para detener el servicio Ceno](images/tap-stop.png)
fr: ![Figure: Touchez la notification pour arrêter le service Ceno](images/tap-stop.png)
id: ![Figure: Ketuk pada notifikasi untuk menghentikan layanan Ceno](images/tap-stop.png)
my: ![ပုံ - Ceno ဝန်ဆောင်မှုကို ရပ်တန့်ရန် အသိပေးချက်ကို နှိပ်ပါ](images/tap-stop.png)
pt: ![Figura: Toque na notificação para interromper o serviço do Ceno](images/tap-stop.png)
ru: ![Рисунок: Нажатие на уведомление для остановки службы Ceno](images/tap-stop.png)
tr: ![Görsel: Ceno hizmetini durdurmak için bildirime dokunun](images/tap-stop.png)
ur: ![تصویر: Ceno سروس کو روکنے کے لیے نوٹیفکیشن پر دبائيں](images/tap-stop.png)

source: Purging all Ceno data (the "panic button")
ar: تطهير جميع بيانات Ceno ("زر الطوارئ")
el: Εκκαθάριση όλων των δεδομένων Ceno (κουμπί πανικού)
es: Purgando todos los datos en Ceno (el "botón de pánico")
fr: Purger toutes les données de Ceno (le « bouton d’urgence »)
id: Membersihkan semua data Ceno ("tombol panik")
my: Ceno ဒေတာအားလုံးကို ထုတ်ပယ်ခြင်း ("စိုးရိမ်မှု ခလုတ်")
pt: Limpar todos os dados do Ceno (o "botão de pânico")
ru: Очистка всех данных Ceno («тревожная кнопка»)
tr: Tüm Ceno verilerini silmek ("panik" düğmesi)
ur: تمام Ceno ڈیٹا کو صاف کرنا ("گھبراہٹ کا بٹن")

source: The *Ceno Browser service* notification shown above includes a few accompanying actions which can be triggered by tapping on them. The *Home* action will just open Ceno with a new public browsing tab showing its home page. The *Erase* action demands more explanation.
ar: يتضمن إشعار *خدمة متصفح Ceno* الموضح أعلاه بعض الإجراءات المصاحبة التي يمكن تشغيلها من خلال النقر عليها. سيفتح الإجراء *الرئيسية* فقط Ceno مع علامة تبويب تصفح عام جديدة و يعرض الصفحة الرئيسية. أما إجراء *مسح* فيتطلب مزيدًا من التوضيح.
el: Η παραπάνω ειδοποίηση *Υπηρεσία Ceno Browser* περιλαμβάνει μερικές επιπλέον ενέργειες που μπορούν να ενεργοποιηθούν πατώντας πάνω τους. Η ενέργεια *Αρχική* ανοίγει το Ceno με μια νέα καρτέλα δημόσιας περιήγησης, που δείχνει την αρχική σελίδα του. Η ενέργεια *Διαγραφή* απαιτεί περισσότερες εξηγήσεις.
es: La notificación *servicio Navegador Ceno* mostrada arriba incluye unas pocas acciones de acompañamiento que pueden ser desencadenadas pulsando sobre ellas. La acción *Inicio* solo abrirá a Ceno con una nueva pestaña de navegación pública mostrando su página de inicio. La acción *Borrar* demanda más explicación.
fr: La notification du *service du Navigateur Ceno* ci-dessus comprend quelques actions connexes qui peuvent être déclenchées en les touchant. L’action *Accueil* ouvrira simplement Ceno sur sa page d’accueil, dans un nouvel onglet de navigation publique. L’action *Effacer* demande plus d’explications.
id: Notifikasi *layanan Ceno Browser* ditampilkan diatas termasuk beberapa yang mengiringi aksi yang mana dapat terpicu oleh mengetuknya. Aksi *Beranda*akan hanya membuka Ceno dengan sebuah tab jelajah baru menunjukkan halaman beranda. Aksi *Hapus* tergantung penjelasan lainnya.
my: အထက်ပါ *Ceno ဘရောက်ဇာ ဝန်ဆောင်မှု* အသိပေးချက်တွင် ၎င်းတို့ကို နှိပ်ခြင်းဖြင့် လှုံ့ဆော်နိုင်သော တွဲဖက်လုပ်ဆောင်ချက် အနည်းငယ် ပါဝင်သည်။ *ပင်မ* လုပ်ဆောင်ချက်သည် ၎င်း၏ ပင်မ စာမျက်နှာကို ပြသသည့် အများသုံး ရှာဖွေမှု တပ်ဗ်အသစ်ဖြင့် Ceno ကို ဖွင့်ပါမည်။ *ဖျက်ရန်* လုပ်ဆောင်ချက်ကို ပိုမိုရှင်းပြရန် လိုအပ်သည်။
pt: A notificação do *serviço do Navegador Ceno* mostrada acima inclui algumas ações associadas que podem ser desencadeadas ao serem tocadas. A ação *Início* irá apenas abrir o Ceno com uma nova guia de navegação pública que mostra a sua página inicial. Já a ação *Apagar* necessidade mais explicação.
ru: Уведомление *службы Браузера Ceno*, показанное выше, включает в себя несколько сопутствующих действий, которые можно вызвать, нажав на них. Действие *Домой* просто откроет Ceno с новой вкладкой публичного просмотра, показывающей его главную страницу. Действие *Стереть* требует более подробного объяснения.
tr: Yukarıda gösterilen *Ceno Browser hizmeti* bildirimine dokunarak bazı işlemler yapılabilir. *Giriş sayfası* işlemi, herkese açık yeni bir Ceno sekmesi açar ve giriş sayfasını gösterir. *Sil* işlemini daha ayrıntılı açıklamak gerekir.
ur: اوپر دکھائے گئے *Ceno براؤزر سروس* نوٹیفکیشن میں کچھ ساتھ والی کارروائیاں شامل ہیں جن كو دبانے پر متحرک کیا جاسکتا ہے۔ *ہوم* ایکشن صرف Ceno کو ایک نئے عوامی براؤزنگ ٹیب کے ساتھ کھولے گا جس کا ہوم صفحہ دکھایا جائے گا۔ *مٹا دیں* ایکشن مزید وضاحت کا مطالبہ کرتا ہے۔
