Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/settings.po
Languages: ar, de, es, fa, fr, id, my, pt_br, ru, tr, uk

source: Ceno settings
ar: إعدادات Ceno
de: Ceno-Einstellungen
es: Configuración de Ceno
fr: Paramètres de Ceno
id: Pengaturan Ceno

source: Ceno Browser allows you to change some Ouinet-specific settings and get information about your client in a simple manner. This should not be needed for normal operation, but it would be helpful for testing different strategies against network interference, as well as reporting issues with the app.
ar: يتيح لك متصفح Ceno تغيير بعض الإعدادات الخاصة بـ Ouinet والحصول على معلومات حول عميلك بطريقة بسيطة. هذا ليس ضروريًا للتشغيل العادي، لكنه سيكون مفيدًا لاختبار استراتيجيات مختلفة ضد تداخل الشبكة، بالإضافة إلى الإبلاغ عن مشكلات في التطبيق.
de: Mit Ceno Browser können Sie einige Ouinet-spezifische Einstellungen ändern und auf einfache Weise Informationen über Ihren Client abrufen. Dies sollte für den normalen Betrieb nicht erforderlich sein, wäre aber hilfreich, um verschiedene Strategien gegen Netzwerkstörungen zu testen und um Probleme mit der App zu melden.
es: El Navegador Ceno te permite cambiar algunas configuraciones específicas de Ouinet y obtener información acerca de tu cliente en una manera simple. Esto no debiera ser necesario para la operación normal, pero puede ser útil para ayudar a probar diferentes estrategias en contra de la interferencia de red, e informar de problemas con la app.
fr: Le Navigateur Ceno vous permet de modifier certains paramètres propres à Ouinet et d’obtenir simplement des renseignements sur votre client. Cela ne devrait pas être nécessaire pour un fonctionnement normal, mais pourrait s’avérer utile pour tester différentes stratégies contre les interférences du réseau et pour signaler des problèmes avec l’appli.
id: Peramban Ceno memungkinkan Anda untuk mengubah beberapa pengaturan khusus Ouinet dan mendapatkan informasi tentang klien Anda dengan cara yang sederhana. Ini seharusnya tidak diperlukan untuk operasi normal, tetapi akan berguna untuk menguji berbagai strategi terhadap gangguan jaringan, serta melaporkan masalah dengan aplikasi.

source: **Technical note:** These options are provided by the *Ceno Extension*, a Firefox extension which comes installed out of the box with Ceno and takes care of proper integration with Ouinet, like enabling content injection and cache retrieval under public browsing, hinting the user about the source of the content being visualized, and notifying about new versions of Ouinet.
ar: **ملاحظة تقنية:** يتم توفير هذه الخيارات من خلال *امتداد Ceno*، وهو امتداد فايرفكس والذي يأتي مثبتًا مع Ceno ويؤمن دمجًا مناسبًا مع Ouinet، مثل تمكين حقن المحتوى واسترجاع ذاكرة التخزين المؤقت عند التصفح العام و إعطاء تلميحات للمستخدم حول مصدر المحتوى الذي تتم رؤيته، وإشعاره بالإصدارات الجديدة من Ouinet.
de: **Technischer Hinweis:** Diese Optionen werden von der *Ceno-Erweiterung* bereitgestellt, einer Firefox-Erweiterung, die zusammen mit Ceno installiert wird und sich um die ordnungsgemäße Integration mit Ouinet kümmert, wie z. B. das Aktivieren der Inhaltsinjektion und des Cache-Abrufs beim öffentlichen Browsen, den Hinweis auf die Quelle des angezeigten Inhalts und die Benachrichtigung über neue Versionen von Ouinet.
es: **Nota técnica:** Estas opciones son provistas por la *Extensión Ceno*, una extensión de Firefox que viene instalada con Ceno y se ocupa de la integración apropiada con Ouinet, como la habilitación de la inyección de contenido y la descarga de caché bajo navegación pública, dando a el/la usuaria(o) pistas acerca de la fuente del contenido que está siendo visualizado, y notificando acerca de nuevas versiones de Ouinet.
fr: **Note technique : ** Ces options sont fournies par l’*extension Ceno*, une extension Firefox installée par défaut dans Ceno et qui assure une bonne intégration avec Ouinet : activer l’injection du contenu et de la récupération du cache en navigation publique, indiquer à l’utilisateur ou à l’utilisatrice la source du contenu visualisé et signaler les nouvelles versions de Ouinet.
id: **Catatan teknis:** Opsi ini disediakan oleh *Ekstensi Ceno*, ekstensi Firefox yang langsung dipasang bersama Ceno dan menangani integrasi yang tepat dengan Ouinet, seperti mengaktifkan injeksi konten dan pengambilan tembolok saat penelusuran publik, memberi petunjuk kepada pengguna tentang sumber konten yang sedang divisualisasikan, dan memberi tahu tentang versi baru Ouinet.

source: These features are available on a page that can be accessed by choosing *Ceno* in the app's main menu. Please note that the menu entry may take a few seconds to pop up on app start. The page should look like this:
ar: تتوفر هذه الميزات في صفحة يمكن الوصول إليها عن طريق اختيار *Ceno* في القائمة الرئيسية للتطبيق. يرجى الملاحظة أن قائمة الدخول قد تستغرق بضع ثوانٍ لتظهر عند بدء تشغيل التطبيق. يجب أن تبدو الصفحة كما يلي:
de: Diese Funktionen sind auf einer Seite verfügbar, auf die Sie durch Auswahl von *Ceno* im Hauptmenü der App zugreifen können. Bitte beachten Sie, dass es einige Sekunden dauern kann, bis der Menüeintrag beim Start der App angezeigt wird. Die Seite sollte wie folgt aussehen:
es: Estas características están disponibles en una página que puede ser accedida eligiendo *Ceno* en el menú principal de la app. Por favor ten en cuenta que la entrada del menú podría tardar unos pocos segundos en aparecer al iniciarse la app. La página debería verse así:
fr: Ces fonctions sont proposées sur une page accessible sous *Ceno* dans le menu principal de l’appli. Notez que l’entrée du menu peut prendre quelques secondes avant de s’afficher au démarrage de l’appli. La page devrait ressembler à ceci :
id: Fitur-fitur ini tersedia di halaman yang dapat diakses dengan memilih *Ceno* di menu utama aplikasi. Harap perhatikan bahwa entri menu mungkin memerlukan beberapa detik untuk muncul saat aplikasi dimulai. Halaman akan terlihat seperti ini:

source: ![Figure: The Ceno Settings page](images/settings.png)
ar: ![الشكل: صفحة إعدادات Ceno](images/settings.png)
de: ![Abbildung: Die Ceno-Einstellungsseite](images/settings.png)
es: ![Figura: La página de Configuración de Ceno](images/settings.png)
fr: ![Figure: La page des paramètres de Ceno](images/settings.png)
id: ![Gambar: Halaman Pengaturan Ceno](images/settings.png)

source: Choosing access mechanisms
ar: اختيار آليات الوصول
de: Auswahl von Zugriffsmechanismen
es: Eligiendo mecanismos de acceso
fa: انتخاب سازوکارهای دسترسی
fr: Choisir les mécanismes d’accès
id: Memilih mekanisme akses
my: ဝင်ရောက်သုံးစွဲမှု စက်ကိရိယာကို ရွေးချယ်ခြင်း
pt_br: Escolhendo os mecanismos de acesso
ru: Выбор вариантов доступа
tr: Erişim yöntemlerinin seçimi
uk: Вибір варіантів доступу

source: The four checkboxes on the top of the page selectively enable or disable the different mechanisms or *sources* that Ceno as a Ouinet client uses to retrieve content while using either [public or private browsing](public-private.md) tabs. All boxes are enabled by default.
ar: تعمل مربعات الاختيار الأربعة الموجودة أعلى الصفحة بشكل انتقائي على تمكين أو تعطيل الآليات المختلفة أو *المصادر* التي يستخدمها Ceno كعميل Ouinet لاسترداد المحتوى أثناء استخدام علامات تبويب [التصفح العام أو الخاص](public-private.md). يتم تمكين جميع مربعات الاختيار بشكل افتراضي.
es: Las cuatro casillas de selección en la parte superior de la página habilitan o deshabilitan selectivamente los diferentes mecanismos o *fuentes* que Ceno como cliente Ouinet usa para descargar contenido mientras que utiliza pestañas tanto de [navegación pública como privada](public-private.md). Todas las casillas están habilitadas por defecto.
fr: En haut de la page, les quatre cases à cocher permettent d’activer ou de désactiver les différents mécanismes ou *sources* que Ceno utilise, en tant que client Ouinet, pour récupérer du contenu dans les onglets de [navigation publique ou privée](public-private.md). Toutes les cases sont activées par défaut.
id: Empat kotak centang di bagian atas halaman secara selektif mengaktifkan atau menonaktifkan berbagai mekanisme atau *sumber* yang digunakan Ceno sebagai klien Ouinet untuk mengambil konten saat menggunakan tab [penjelajahan publik atau privat](public-private.md). Semua kotak dicentang secara bawaan.

source: *Direct from website* (or **origin access**) allows Ceno to try to reach the origin server directly before attempting other mechanisms enabled below.
ar: *مباشرة من موقع الويب* (أو **الوصول الأصلي**) يسمح لـ Ceno بمحاولة الوصول إلى الخادم الأصلي مباشرة قبل محاولة الآليات الأخرى المُمَكَّنة أدناه.
de: Mit *Direkt von der Website* (oder **Ursprungszugriff**) kann Ceno versuchen, den Ursprungsserver direkt zu erreichen, bevor es andere unten aktivierte Mechanismen ausprobiert.
es: *Directo desde el sitio web* (o **acceso de origen**) le permite a Ceno intentar alcanzar al servidor de origen directamente antes de intentar otros mecanismos habilitados abajo.
fr: *Directement du site Web* (ou **accès à l’origine**) permet à Ceno de tenter d’atteindre directement le serveur d’origine avant d’essayer les autres mécanismes activés ci-dessous.
id: *Langsung dari situs web* (atau **akses sumber**) memungkinkan Ceno mencoba menjangkau server asal secara langsung sebelum mencoba mekanisme lain yang diaktifkan di bawah.

source: Although this mechanism works in both private and public browsing modes, content thus retrieved cannot be shared with others.
ar: على الرغم من أن هذه الآلية تعمل في وضعي التصفح الخاص والعام، لا يمكن مشاركة المحتوى المسترجع بهذه الآلية مع الآخرين.
es: Auque este mecanismo funciona tanto en los modos de navegación privada como pública, el contenido así descargado no puede ser compartido con otra(o)s.
fa: اگرچه این سازوکار در هر دو حالت مرور خصوصی و عمومی کار می‌کند، محتوای بدین‌سان بازیافته نمی‌تواند با دیگران به اشتراک گذاشته شود.
fr: Bien que ce mécanisme fonctionne pour les modes de navigation privée et publique, le contenu récupéré ainsi ne peut pas être partagé avec d’autres.
id: Meskipun mekanisme ini dapat bekerja dalam mode penjelajahan privat dan publik, konten yang diambil tidak dapat dibagikan dengan orang lain.
my: ဤစက်ကိရိယာသည် သီးသန့်နှင့် အများသုံး ရှာဖွေခြင်းမုဒ် နှစ်ခုလုံးအတွက် အလုပ်လုပ်သည့်တိုင်အောင် ထိုသို့ ပြန်ထုတ်ထားသော အကြောင်းအရာကို အခြားသူများနှင့် မမျှဝေနိုင်ပါ။
pt_br: Embora esse mecanismo funcione em ambos os modos de navegação, pública e privativa, o conteúdo assim recuperado não pode ser compartilhado com outras pessoas.
ru: Поскольку эта схема работает в режиме как приватного, так и публичного просмотра, полученный таким образом контент не может быть передан другим пользователям.
tr: Bu yöntem herkese açık ve gizli gezinme kiplerinde çalışsa bile, alınan içerik diğer kullanıcılarla paylaşılamaz.
uk: Оскільки ця схема працює в режимі як приватного, так і публічного перегляду, отриманий вміст не може бути переданий іншим користувачам.

source: If getting most Web content is not particularly slow or expensive, this mechanism may be more than enough for most use cases. However, such direct connections may be tracked by your ISP or government. To some extent, disabling this option may avoid such connections and trivial tracking (but not completely, see [risks](../concepts/risks.md)).
ar: إذا لم يكن الحصول على معظم محتوى الويب بطيئًا أو مكلفًا بشكل خاص، فقد تكفي هذه الآلية لمعظم حالات الاستخدام. ومع ذلك، قد يتم تعقب هذه الاتصالات المباشرة بواسطة مزود خدمة الإنترنت أو الحكومة. قد يؤدي تعطيل هذا الخيار إلى تجنب مثل هذه الاتصالات والتعقب العادي إلى حد ما (ولكن ليس بالكامل، راجع [المخاطر](../concepts/risks.md)).
de: Wenn der Zugriff auf die meisten Webinhalte nicht besonders langsam oder teuer ist, kann dieser Mechanismus für die meisten Anwendungsfälle mehr als ausreichend sein. Solche direkten Verbindungen können jedoch von Ihrem Internetanbieter oder der Regierung nachverfolgt werden. Bis zu einem gewissen Grad kann die Deaktivierung dieser Option solche Verbindungen und triviale Verfolgung vermeiden (aber nicht vollständig, siehe [Risiken](../concepts/risks.md)).
es: Si obtener la mayoría del contenido Web no es particularmente lento o caro, este mecanismo podría ser más que suficiente para la mayoría de los casos de uso. Sin embargo, tales conexiones directas podrían ser rastreadas por tu ISP o gobierno. En cierta medida, deshabilitar esta opción podría evitar tales conexiones y su rastreo trivial (pero no completamente, ver [riesgos](../concepts/risks.md)).
fa: در موردی که دریافت بیشتر محتوای وب به‌طور خاص کند یا گران نیست، این سازوکار می‌تواند برای بیشتر موارد بیش از کافی باشد. با این حال، چنین اتصالات مستقیمی شاید به‌وسیله‌ی ارائه‌دهنده‌ی خدمات اینترنت (ISP) یا حکومت شما ردیابی شوند. غیرفعال‌کردن این گزینه می‌تواند از اتصالات این‌چنینی و ردیابی سطحی تا حدی پرهیز کند (اما نه به طور کامل. به [خطرات](/concepts/risks.md/..) بنگرید).
fr: Si récupérer la plupart des contenus Web n’est ni particulièrement lent ni coûteux, ce mécanisme pourrait suffire pour la plupart des cas d’utilisation. Cependant, ces connexions directes pourraient être suivies à la trace par votre FAI ou par le gouvernement. Dans une certaine mesure, la désactivation de cette option pourrait éviter de telles connexions et ce suivi habituel (mais pas complètement, voir [risques](../concepts/risques.md)).
id: Jika mendapatkan sebagian besar konten web tidak terlalu lambat atau mahal, mekanisme ini mungkin lebih dari cukup untuk sebagian besar kasus penggunaan. Namun, koneksi langsung tersebut dapat dilacak oleh ISP atau pemerintah Anda. Sampai batas tertentu, menonaktifkan opsi ini dapat menghindari koneksi dan pelacakan seperti itu (namun tidak sepenuhnya, lihat [risiko](../concepts/risks.md)).
my: ဝက်ဘ်အကြောင်းအရာအများစုကို ရယူရန် ပြောပလောက်အောင် မနှေးပါက သို့မဟုတ် ဈေးမကြီးပါက ဤစက်ကိရိယာသည် ကိစ္စရပ် အများစုအတွက် လုံလောက်နိုင်သည်။ သို့သော် ထိုတိုက်ရိုက် ချိတ်ဆက်မှုများကို သင်၏ ISP သို့မဟုတ် အစိုးရက ခြေရာခံနိုင်သည်။ ဤရွေးချယ်စရာကို ပိတ်ခြင်းက ထိုချိတ်ဆက်မှုများနှင့် မပြောပလောက်သော ခြေရာခံခြင်းကို အတိုင်းအတာတစ်ခုအထိ ရှောင်ရှားနိုင်သည်။ (သို့သော် အပြည့်အဝ မဟုတ်ပါ၊ [စွန့်စားမှုများ](../concepts/risks.md) ကို ကြည့်ပါ)။
pt_br: Se obter a maior parte do conteúdo Web não é particularmente lento ou custoso, esse mecanismo pode ser mais que suficiente para a maioria dos casos de uso. No entanto, tais conexões diretas podem ser rastreadas por seu ISP ou governo. Em alguma medida, desabilitar essa opção pode evitar tais conexões e rastreamento trivial (mas não completamente, veja [riscos](../concepts/risks.md)).
ru: Если просмотр веб-контента не является особенно медленным или дорогим, в большинстве случаев этого способа может быть более чем достаточно. В то же время, прямые соединения могут отслеживаться вашим интернет-провайдером или правительством. В некоторой степени отключение этой опции позволяет избежать таких соединений и тривиального отслеживания (но не полностью, см. раздел [риски](../concepts/risks.md)).
tr: İnternet içeriklerini yüklemek yavaş veya pahalı değilse bu yöntem çoğu kullanım senaryosu için yeterlidir. Doğrudan bağlantılar internet hizmeti sağlayıcınız ya da hükumetiniz tarafından izlenebilir. Bu seçeneği kapatmak bu tarz bağlantıların kurulmasından kaçınır ve izlenmeyi kısıtlar (tümüyle kısıtlamaz, [tehlikeler](../concepts/risks.md) bölümüne bakın).
uk: Якщо перегляд веб-вмісту не є особливо повільним або дорогим, в більшості випадків цей спосіб може бути більш ніж достатнім. Однак, прямі зʼєднання можуть відстежуватися Вашим Інтернет-постачальником або урядом. Деякою мірою відключення цього параметра дозволяє уникнути таких зʼєднань та банального відстеження (але не повністю, дивіться розділ [ризики](../concepts/risks.md)).

source: Also, when accessing a Web site over insecure HTTP (instead of the more secure HTTPS), a censor may intercept the connection and supply the user with a bogus site, a tampering which Ceno cannot detect by itself. In such cases, it may help to disable this option and thus always resort to other, safer Ceno mechanisms. Please check the section on [troubleshooting](troubleshooting.md) to learn more about this issue.
ar: أيضًا، عند الوصول إلى موقع ويب عبر بروتوكول HTTP غير الآمن (بدلاً من بروتوكول HTTPS الأكثر أمانًا)، قد يعترض الرقيب الاتصال ويزود المستخدم بموقع زائف، وهو تلاعب لا يمكن لـ Ceno اكتشافه بنفسه. في مثل هذه الحالات، قد يساعد تعطيل هذا الخيار واللجوء إلى آليات Ceno الأخرى الأكثر أمانًا. يرجى مراجعة القسم الخاص بـ [استكشاف الأخطاء وإصلاحها](troubleshooting.md) لمعرفة المزيد حول هذه المشكلة.
de: Auch beim Zugriff auf eine Website über unsicheres HTTP (anstelle des sichereren HTTPS) kann ein Zensor die Verbindung abfangen und dem Benutzer eine gefälschte Website liefern, eine Manipulation, die Ceno selbst nicht erkennen kann. In solchen Fällen kann es helfen, diese Option zu deaktivieren und so immer auf andere, sicherere Ceno-Mechanismen zurückzugreifen. Bitte lesen Sie den Abschnitt [Troubleshooting](troubleshooting.md), um mehr über dieses Problem zu erfahren.
es: También, al acceder a un sitio Web a través de HTTP inseguro (en vez del más seguro HTTPS), un censor podría interceptar la conexión y suministrar a la/él usuaria(o) con un sitio falso, una manipulación la cual Ceno no puede detectar por sí mismo. En tal caso, podría ayudar deshabilitar esta opción y de esa manera recurrir siempre a otros, mecanismos de Ceno más seguros. Por favor comprueba la sección sobre [resolución de problemas](troubleshooting.md) para aprender más acerca de esta cuestión.
fr: De plus, si vous accédiez à un site Web grâce au protocole HTTP non sécurisé (au lieu du protocole HTTPS plus sûr), un censeur pourrait intercepter la connexion et vous servir un faux site, une manipulation que Ceno ne peut pas détecter seul. Dans de tels cas, la désactivation de cette option pourrait aider, recourant ainsi toujours à d’autres mécanismes plus sûrs de Ceno. Consultez la section [dépannage](troubleshooting.md) pour en apprendre davantage.
id: Selain itu, saat mengakses situs web melalui HTTP yang tidak aman (alih-alih HTTPS yang lebih aman), sensor dapat mencegat koneksi dan menampilkan situs palsu kepada pengguna, gangguan yang tidak dapat dideteksi Ceno dengan sendirinya. Dalam kasus seperti itu, menonaktifkan opsi ini mungkin dapat membantu dan karenanya selalu menggunakan mekanisme Ceno lain yang lebih aman. Harap periksa bagian [pemecahan masalah](pemecahan masalah.md) untuk mempelajari lebih lanjut tentang permasalahan ini.

source: *Via the Ceno network (private)* (or **proxy access**) allows Ceno to use injectors as normal HTTP proxy servers to reach origin servers.
ar: *عبر شبكة Ceno (الخاصة)* (أو ** الوصول عبر وكيل**) يسمح لـ Ceno باستخدام الحاقنات كخوادم HTTP وكيلة عادية للوصول إلى الخوادم الأصلية.
de: *Über das Ceno-Netz (privat)* (oder **Proxy-Zugang**) kann Ceno die Injektoren als normale HTTP-Proxyserver verwenden, um die Ursprungsserver zu erreichen.
es: *A través de la red Ceno (privada)* (o **acceso por proxy**) le permite a Ceno usar inyectores como servidores proxy HTTP normales para alcanzar a los servidores de origen.
fr: *Par le réseau Ceno (privé)* (ou **accès par un mandataire**) permet à Ceno d’utiliser les injecteurs comme des serveurs mandataires HTTP normaux pour atteindre les serveurs d’origine.
id: *Melalui jaringan Ceno (privat)* (atau **akses proksi**) memungkinkan Ceno untuk menggunakan injektor sebagai server proksi HTTP biasa untuk menjangkau server asal.

source: This mechanism only works in private browsing mode.
ar: تعمل هذه الآلية فقط في وضع التصفح الخاص.
es: Este mecanismo solamente funciona en el modo privado de navegación.
fa: این سازوکار فقط در حالت مرور خصوصی کار می‌کند.
fr: Ce mécanisme ne fonctionne qu’en mode de navigation privée.
id: Mekanisme ini hanya berfungsi di dalam mode penjelajahan privat.
my: ဤစက်ကိရိယာသည် သီးသန့် ရှာဖွေမှုမုဒ်တွင်သာ အလုပ်လုပ်သည်။
pt_br: Esse mecanismo somente funciona no modo de navegação privativa.
ru: Этот механизм работает только в режиме приватного просмотра.
tr: Bu yöntem yalnızca gizli gezinme kipinde çalışır.
uk: Цей механізм працює лише в режимі приватного перегляду.

source: When accessing content over HTTPS, only origin servers will be able to decrypt traffic. When using plain HTTP, the injector may also see the unencrypted traffic (but it should still not sign or share its content with others). Other participants, such as bridges, will never see the unencrypted traffic.
ar: عند الوصول إلى المحتوى عبر HTTPS، ستتمكن الخوادم الأصلية فقط من فك تشفير حركة المرور. عند استخدام HTTP عادي ، قد يرى الحاقن أيضاً حركة المرور غير المشفرة (ولكن لا يزال يتعين عليه عدم التوقيع أو مشاركة محتواه مع الآخرين). المشاركون الآخرون ، مثل الجسور ، لن يروا أبدا حركة المرور غير المشفرة.
de: Wenn der Zugriff auf Inhalte über HTTPS erfolgt, können nur die Ursprungsserver den Datenverkehr entschlüsseln. Bei der Verwendung von einfachem HTTP kann der Injektor auch den unverschlüsselten Datenverkehr sehen (er sollte aber trotzdem nicht signieren oder seine Inhalte mit anderen teilen). Andere Teilnehmer, wie z. B. Bridges, sehen den unverschlüsselten Datenverkehr nie.
es: Al acceder contenido sobre HTTPS, solamente los servidores de origen serán capaces de descifrar el tráfico. Al usar HTTP común, el inyector también podría ver el tráfico no cifrado (pero aún así no firma o comparte su contenido con otros). Otra(o)s participantes, como los puentes, nunca verán el tráfico no cifrado.
fr: Lors de l’accès au contenu par HTTPS, seuls les serveurs d’origine seront en mesure de déchiffrer le trafic. Lors de l’accès par HTTP ordinaire, l’injecteur peut aussi voir le trafic non chiffré (mais il ne devrait toujours pas signer ou partager son contenu avec d’autres). Les autres participants tels que les ponts ne verront jamais le trafic non chiffré.
id: Saat mengakses konten melalui HTTPS, hanya server asal yang dapat mendekripsi lalu lintas. Saat menggunakan HTTP biasa, injektor juga dapat melihat lalu lintas yang tidak terenkripsi (namun seharusnya tetap tidak menandatangani atau membagikan kontennya dengan orang lain). Partisipan lain, seperti jembatan, tidak akan pernah melihat lalu lintas yang tidak terenkripsi.
my: HTTPS သုံး၍ အကြောင်းအရာကို ဝင်ရောက်သုံးစွဲချိန်တွင် မူလ ဆာဗာများသည်သာ အသွားအလာကို ကုဒ်ဖြေနိုင်ပါမည်။ ရိုးရိုး HTTP ကို အသုံးပြုချိန်တွင် ထိုးသွင်းဖိုင်သည်လည်း ကုဒ်ဖြေထားသော အသွားအလာကို မြင်နိုင်ပါမည် (သို့သော် ၎င်းသည် ၎င်း၏ အကြောင်းအရာကို လက်မှတ်ထိုး သို့မဟုတ် အခြားသူများနှင့် မျှဝေနိုင်ဦးမည် မဟုတ်သေးပါ)။ ပေါင်းကူးများကဲ့သို့ အခြားပါဝင်ဆောင်ရွက်သူများသည် ကုဒ်ဖြေထားသော အသွားအလာကို လုံးဝမြင်ရမည် မဟုတ်ပါ။
pt_br: Ao acessar conteúdo através de HTTPS, apenas os servidores de origem serão capazes de decifrar o tráfego. Ao usar HTTP simples, o injetor pode também ver o tráfego não criptografado (mas ainda assim não deve assinar ou compartilhar seu conteúdo com outras pessoas). Demais participantes, como pontes, nunca verão o tráfego não criptografado.
ru: При доступе к контенту по HTTPS расшифровать трафик смогут только исходные серверы. При использовании обычного HTTP инъектор также может видеть незашифрованный трафик (но он все равно не должен подписывать или передавать контент другим). Другие участники, такие как мосты, никогда не увидят незашифрованный трафик.
tr: Bir içeriğe HTTPS kullanarak erişirken yalnızca kaynak sunucular trafiğin şifresini çözebilir. Düz HTTP kullanıldığında içerik ekleyici şifrelenmemiş trafiği görebilir (yine de içeriği imzalamaz ve başkalarıyla paylaşmaz). Köprüler gibi diğer katılımcılar asla şifrelenmemiş trafiği görmez.
uk: Під час доступу до вмісту через HTTPS, розшифрувати трафік зможуть лише вихідні сервери. При використанні звичайного HTTP інʼєктор також може бачити незашифрований трафік (але він все одно не повинен підписувати чи передавати вміст іншим). Інші учасники, що є мостами, ніколи не побачать незашифрований трафік.
