Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/settings.po
Languages: ar, de, es, fa, fr, id, my, pt_br, ru, tr, uk

source: **Technical note:** These options are provided by the *CENO Extension*, a Firefox extension which comes installed out of the box with CENO and takes care of proper integration with Ouinet, like enabling content injection and cache retrieval under public browsing, hinting the user about the source of the content being visualized, and notifying about new versions of Ouinet.
my: **နည်းပညာဆိုင်ရာ မှတ်ချက် -** ဤရွေးချယ်စရာများကို *CENO အဆက်* က ပံ့ပိုးသည်။ ၎င်းသည်
pt_br: **Nota técnica:** Estas opções são oferecidas pela *Extensão CENO*, uma extensão do Firefox que vem instalada junto com o CENO e cuida da integração adequada com a Ouinet. Ela realiza, por exemplo: a habilitação de injeção de conteúdo e recuperação de cache sob navegação pública; a indicação, para o usuário, da source do conteúdo sendo visualizado e a notificação sobre novas versões da Ouinet.
ru: **Техническое примечание:** Эти параметры предоставляются *расширением CENO* — расширением Firefox, которое устанавливается вместе с CENO и обеспечивает интеграцию с Ouinet. Например, оно позволяет делиться контентом и получать его из общего кэша при публичном просмотре, подсказывает пользователю источник отображаемого контента и уведомляет о новых версиях Ouinet.
tr: **Teknik not:** Bu seçenekler CENO ile birlikte gelen bir Firefox uzantısı olan *CENO Extension* tarafından sağlanır ve düzgün Ouinet bütünleştirmesi sağlar. Örneğin, herkese açık gezinme sırasında araya içerik eklenmesi ve ön bellekten kullanım, görüntülenen içeriğin kaynağı hakkında bilgi sağlama ve yeni Ouinet sürümleri hakkında bilgilendirme gibi özellikler sağlar.
uk: **Технічна примітка:** Ці параметри надаються *розширенням CENO* – розширенням Firefox, що встановлюється разом із CENO та забезпечує інтеграцію з Ouinet. Наприклад, воно дозволяє ділитися вмістом і отримувати його із загального кешу під час публічного перегляду, підказує користувачеві джерело наявного вмісту, і повідомляє про нові версії Ouinet.

source: These features are available on a page that can be accessed by choosing *CENO* in the app's main menu. Please note that the menu entry may take a few seconds to pop up on app start. The page should look like this:
my: ဤလုပ်ဆောင်ချက်များကို အက်ပ်၏ အဓိက မီနူးရှိ *CENO* ကို ရွေးချယ်ခြင်းဖြင့် ဝင်ရောက်သုံးစွဲနိုင်သော စာမျက်နှာတွင် ရရှိနိုင်သည်။ အက်ပ် စတင်ချိန်တွင် မီနူးအကြောင်းအရာ ပေါ်လာရန် စက္ကန့်အနည်းငယ် ကြာနိုင်ကြောင်း ကျေးဇူးပြု၍ သတိပြုပါ။ စာမျက်နှာကို ဤသို့ တွေ့ရနိုင်သည် -
pt_br: As funcionalidades citadas estão disponíveis em uma página que pode ser acessada ao se escolher *CENO* no menu principal do aplicativo. Por favor, observe que a entrada do menu pode demorar alguns segundos para aparecer na inicialização do aplicativo. A página deve ter a seguinte aparência:
ru: Эти функции доступны на странице, которую можно открыть, выбрав *CENO* в главном меню приложения. Обратите внимание, что при запуске приложения на появление этого пункта меню может уйти несколько секунд. Страница должна выглядеть следующим образом:
tr: Bu özelliklere uygulama menüsündeki *CENO* seçeneğinden erişilebilir. Uygulama ilk kez açıldığında bu menü seçeneğinin gözükmesinin biraz zaman alabilir. Sayfa şu şekilde görüntülenmelidir:
uk: Ці функції доступні на сторінці, яку можна відкрити, обравши *CENO* в головному меню програми. Зверніть увагу, що під час запуску програми для відображення цього пункту меню може знадобитися кілька секунд. Сторінка має такий вигляд:

source: ![Figure: The CENO Settings page](images/settings.png)
my: ![ပုံ - CENO ဆက်တင် စာမျက်နှာ](images/settings.png)
pt_br: ![Figura: A página Configurações do CENO](images/settings.png)
ru: ![Рисунок: Страница настроек CENO](images/settings.png)
tr: ![Görsel:CENO ayarları bölümü](images/settings.png)
uk: ![Малюнок: Сторінка налаштувань CENO](images/settings.png)

source: The four checkboxes on the top of the page selectively enable or disable the different mechanisms or *sources* that CENO as a Ouinet client uses to retrieve content while using either [public or private browsing](public-private.md) tabs. All boxes are enabled by default.
fa: چهار چک‌باکس بر فراز بخش بالایی صفحه بنا بر انتخاب کاربر سازوکارهای متفاوت یا *منابعی* را فعال یا غیرفعال کند که سنو به‌عنوان یک سرویس‌گیرنده‌ی وینت از آن‌ها استفاده می‌کند تا محتوایی را بازیابی کند در حالی که از زبانه‌های خواه [مرور عمومی یا خصوصی](public-private.md) استفاده می‌کند. تمام جعبه‌ها به‌طور پیش‌فرض فعال شده‌اند.
my: စာမျက်နှာထိပ်ဘက်ရှိ အမှန်ခြစ်ရန် အကွက် လေးခုသည် [အများသုံး သို့မဟုတ် သီးသန့် ရှာဖွေခြင်း](public-private.md) တပ်ဗ်များမှ တစ်ခုခုကို အသုံးပြုနေစဉ် အကြောင်းအရာကို ပြန်ထုတ်ရန် Ouinet လက်ခံစက်အနေနှင့် CENO က အသုံးပြုသော ကွဲပြားသည့် စက်ကိရိယာ သို့မဟုတ် *ရင်းမြစ်များ* ကို ရွေးချယ်၍ ဖွင့်သည် သို့မဟုတ် ပိတ်သည်။ ပုံသေအားဖြင့် အကွက်အားလုံးကို ဖွင့်ထားသည်။
pt_br: As quatro caixas de seleção no topo da página seletivamente habilitam ou desabilitam os diferentes mecanismos ou *sources* que o CENO, como um cliente Ouinet, usa para recuperar conteúdo enquanto utiliza tanto as abas de [navegação pública quanto privativa](public-private.md). Todas as caixas estão habilitadas por padrão.
ru: Четыре флажка в верхней части страницы выборочно включают или выключают различные варианты или *источники*, которые CENO как клиент Ouinet использует для получения содержимого при использовании вкладок [публичного или приватного просмотра](public-private.md). По умолчанию все поля включены.
tr: Sayfanın üst kısmındaki dört işaret kutusu, CENO Ouinet istemcisi olarak [herkese açık ya da gizli gezinme](public-private.md) ile kullanılırken, içerikleri alma yöntemleri ile kaynaklarını seçmenizi sağlar. Varsayılan olarak tüm kutular işaretlidir.
uk: Чотири прапорці у верхній частині сторінки вибірково вмикають чи вимикають різні варіанти або *джерела*, що їх CENO як клієнт Ouinet використовує для отримання вмісту при використанні вкладок [публічного або приватного перегляду](public-private.md). За замовчуванням усі поля ввімкнені.

source: *Direct from website* (or **origin access**) allows CENO to try to reach the origin server directly before attempting other mechanisms enabled below.
fa: *مستقیم از وب‌سایت* (یا **دسترسی اصلی**) به سنو امکان می‌دهد تا مستقیماً به سرور اصلی دسترسی پیدا کند پیش از آن‌که برای فعال‌سازی سایر سازوکارها در پایین دست به اقدام بزند.
my: *ဝက်ဘ်ဆိုက်မှ တိုက်ရိုက်* (သို့မဟုတ် **မူလ ဝင်ရောက်သုံးစွဲမှု**) သည် အောက်တွင် ဖွင့်ထားသော အခြားစက်ကိရိယာများကို မကြိုးစားခင် CENO အား မူလဆာဗာထံ တိုက်ရိုက်ရောက်အောင် ကြိုးစားခွင့်ပြုသည်။
pt_br: *Direto do website* (ou **acesso de origem**) permite ao CENO tentar alcançar o servidor de origem diretamente antes de tentar outros dos mecanismos habilitados abaixo.
ru: *Напрямую с сайта* (или **исходный доступ**) позволяет CENO попытаться напрямую связаться с исходным сервером, прежде чем пытаться использовать другие варианты, включенные ниже.
tr: *Doğrudan siteden* (veya **kaynaktan erişim**) seçeneğinde CENO, aşağıdaki diğer yöntemleri denemeden önce kaynak sunucuya bağlanmaya çalışır.
uk: *Прямо з сайту* (або **вихідний доступ**) дозволяє CENO спробувати безпосередньо звʼязатися з вихідним сервером, перш ніж намагатися використовувати інші варіанти, дозволені нижче.

source: Also, when accessing a Web site over insecure HTTP (instead of the more secure HTTPS), a censor may intercept the connection and supply the user with a bogus site, a tampering which CENO cannot detect by itself. In such cases, it may help to disable this option and thus always resort to other, safer CENO mechanisms. Please check the section on [troubleshooting](troubleshooting.md) to learn more about this issue.
my: ထို့ပြင် (ပိုမိုလုံခြုံသော HTTPS အစား) မလုံခြုံသည့် HTTP သုံး၍ ဝဘ်ဆိုက်ကို သုံးရာတွင် ဆင်ဆာဖြတ်သူသည် ဆက်သွယ်မှုကို ကြားဖြတ်ပြီး အတုအယောင်ဆိုက်တစ်ခုဖြင့် သုံးစွဲသူကို ပံ့ပိုးနိုင်သည်။ ယင်းကို CENO ကိုယ်တိုင် မတွေ့ရှိနိုင်ပါ။ ထို့ကြောင့် ဤရွေးချယ်စရာကို ပိတ်ထားပြီး အန္တရာယ်ကင်းသော အခြား CENO ယန္တရားကို အမြဲအသုံးပြုလျှင် အဆင်ပြေနိုင်ပါသည်။ ယခုပြဿနာနှင့် ပတ်သက်ပြီး ပိုမိုလေ့လာလိုပါက [ပြဿနာဖြေရှင်းခြင်း](troubleshooting.md) အပိုင်းတွင် ကျေးဇူးပြုပြီး ကြည့်ရှုပါ။
pt_br: Ademais, ao acessar um website através do inseguro protocolo HTTP (ao invés do mais seguro HTTPS), um censor pode interceptar a conexão e fornecer ao usuário um website falso, uma adulteração que o CENO não é capaz de detectar por si só. Em tais casos, pode ser útil desabilitar essa opção e, consequentemente, recorrer a outros - e mais seguros - mecanismos do CENO. Por favor, verifique a seção sobre [solução de problemas](troubleshooting.md) para saber mais sobre esse problema.
ru: Кроме того, при доступе к веб-сайту по незащищенному протоколу HTTP (вместо более безопасного HTTPS) цензор может перехватить соединение и предоставить пользователю фиктивный сайт, что не может быть обнаружено CENO самостоятельно. В таких случаях полезно отключить эту опцию и всегда прибегать к другим, более безопасным способам использования CENO. Пожалуйста, ознакомьтесь с разделом [устранение неполадок](troubleshooting.md), чтобы узнать больше об этой проблеме.
tr: İnternet sitelerine güvenli olmayan HTTP (daha güvenli olan HTTPS yerine) ile erişirken bağlantı izlenebilir ve kullanıcıya CENO tarafından algılanamayacak sahte bir site gönderebilir. Böyle durumlarda bu seçeneği kapatarak daha güvenli CENO yöntemlerine başvurulması önerilir. Bu sorun hakkında ayrıntılı bilgi almak için [sorun giderme](troubleshooting.md) bölümüne bakabilirsiniz.
uk: Крім того, під час доступу до вебсайту за незахищеним протоколом HTTP (замість безпечнішого HTTPS) цензор може перехопити зʼєднання та надати користувачеві фіктивний сайт, який CENO не може виявити самостійно. У таких випадках корисно відключити цю опцію і завжди вдаватися до інших безпечніших способів використання CENO. Будь ласка, перегляньте розділ [усунення несправностей](troubleshooting.md), щоб дізнатися більше про цю проблему.

source: *Via the CENO network (private)* (or **proxy access**) allows CENO to use injectors as normal HTTP proxy servers to reach origin servers.
fa: *از طریق شبکه‌ی (خصوصی) سنو* (یا **دسترسی پروکسی**) به سنو اجازه می‌دهد تا از تزریق‌کننده‌ها به‌عنوان سرورهای پروکسی HTTP معمولی برای دستیابی به سرورهای اصلی استفاده کند.
my: *CENO ကွန်ရက် (သီးသန့်) မှတစ်ဆင့်* (သို့မဟုတ် **ပရောက်စီ ဝင်ရောက်သုံးစွဲခွင့်**) သည် မူလ ဆာဗာများသို့ ရောက်ရှိရန် CENO အား ထိုးသွင်းဖိုင်များကို ပုံမှန် HTTP ပရောက်စီ ဆာဗာများအဖြစ် အသုံးပြုခွင့်ပေးသည်။
pt_br: *Via rede do CENO (privada)* (ou **acesso via proxy**) permite que o CENO use injetores como servidores proxy HTTP comuns para alcançar os servidores de origem.
ru: *Через приватную сеть CENO* (или **прокси-доступ**) позволяет CENO использовать инъекторы в качестве обычных прокси-серверов HTTP для доступа к исходным серверам.
tr: *CENO ağı üzerinden (gizli)* (veya **vekil sunucu erişimi**) seçeneğinde, CENO içerik ekleyicileri HTTP vekil sunucu olarak kullanarak kaynak sunuculara erişir.
uk: *Через приватну мережу CENO* (або **проксі-доступ**) дозволяє CENO використовувати інʼєктори як звичайні проксі-сервери HTTP для доступу до вихідних серверів.

source: *Via the CENO network (public)* (or **injector access**) enables CENO to strip any private information from requests and send them to an injector. The injector gets the content from an origin server, signs it, and sends it back to CENO - which then begins seeding it.
my: *CENO ကွန်ရက် (အများသုံး) မှတစ်ဆင့်* (သို့မဟုတ် **ထိုးသွင်းဖိုင် ဝင်ရောက်သုံးစွဲခွင့်**) သည် CENO အား တောင်းဆိုမှုများမှ မည်သည့် သီးသန့် အချက်အလက်ကိုမဆို ထုတ်ယူပြီး ၎င်းတို့ကို ထိုးသွင်းဖိုင်တစ်ခုဆီသို့ ပေးပို့ခွင့် ပြုသည်။ ထိုးသွင်းဖိုင်သည် မူလ ဆာဗာထံမှ အကြောင်းအရာကို ရယူ၍ လက်မှတ်ထိုးပြီး CENO ထံ ပြန်လည် ပေးပို့မည် ဖြစ်ကာ ၎င်းက ထိုအကြောင်းအရာကို စတင် တင်ပို့ပါမည်။
pt_br: *Via rede do CENO (pública)* (ou **acesso de injetor**) possibilita que o CENO retire qualquer informação privada das solicitações e as envie para um injetor. O injetor obtém o conteúdo de um servidor de origem, assina-o e o envia de volta para o CENO - que, então, começa a semeá-lo.
ru: *Через публичную сеть CENO* (или **доступ через инъектор**) позволяет CENO удалять личную информацию из запросов и отправлять их инъектору. Инъектор получает контент с исходного сервера, подписывает его и отправляет обратно CENO, который затем начинает его раздавать.
tr: *CENO ağı üzerinden (herkese açık)* (veya **içerik ekleyici erişimi**) seçeneğinde kişisel bilgiler isteklerden silinir ve bir içerik ekleyiciye gönderilir. İçerik ekleyici kaynak sunucudan içeriği alır, imzalar ve dağıtması için tekrar CENO'ya gönderir.
uk: *Через публічну мережу CENO* (або **доступ через інʼєктор**) дозволяє CENO видаляти особисту інформацію зі запитів та надсилати їх інʼєктору. Інʼєктор отримує вміст із вихідного сервера, підписує його та відправляє назад до CENO, який згодом починає роздавати цей вміст.

source: *Shared by other CENO users* allows CENO to try to retrieve content from the **distributed cache**, i.e. from other CENO and Ouinet clients seeding it.
fa: *به اشتراک گذاشته‌شده از سوی سایر کاربران سنو* به سنو اجازه می‌کند تا محتوایی را از **انبار توزیع‌شده** بازیابی کند، یعنی از سایر سرویس‌گیرندگان سنو و وینت برای بذرپاشی آن استفاده کنند.
my: *အခြား CENO သုံးစွဲသူများက မျှဝေထားသည်* သည် CENO အား အကြောင်းအရာကို **ဖြန့်ချိထားသော ယာယီ သိမ်းဆည်းထားသည့် မှတ်ဉာဏ်** မှ ပြန်ထုတ်ရန် ကြိုးစားခွင့်ပြုသည်။ ဆိုလိုသည်မှာ ၎င်းကို တင်ပို့သော အခြား CENO နှင့် Ouinet လက်ခံစက်များထံမှ ဖြစ်သည်။
pt_br: *Compartilhado por outros usuários CENO* permite ao CENO tentar recuperar conteúdo do **cache distribuído**, isto é, de outros clientes CENO e Ouinet que o estão semeando.
ru: *Предоставлено другими пользователями CENO* позволяет CENO пытаться извлечь контент из **распределенного кэша**, т.е. от других клиентов CENO и Ouinet, передающих его.
tr: *Diğer CENO kullanıcılarının paylaşımlarından* seçeneğinde, içerikler içeriği dağıtan diğer Ouinet istemcileri ve CENO gibi **dağıtılmış ön bellekten** alınmaya çalışılır.
uk: *Надано іншими користувачами CENO* дозволяє CENO намагатися витягти вміст із **розподіленого кешу**, тобто від інших клієнтів CENO та Ouinet, що передають вміст.

source: This page also provides you with some information about your CENO Browser app and Ouinet client:
my: ဤစာမျက်နှာသည် သင့် CENO ဘရောက်ဇာ အက်ပ်နှင့် Ouinet လက်ခံစက်အကြောင်း အချက်အလက်အချို့ကိုလည်း သင့်အား ပေးသည် -
pt_br: Essa página também oferece a você algumas informações sobre o seu aplicativo do Navegador CENO e cliente Ouinet:
ru: На этой странице также представлена информация о приложении CENO Browser и клиенте Ouinet:
tr: Bu sayfa CENO Browser uygulamanız ve Ouinet istemciniz hakkında da bilgiler verir:
uk: На цій сторінці також представлена інформація про застосунок браузер CENO та клієнт Ouinet:

source: *UPnP status* indicates whether CENO was able to tell your router or access point to allow incoming connections towards it. Also include in reports.
fa: *وضعیت UPnP* نشان می‌دهد که آیا سنو توانسته بود با روتر یا نقطه‌ی دسترسی شما ارتباط برقرار کند تا اتصالات ورودی به سویش را امکان‌پذیر سازد. این را نیز در گزارش‌ها بگنجانید.
my: *UPnP အခြေအနေ* သည် CENO က သင့်ရောက်တာ သို့မဟုတ် ဝင်ရောက်သုံးစွဲမှု ပွိုင့်အား ၎င်းထံလာသည့် အဝင်ချိတ်ဆက်မှုများကို ခွင့်ပြုရန် ပြောနိုင်ခဲ့ခြင်း ရှိ၊ မရှိကို ညွှန်ပြသည်။ အစီရင်ခံစာများတွင်လည်း ထည့်ပါ။
pt_br: *Estado UPnP* indica se o CENO conseguiu solicitar que o seu roteador ou ponto de acesso permitisse que as conexões de entrada passassem por ele. Inclua também nos relatórios.
ru: *Статус UPnP* показывает, смог ли CENO запросить у вашего роутера или точки доступа разрешение на входящие подключения к нему. Также включается в отчеты.
tr: *UPnP durumu* Gelen bağlantıların CENO tarafından alınabilmesi için yönlendiriciniz veya bağlantı noktanız ile etkileşim kurulabildiğini gösterir. Sorun bildirirken bunu da ekleyin.
uk: *Стан UPnP* показує, чи зміг CENO запитати з Вашого маршрутизатора чи точки доступу дозвіл на вхідні підключення до нього. Також додавайте до звітів.

source: *Local UDP endpoints* are the Internet addresses in your device used by CENO to seed signed content to other clients. These are shown to help test and debug the app, and should not be generally disclosed.
pt_br: *Endpoints UDP locais* são os endereços de Internet em seu dispositivo usados pelo CENO para semear conteúdo assinado para outros clientes. Eles são mostrados para ajudar a testar e depurar o aplicativo e não devem, em geral, ser divulgados.
ru: *Локальные конечные точки UDP* - это интернет-адреса, используемые CENO для передачи подписанного контента другим клиентам. Они показаны для тестирования и отладки приложения и раскрывать эти данные не нужно.
tr: *Yerel UDP uç noktaları* İmzalı içeriklerin CENO tarafından diğer istemcilere gönderilmesi için kullanulan internet adresleridir. Uygulamanın sınanmasında ve hata ayıklamasında yararlıdır ve genellikle gizli tutulmalıdır.
uk: *Локальні кінцеві точки UDP* – це Інтернет-адреси у Вашому пристрої, які використовуються CENO для передачі підписаного вмісту іншим клієнтам. Вони показані для тестування та налагодження програми. Розкривати ці дані не потрібно.

source: *External UDP endpoints* are the Internet addresses in your router given to your CENO traffic. Only available with UPnP-enabled routers, they are also useful for diagnostics and not to be generally disclosed.
pt_br: *Endpoints UDP externos* são os endereços de Internet em seu roteador atribuídos para o seu tráfego do CENO. Somente disponíveis em roteadores com UPnP habilitado, eles também são úteis para diagnóstico e em geral não são divulgados.
tr: *Dış UDP uç noktaları* yönlendiricinizin CENO trafiğine verdiği internet adresleridir. Yalnızca UPnP özelliğinin açık olduğu yönlendiricilerde bulunur. Sorun tanılamasında yararlıdır ve genellikle gizli tutulmalıdır.
uk: *Зовнішні кінцеві точки UDP* – це Інтернет-адреси у Вашому маршрутизаторі, надані для Вашого трафіку CENO. Доступні лише для маршрутизаторів з увімкненим UPnP. Вони корисні для діагностики та не підлягають розкриттю.

source: *CENO Browser* indicates the exact version of CENO that you are using. Also include in reports.
pt_br: *Navegador CENO* indica a versão exata do CENO que você está usando. Também inclua nos relatórios.
ru: *Браузер CENO* указывает точную версию CENO, которую вы используете. Её тоже следует включать в отчёты о неполадках.
tr: *CENO Browser* hangi CENO sürümünü kullandığınızı gösterir. Sorun bildirirken bunu da ekleyin.
uk: *Браузер CENO* вказує точну версію CENO, якою ви користуєтеся. Також включається у звіти.

source: *CENO Extension* shows the version of the extension that integrates Firefox with CENO. Also include in reports.
fa: *افزونه‌ی سنو* نسخه‌ای از افزونه را نشان می‌دهد که فایرفاکس را با سنو ادغام می‌کند. این را نیز در گزارش‌ها بگنجانید.
my: *CENO အဆက်* သည် Firefox ကို CENO နှင့် ပေါင်းစည်းပေးသော အဆက်၏ ဗားရှင်းကို ပြသသည်။ အစီရင်ခံစာများတွင်လည်း ထည့်ပါ။
pt_br: *Extensão CENO* exibe a versão da extensão que integra o Firefox com CENO. Inclua também nos relatórios.
ru: *Расширение CENO* показывает версию расширения, которое интегрирует Firefox с CENO. Также включайте в отчетах.
tr: *CENO uzantısı* Firefox ile CENO bütünleştirme uzantısının sürümünü gösterir. Sorun bildirirken bunu da ekleyin.
uk: *Розширення CENO* показує версію розширення, яке інтегрує Firefox із CENO. Також додавайте до звітів.

source: *Ouinet* shows the version of Ouinet backing CENO. Also include in reports.
fa: *وینت* نسخه‌ای از وینت را نشان می‌دهد که از سنو پشتیبانی می‌کند. این را نیز در گزارش‌ها بگنجانید.
my: *Ouinet* သည် CENO ကို ထောက်ခံသော Ouinet ၏ ဗားရှင်းကို ပြသသည်။ အစီရင်ခံစာများတွင်လည်း ထည့်ပါ။
pt_br: *Ouinet* exibe a versão da Ouinet por trás do CENO. Inclua também nos relatórios.
ru: *Ouinet* показывает версию Ouinet, установленную в CENO. Также включайте в отчетах.
tr: *Ouinet* CENO tarafından kullanılan Ouinet sürümünü gösterir. Sorun bildirirken bunu da ekleyin.
uk: *Ouinet* показує версію Ouinet, встановлену в CENO. Також додавайте до звітів.

source: *Ouinet protocol* is the version number of the protocol that CENO uses to talk to other Ouinet clients and injectors. Also include in reports.
fa: *پروتکل وینت* شماره‌ی نسخه‌ی پروتکلی است که سنو به کار می‌برد تا با سایر سرویس‌گیرندگان وینت و تزریق‌کنندگان حرف بزند. این را نیز در گزارش‌ها بگنجانید.
my: *Ouinet ပရိုတိုကော* သည် CENO က အခြား Ouinet လက်ခံစက်များနှင့် ထိုးသွင်းဖိုင်များနှင့် ဆက်သွယ်ရန် အသုံးပြုသော ပရိုတိုကော၏ ဗားရှင်းနံပါတ် ဖြစ်သည်။ အစီရင်ခံစာများတွင်လည်း ထည့်ပါ။
pt_br: *Protocolo Ouinet* é o número de versão do protocolo que o CENO utiliza para conversar com outros clientes e injetores Ouinet. Inclua também nos relatórios.
ru: *Протокол Ouinet* — номер версии протокола, который CENO использует для общения с другими клиентами Ouinet и инъекторами. Также включайте в отчетах.
tr: *Ouinet iletişim kuralı* CENO'nun diğer Ouinet istemcileri ve içerik ekleyicileri ile iletişim kurarken kullandığı iletişim kuralı sürümünü gösterir. Sorun bildirirken bunu da ekleyin.
uk: *Протокол Ouinet* – номер версії протоколу, який використовує CENO для взаємодії з іншими клієнтами Ouinet та інʼєкторами. Також додавайте до звітів.

source: Next to the *Local cache size* value above, there is a button which allows you to stop seeding and drop all content shared by your device over Ouinet. This allows you to free up some storage space in your device while keeping other CENO settings like Favorites.
my: အထက်ပါ *စက်တွင်း ယာယီသိမ်းဆည်းထားသော မှတ်ဉာဏ် အရွယ်အစား* တန်ဖိုး၏ ဘေးတွင် သင့်စက်က Ouinet သုံး၍ မျှဝေထားသော အကြောင်းအရာအားလုံးကို တင်ပို့ခြင်း ရပ်ပြီး လွှတ်ချရန် ခွင့်ပြုသော ခလုတ်တစ်ခု ရှိသည်။ ယင်းသည် အနှစ်သက်ဆုံးများကဲ့သို့ အခြား CENO ဆက်တင်များကို ထိန်းသိမ်းထားစဉ် သင့်အား သင့်စက်၏ သိုလှောင်ခန်းနေရာ အချို့ကို ရှင်းလင်းခွင့်ပြုသည်။
pt_br: Ao lado do valor *Tamanho do cache local* acima, há um botão que permite interromper o semeio e descartar todo o conteúdo compartilhado pelo seu dispositivo através da Ouinet. Essa ação permite liberar algum espaço de armazenamento em seu dispositivo e, ao mesmo tempo, manter outras configurações do CENO, como Favoritos.
ru: Рядом со значением *Размер локального кэша*, описанным выше, находится кнопка, позволяющая остановить раздачу и сбросить все содержимое, передаваемое вашим устройством через Ouinet. Это позволит вам освободить место в памяти вашего устройства, сохранив при этом другие настройки CENO, такие как Избранное.
tr: Yukarıdaki *Yerel ön bellek boyutunun* yanında aygıtınızın Ouinet üzerinden gönderdiği tüm içeriklerin paylaşımını durdurup aygıtınızdan silinmesini sağlayan bir düğme bulunur. Yer imleri gibi CENO ayarlarını silmeden aygıtınızda boş alan açmanızı sağlar.
uk: Поруч зі значенням *Розмір локального кешу*, описаним вище, розташована кнопка, що дозволяє зупинити роздачу та скинути весь вміст, що передається Вашим пристроєм через Ouinet. Це дозволить Вам звільнити місце в памʼяті пристрою, залишивши при цьому інші налаштування CENO, зокрема Вибране.
