Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/settings.po
Languages: ar, de, es, fa, fr, id, my, pt_br, ru, tr, uk

source: If you want to clear CENO's normal browsing cache (the one used by the browser but not shared with others) or other items like cookies, browsing history or favorites, you should choose *Settings* in the app's main menu, then *Clear private data*. You will be asked about which items you want to clear.
my: သင်သည် CENO ၏ ပုံမှန် ရှာဖွေခြင်းဆိုင်ရာ ယာယီသိမ်းဆည်းထားသော မှတ်ဉာဏ် (ဘရောက်ဇာက အသုံးပြုသော်လည်း အများနှင့် မမျှဝေထားသော မှတ်ဉာဏ်) သို့မဟုတ် ကွတ်ကီးများ၊ ရှာဖွေမှုမှတ်တမ်း သို့မဟုတ် အနှစ်သက်ဆုံးများကဲ့သို့ အခြားအရာဝတ္ထုများကို ရှင်းလင်းလိုပါက သင်သည် အက်ပ်၏ အဓိက မီနူးရှိ *ဆက်တင်များ* ကို ရွေးချယ်ပြီးနောက် *သီးသန့်ဒေတာကို ရှင်းလင်းရန်* ကို ရွေးချယ်သင့်သည်။ မည်သည့် အရာဝတ္ထုများကို သင်ရှင်းလင်းလိုကြောင်း သင့်အား မေးပါမည်။
pt_br: Se deseja limpar o cache de navegação normal do CENO (aquele usado pelo navegador, mas não compartilhado com outras pessoas) ou outros itens como cookies, histórico de navegação ou favoritos, você deve escolher *Configurações* no menu principal do aplicativo, em seguida *Limpar dados privados*. Será perguntado a você quais itens deseja limpar.
ru: Если вы хотите очистить обычный кэш браузера CENO (тот, который используется браузером, но не передается другим пользователям) или другие элементы, такие как cookies, история просмотров или избранное, вам следует выбрать *Настройки* в главном меню приложения, затем *Очистить личные данные*. Вам будет предложено указать, какие элементы вы хотите очистить.
tr: CENO normal gezinme ön belleğini (tarayıcı tarafından kullanılıp diğerleri ile paylaşılmayan) ya da çerezler, gezinme geçmişi ve sık kullanılanlar gibi diğer ögeleri temizlemek istiyorsanız, uygulama ana menüsündeki *Ayarlar* bölümüne giderek *Kişisel verileri temizle* üzerine dokunun. Hangi ögeleri silmek istediğinizi soran bir pencere açılır.
uk: Якщо Ви хочете очистити звичайний кеш браузера CENO (той, що використовується браузером, але не передається іншим користувачам) або інші елементи, зокрема куки, історію переглядів або Обране, Вам слід обрати *Налаштування* в головному меню програми, потім *Очистити особисті дані*. Вам буде запропоновано зазначити, які саме елементи Ви хочете очистити.

source: To drop everything at the same time (especially if you are in a hurry), please learn how to use the "panic button" feature described in [Installing CENO](install.md).
fa: برای وانهادن همه‌چیز در آن واحد (به‌ویژه اگر عجله دارید)، لطفاً بیاموزید که چگونه از گزینه‌ی «دکمه‌ی هراس» استفاده کنید، که در راهنمای [نصب سنو](install.md) توصیف شده است.
my: (အထူးသဖြင့် သင် အလျင်လိုနေပါက) အရာအားလုံးကို တစ်ချိန်တည်းတွင် လွှတ်ချရန် ကျေးဇူးပြု၍ [CENO ထည့်သွင်းခြင်း](install.md) တွင် ဖော်ပြထားသော "စိုးရိမ်မှုခလုတ်" လုပ်ဆောင်ချက်ကို အသုံးပြုပုံ လေ့လာပါ။
pt_br: Para descartar tudo ao mesmo tempo (especialmente se você está com pressa), por favor aprenda como usar o "botão de pânico", funcionalidade descrita em [Instalando o CENO](install.md).
ru: Чтобы сбросить все данные сразу (особенно если вы торопитесь), узнайте, как использовать функцию "тревожной кнопки", описанную в разделе [Установка CENO](install.md).
tr: Tek seferde her şeyi silmek için (aceleniz olduğunda), [CENO kurmak](install.md) bölümünde açıklanan "panik düğmesi" özelliğinin nasıl kullanıldığını öğrenin.
uk: Щоб скинути всі дані відразу (особливо якщо Ви поспішайте), дізнайтеся, як використовувати функцію «тривожної кнопки», що описано в розділі [Встановлення CENO](install.md).

source: At the bottom of the page there is an *Enable log file* check box that allows you to collect all of Ouinet's internal messages and download them to a file. This should only be used when diagnosing some problem in CENO; just follow these steps:
fa: در پایین صفحه یک چک‌باکس *فعال‌سازیِ فایل لاگ* هست که به شما اجازه می‌دهد تا تمام پیغام‌های داخلی وینت را جمع‌آوری کنید و آن‌ها را در قالب یک فایل دریافت کنید. از این فایل می‌بایست فقط هنگام عیب‌یابی و تشخیص مشکلات در سنو استفاده کرد؛ فقط از این قدم‌ها پیروی کنید:
my: စာမျက်နှာ၏ အောက်ခြေတွင် သင့်အား Ouinet ၏ စက်တွင်း မက်ဆေ့ချ်အားလုံးကို စုဆောင်းပြီး ၎င်းတို့ကို ဖိုင်တစ်ခုထဲသို့ ဒေါင်းလုဒ်လုပ်ခွင့်ပြုသည့် *စာရင်းဖိုင် ဖွင့်မည်* အကွက်တစ်ခု ရှိသည်။ ယင်းကို CENO တွင် ပြဿနာတစ်ခုခုကို အမျိုးအမည်သတ်မှတ်သည့် အချိန်တွင်သာ အသုံးပြုသင့်သည်။ အောက်ပါ အဆင့်များကိုသာ လိုက်နာပါ-
pt_br: Na parte inferior da página, há uma caixa chamada *Ativar arquivo de log* que permite coletar todas as mensagens internas da Ouinet e baixá-las para um arquivo. Essa ação deve apenas ser usada para diagnosticar de algum problema no CENO; basta seguir estas etapas:
ru: В нижней части страницы есть флажок *Включить файл журнала*, который позволяет собирать все внутренние сообщения Ouinet и загружать их в файл. Это следует использовать только при диагностике какой-либо неполадки в CENO; просто выполните следующие шаги:
tr: Sayfanın altında bulunan *Günlük tutulsun* seçeneği tüm Ouinet iç iletilerinin bir dosyaya kaydedilmesini sağlar. Yalnızca CENO sorunlarını tanılamak için kullanılmalıdır. Şu adımları izleyin:
uk: У нижній частині сторінки є прапорець *Дозволити файл журналу*, що дозволяє збирати всі внутрішні повідомлення Ouinet та завантажити їх у файл. Це слід використовувати тільки під час діагностики будь-яких несправностей CENO; просто виконайте наступні кроки:

source: At the *CENO Settings* page, check *Enable log file*.
fa: در صفحه‌ی *تنظیمات سنو*، گزینه‌ی *فعال‌سازیِ فایلِ لاگ* را چک کنید.
my: *CENO ဆက်တင်များ* စာမျက်နှာတွင် *စာရင်းဖိုင် ဖွင့်မည်* ကို အမှန်ခြစ်ပါ။
pt_br: Na página *Configurações do CENO*, marque *Ativar arquivo de log*.
ru: На странице *Настройки CENO* отметьте *Включить файл журнала*.
tr: *CENO ayarları* bölümüne giderek *Günlük tutulsun* seçeneğini işaretleyin.
uk: На сторінці *Налаштування CENO* позначте *Дозволити файл журналу*.

source: Return to the *CENO Settings* page and click on the *Download* link next to the *Enable log file* check box. Save the file for later use. Android may ask you at this point whether to allow CENO access to stored media: this is needed to be able to save the file.
fa: به صفحه‌ی *تنظیماتِ سنو* بازگردید و روی لینک *دانلود* در کنار چک‌باکس *فعال‌سازیِ فایلِ لاگ* کلیک کنید. فایل را برای استفاده‌ی بعدی ذخیره کنید. اندروید ممکن است از شما بپرسد که آیا در این مقطع به سنو اجازه‌ی دسترسی به رسانه‌های ذخیره‌شده را می‌دهید: این جواز برای ذخیره‌کردن آن فایل لازم است.
my: *CENO ဆက်တင်များ* စာမျက်နှာသို့ ပြန်သွားပြီး *စာရင်းဖိုင်ဖွင့်မည်* အကွက်ဘေးရှိ *ဒေါင်းလုဒ်လုပ်ရန်* လင့်ကို နှိပ်ပါ။ နောက်ပိုင်းတွင် အသုံးပြုရန်အတွက် ဖိုင်ကို သိမ်းဆည်းပါ။ ဤနေရာတွင် Android သည် သိုလှောင်ထားသော မီဒီယာသို့ CENO အား ဝင်ရောက်သုံးစွဲခွင့် ပြု၊ မပြုကိုသင့်အား မေးနိုင်သည်- ဖိုင်ကို သိမ်းဆည်းနိုင်ရန် ၎င်းကို လိုအပ်ပါသည်။
pt_br: Retorne à página *Configurações do CENO* e clique no link de *Baixar* ao lado da caixa de seleção *Ativar arquivo de log*. Salve o arquivo para uso posterior. A esta altura, o Android pode perguntar se você deseja permitir o acesso do CENO à mídia armazenada: isso é necessário para que ele seja capaz de salvar o arquivo.
ru: Вернитесь на страницу *Настройки CENO* и нажмите на ссылку *Скачать* рядом с флажком *Включить файл журнала*. Сохраните файл для последующего использования. На этом этапе Android может спросить вас, разрешить ли CENO доступ к файловой системе: это необходимо для сохранения файла.
tr: Yeniden *CENO ayarları* bölümüne gidin ve *Günlük tutulsun* seçeneğinin yanındaki *İndir* üzerine dokunup dosyayı kaydedin. Android üzerinde CENO için dosya erişim izni istenebilir, bu izin dosyayı kaydetmek için gereklidir.
uk: Поверніться на сторінку *Налаштування CENO* та натисніть посилання *Завантажити* поруч із прапорцем *Дозволити файл журналу*. Збережіть файл для подальшого використання. На цьому етапі Android може запитати, чи дозволити CENO доступ до файлової системи: це необхідно для збереження файлу.

source: **Warning:** Please note that CENO does not remember these settings upon restarting the app. If you require some of the previous mechanisms to be off while using CENO, please remember to open the Settings page whenever you start the app and uncheck their boxes before browsing. We apologize for the inconvenience.
my: **သတိပေးချက်-** အက်ပ်ကို ပြန်လည်စတင်ပြီးနောက် CENO သည် ဤဆက်တင်များကို မမှတ်မိနိုင်သေးကြောင်း ကျေးဇူးပြု၍ သတိပြုပါ။ သင်သည် CENO ကို အသုံးပြုနေစဉ် ယခင် စက်ကိရိယာအချို့ကို ပိတ်ထားရန် လိုအပ်ပါက သင် အက်ပ်ကို စတင်သည့်အချိန်တိုင်း ဆက်တင်များ စာမျက်နှာကို ဖွင့်ရန်နှင့် မရှာဖွေမီ ၎င်းတို့၏ အကွက်များကို အမှန်ခြစ်ဖြုတ်ရန် ကျေးဇူးပြု၍ သတိရပါ။ အဆင်မပြေမှုအတွက် တောင်းပန်ပါသည်။

source: *CENO Browser* indicates the exact version of CENO that you are using. Please include this information in your issue reports.
fa: **مرورگر سنو** نسخه‌ی دقیق سنو را نشان می‌دهد که شما از آن استفاده می‌کنید. لطفاً این اطلاعات را در گزارش‌های مشکلات و مسايل بگنجانید.
my: *CENO ဘရောက်ဇာ* သည် သင်အသုံးပြုနေသော CENO ဗားရှင်း အတိအကျကို ညွှန်ပြသည်။ ကျေးဇူးပြု၍ ဤအချက်အလက်ကို သင်၏ ပြဿနာ အစီရင်ခံစာများတွင် ထည့်ပါ။

source: *Local UDP endpoints* are the Internet addresses used by CENO to seed signed content to other clients. These are shown to help test and debug the app, and should not be generally disclosed.
my: *စက်တွင်း UDP အဆုံးမှတ်များ* သည် CENO က အခြားလက်ခံစက်များထံ လက်မှတ်ထိုးထားသော အကြောင်းအရာကို တင်ပို့ရန် အသုံးပြုသော အင်တာနက် လိပ်စာများ ဖြစ်သည်။ အက်ပ်ကို ကူညီစမ်းသပ်ရန်နှင့် ချွတ်ယွင်းချက် ပြုပြင်ရန်အတွက် ၎င်းတို့ကို ပြသထားပြီး ယေဘုယျအားဖြင့် မထုတ်ဖော်သင့်ပါ။
