Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/settings.po
Languages: ar, de, es, fa, fr, id, my, pt_br, ru, tr, uk

source: *Via the Ceno network (public)* (or **injector access**) enables Ceno to strip any private information from requests and send them to an injector. The injector gets the content from an origin server, signs it, and sends it back to Ceno - which then begins seeding it.
ar: *عبر شبكة Ceno (العامة)* (أو **الوصول عبر حاقن**) تمكن Ceno من تجريد أي معلومات خاصة من الطلبات وإرسالها إلى حاقن. يحصل الحاقن على المحتوى من خادم أصلي، ويوقع عليه، ويرسله مرة أخرى إلى Ceno - والذي يبدأ بعد ذلك في نشره.
de: *Über das Ceno-Netz (öffentlich)* (oder **injector access**) kann Ceno alle privaten Informationen aus den Anfragen entfernen und sie an einen injector senden. Der Injektor holt die Inhalte von einem Ursprungsserver, signiert sie und sendet sie zurück an Ceno, das dann mit dem Seeding beginnt.
es: *A través de la red Ceno (pública)* (o **acceso por inyector**) permite a Ceno quitar cualquier información privada de las solicitudes y enviarlas a un inyector. El inyector obtiene el contenido desde un servidor de origen, lo firma y lo envia de vuelta a Ceno, el cual empezará a sembrarlo.
fr: *Par le réseau Ceno (public)* (ou **accès par injecteur**) permet à Ceno de retirer toute information privée des demandes et de les envoyer à un injecteur. L’injecteur obtient le contenu d’un serveur d’origine, le signe et le renvoie à Ceno, qui par la suite commence à le propager.
id: *Melalui jaringan Ceno (publik)* (atau **akses injektor**) memungkinkan Ceno untuk menghapus informasi pribadi apa pun dari permintaan dan mengirimkannya ke injektor. Injektor mendapatkan konten dari server asal, menandatanganinya, dan mengirimkannya kembali ke Ceno - yang kemudian mulai menyebarkannya.

source: Other participants (such as bridges) will not see the unencrypted traffic.
ar: لن يرى المشاركون الآخرون (مثل الجسور) حركة البيانات غير المشفرة.
de: Andere Teilnehmer (z. B. Brücken) sehen den unverschlüsselten Verkehr nicht.
es: Otra(o)s participantes (como los puentes) no verán el tráfico no cifrado.
fr: Les autres participants (tels que les ponts) ne verront pas le trafic non chiffré.
id: Partisipan lain (seperti jembatan) tidak akan melihat lalu lintas yang tidak terenkripsi.
my: ပေါင်းကူးများကဲ့သို့ အခြားပါဝင်ဆောင်ရွက်သူများသည် ကုဒ်ဖြေထားသော အသွားအလာကို မြင်ရမည် မဟုတ်ပါ။
pt_br: Outros participantes (tais como pontes) não verão o tráfego não criptografado.
ru: Другие участники (например, мосты) не увидят незашифрованный трафик.
tr: Diğer katılımcılar (köprüler gibi) şifrelenmemiş trafiği görmez.
uk: Інші учасники (що є мостами) не побачать незашифрований трафік.

source: This mechanism only works in public browsing mode.
ar: هذه الآلية تعمل فقط في وضع التصفح العام.
de: Dieser Mechanismus funktioniert nur im öffentlichen Browsing-Modus.
es: Este mecanismo solamente funciona en el modo de navegación público.
fa: این سازوکار فقط در حالت مرور عمومی کار می‌کند.
fr: Ce mécanisme ne fonctionne qu’en mode de navigation publique.
id: Mekanisme ini hanya berfungsi di dalam mode penjelajahan publik.
my: ဤစက်ကိရိယာသည် သီးသန့် ရှာဖွေမှုမုဒ်တွင်သာ အလုပ်လုပ်သည်။
pt_br: Esse mecanismo somente funciona no modo de navegação pública.
ru: Эта схема работает только в режиме публичного просмотра.
tr: Bu yöntem yalnızca herkese açık gezinme kipinde çalışır.
uk: Ця схема працює лише в режимі публічного перегляду.

source: *Shared by other Ceno users* allows Ceno to try to retrieve content from the **distributed cache**, i.e. from other Ceno and Ouinet clients seeding it.
ar: *تمت مشاركته من قبل مستخدمي Ceno الآخرين* يسمح لـ Ceno بمحاولة استرداد المحتوى من **ذاكرة التخزين المؤقت الموزعة**، أي من عملاء Ceno و Ouinet الآخرين الذين يقومون بتوزيعه.
de: Mit der Option *Gemeinsam mit anderen Ceno-Benutzern* kann Ceno versuchen, Inhalte aus dem **verteilten Cache** abzurufen, d. h. von anderen Ceno- und Ouinet-Clients, die diese Inhalte bereitstellen.
es: *Compartido por otra(o)s usuaria(o)s de Ceno* le permite a Ceno intentar descargar contenido desde la **caché distribuída**, esto es desde otros clientes de Ceno y Ouinet sembrándolo.
fr: *Partagé par d’autres utilisateurs de Ceno* permet à Ceno d’essayer de récupérer le contenu du **cache distribué**, c.-à-d. d’autres clients Ceno et Ouinet qui le propage.
id: *Dibagikan oleh pengguna Ceno lainnya* memungkinkan Ceno untuk mencoba mengambil konten dari **tembolok terdistribusi**, yaitu dari klien Ceno dan Ouinet lain yang menyebarkannya.

source: Disabling all of the mechanisms available for either public or private browsing mode will render them useless. If you establish such a configuration, a warning will be shown as depicted below:
ar: سيؤدي تعطيل جميع الآليات المتاحة لوضع التصفح العام أو الخاص إلى جعلها عديمة الفائدة. إذا قمت بمثل هذا التهيئة، فسيتم عرض تحذير كما هو موضح أدناه:
es: Deshabilitar todos los mecanismos disponibles tanto para modo de navegación pública como privada les tornará inútiles. Si estableces tal configuración, una advertencia se mostrará como se ilustra abajo:
fr: La désactivation de tous les mécanismes proposés pour le mode de navigation publique ou privée les rendra inutiles. Si vous définissez une telle configuration, un avertissement s’affichera comme illustré ci-dessous :
id: Menonaktifkan semua mekanisme yang tersedia untuk mode penelusuran publik atau privat akan membuatnya tidak berguna. Jika Anda membuat konfigurasi seperti itu, peringatan akan ditampilkan seperti yang digambarkan di bawah ini:
my: အများသုံး သို့မဟုတ် သီးသန့် ရှာဖွေမှုမုဒ်အတွက် ရရှိနိုင်သော စက်ကိရိယာအားလုံးကို ပိတ်ခြင်းသည် ၎င်းတို့ကို အသုံးမဝင် ဖြစ်စေလိမ့်မည်။ သင်သည် ထိုစီစဉ်သတ်မှတ်မှုကို တည်ဆောက်ပါက အောက်တွင် ဖော်ပြထားသည့်အတိုင်း သတိပေးချက်ကို ပြသပါမည်။
pt_br: Desabilitar todos os mecanismos disponíveis tanto para o modo de navegação pública quanto para o privativo irá torná-los inúteis. Se você estabelecer tais configurações, um aviso será exibido como ilustrado abaixo:
ru: Отключение всех схем, доступных для публичного или приватного режима просмотра, сделает их бесполезными. Если вы создадите такую конфигурацию, будет показано предупреждение, как показано ниже:
tr: Herkese açık ya da gizli gezinme kipleri için tüm yöntemleri kapatmak bunları yararsız yapar. Böyle bir yapılandırma uygularsanız aşağıdaki gibi bir uyarı görüntülenir:
uk: Відключення всіх схем, доступних для публічного або приватного перегляду, зробить їх некорисними. Якщо Ви створите таку конфігурацію, буде показано попередження, як це зазначено нижче:

source: ![Figure: Invalid settings for private browsing](images/settings-no-private.png)
ar: ![الشكل: إعدادات غير صالحة للتصفح الخاص](images/settings-no-private.png)
de: ![Abbildung: Ungültige Einstellungen für privates Surfen](images/settings-no-private.png)
es: ![Figura: Configuración inválida para navegación privada](images/settings-no-private.png)
fa: ![شکل: تنظیمات نامعتبر برای مرور خصوصی](images/settings-no-private.png)
fr: ![Figure: Paramètres de navigation privée invalides](images/settings-no-private.png)
id: ![Gambar: Setelan tidak valid untuk penjelajahan privat](images/settings-no-private.png)
my: ![ပုံ - သီးသန့် ရှာဖွေမှုအတွက် မမှန်ကန်သော ဆက်တင်များ](images/settings-no-private.png)
pt_br: ![Figura: Configurações inválidas para navegação privativa](images/settings-no-private.png)
ru: ![Рисунок: Неверные настройки для приватного просмотра](images/settings-no-private.png)
tr: ![Görsel: Gizli gezinme için geçersiz ayarlar](images/settings-no-private.png)
uk: ![Малюнок: Неправильні налаштування для приватного перегляду](images/settings-no-private.png)

source: About your app
ar: حول تطبيقك
de: Über Ihre App
es: Acerca de tu app
fa: درباره‌ی نرم‌افزار شما
fr: À propos de votre appli
id: Tentang aplikasi Anda
my: သင်၏ အက်ပ်အကြောင်း
pt_br: Sobre seu aplicativo
ru: О вашем приложении
tr: Uygulamanız hakkında
uk: Про Вашу програму

source: This page also provides you with some information about your Ceno Browser app and Ouinet client:
ar: توفر لك هذه الصفحة أيضًا بعض المعلومات حول تطبيقك متصفح Ceno وعميل Ouinet:
de: Auf dieser Seite finden Sie auch einige Informationen über Ihre Ceno-Browser-App und Ihren Ouinet-Client:
es: Esta página también te provee con alguna información acerca de tu aplicación de Ceno Browser y el cliente Ouinet:
fr: Cette page vous donne aussi des renseignements sur votre appli Navigateur Ceno et votre client Ouinet :
id: Halaman ini juga memberikan beberapa informasi tentang aplikasi Peramban Ceno dan klien Ouinet Anda:

source: *Local cache size* shows an approximation of how much storage is taken by the content being seeded from your device's local cache.
ar: يُظهر *حجم ذاكرة التخزين المؤقت المحلية* تقديرًا تقريبيًا لمقدار التخزين الذي يتم الحصول عليه بواسطة المحتوى الذي يتم توزيعه من ذاكرة التخزين المؤقت المحلية لجهازك.
de: Die *Lokale Cache-Größe* zeigt an, wie viel Speicherplatz der Inhalt, der aus dem lokalen Cache Ihres Geräts geladen wird, ungefähr einnimmt.
es: *Tamaño de la caché local* muestra una aproximación de cuánto almacenamiento es ocupado por el contenido que está siendo sembrado desde la caché local de tu dispositivo.
fa: *سایز انبار محلی* تقریبی از حجم اشغال‌شده توسط محتوایی را نشان می‌دهد که از انبار محلی دستگاه‌تان بذرپاشی می‌شود.
fr: *Taille du cache local* indique approximativement la quantité d’espace de stockage occupé par le contenu propagé à partir du cache local de votre appareil.
id: *Ukuran tembolok lokal* menunjukkan perkiraan berapa banyak penyimpanan yang diambil oleh konten yang diunggulkan dari tembolok lokal perangkat Anda.
my: *စက်တွင်း ယာယီသိမ်းဆည်းထားသော မှတ်ဉာဏ် အရွယ်အစား* သည် သင့်စက်၏ စက်တွင်း ယာယီသိမ်းဆည်းထားသော မှတ်ဉာဏ်မှ တင်ပို့နေသော အကြောင်းအရာက သိုလှောင်မှုမည်မျှကို နေရာယူကြောင်း မှန်းခြေကို ပြသသည်။
pt_br: *Tamanho de cache local* exibe uma aproximação do quanto de armazenamento é ocupado pelo conteúdo sendo semeado a partir do cache local do seu dispositivo.
ru: *Размер локального кэша* показывает приблизительный объем памяти, занимаемый содержимым, загружаемым из локального кэша вашего устройства.
tr: *Yerel ön bellek boyutu* aygıtınızın yerel ön belleğinden içeriklerin gönderilmesi için kullanılan yaklaşık depolama alanını gösterir.
uk: *Розмір локального кешу* показує приблизний обсяг памʼяті вмісту, що завантажується з локального кешу Вашого пристрою.

source: *Content shared by you* allows you to check the content being announced by your device.
ar: *المحتوى الذي تشاركه* يسمح لك بالتحقق من المحتوى الذي يعلن عنه جهازك.
de: Mit *von Ihnen freigegebene Inhalte* können Sie die Inhalte überprüfen, die von Ihrem Gerät angekündigt werden.
es: *Contenido compartido por tí* te permite comprobar el contenido que está siendo anunciado por tu dispositivo.
fr: *Contenu partagé par vous* vous permet de vérifier le contenu annoncé par votre appareil.
id: *Konten yang Anda bagikan* memungkinkan Anda memeriksa konten yang diumumkan oleh perangkat Anda.
my: * သင်မျှဝေထားသောအကြောင်းအရာ* သည် သင့်စက်မှကြေငြာထားသော အကြောင်းအရာများကို စစ်ဆေးခွင့်ပြုသည်။
pt_br: *Conteúdo compartilhado por você* permite que você verifique o conteúdo sendo anunciado pelo seu dispositivo.
ru: *Контент, предоставленный вами* позволяет проверить содержимое, которое раздает ваше устройство.
tr: *Paylaştığınız içerik* aygıtınızdan ağa dağıtılan içerikleri görmenizi sağlar.
uk: *Наданий Вами вміст* дозволяє перевірити вміст, який роздає Ваш пристрій.

source: *Ouinet client state*, if `started`, means that your Ouinet client was able to run successfully. Otherwise, there may be connectivity issues or some internal error. Please include this information in your issue reports.
ar: *حالة عميل Ouinet*، إذا كانت `بدأت`، فهذا يعني أن عميل Ouinet الخاص بك كان قادرًا على العمل بنجاح. و إلّا، قد تكون هناك مشكلات في الاتصال أو بعض الأخطاء الداخلية. يرجى تضمين هذه المعلومات في تقاريرك للمشاكل.
de: Der *Ouinet-Client-Status* bedeutet, dass Ihr Ouinet-Client erfolgreich ausgeführt werden konnte, wenn er "gestartet" ist. Andernfalls kann es zu Verbindungsproblemen oder einem internen Fehler kommen. Bitte geben Sie diese Informationen in Ihren Fehlerberichten an.
es: *Estado del cliente Ouinet*, si es `started`, significa que tu cliente Ouinet pudo ejecutarse exitosamente. De otra manera, puede haber dificultades en la conectividad o algún error interno. Por favor incluye esta información en tus informes de problemas.
fr: Si l’*État du client Ouinet* est `démarré`, votre client Ouinet a réussi à s’exécuter. Sinon, il pourrait y avoir quelques problèmes de connectivité ou une erreur interne. Veuillez inclure ces renseignements dans vos relevés de problème.
id: *Status klien Ouinet*, jika `dimulai`, berarti klien Ouinet Anda berhasil dijalankan. Jika tidak, mungkin ada masalah konektivitas atau kesalahan internal. Harap sertakan informasi ini dalam laporan masalah Anda.
pt_br: *Estado do cliente Ouinet*, se `iniciado`, significa que o seu cliente Ouinet conseguiu ser executado com sucesso. De outro modo, pode haver problemas de conectividade ou algum erro interno. Por favor, inclua essa informação em seus relatórios de problemas.
ru: Если *Состояние клиента Ouinet* показывает `started`, значит ваш клиент Ouinet успешно запустился. Что-либо иное может означать проблемы с соединением или ошибку в клиенте. Пожалуйста, включайте эту информацию в отчёты об ошибках.
tr: Ouinet istemciniz sorunsuz olarak çalışıyorsa *Ouinet istemci durumu* bölümünde `başlatıldı`görüntülenir. Diğer durumlarda bağlantı veya yazılım kaynaklı sorunlar olabilir. Lütfen sorun bildirirken bu bilgileri de ekleyin.
uk: *Стан клієнта Ouinet* «запущений» означає, що Ваш клієнт Ouinet зміг успішно запуститися. Інакше можуть виникнути проблеми зі зʼєднанням або якась внутрішня помилка. Будь ласка, включіть цю інформацію у звіт про вашу помилку.

source: *Reachability status* indicates how likely it is for your device to be able to effectively seed content to other clients. Also include in reports.
ar: *حالة إمكانية الوصول* تشير إلى مدى تمكن جهازك من نشر المحتوى بفعالية إلى عملاء آخرين. يرجى تضمين هذا أيضاً في التقارير.
de: Der *Erreichbarkeitsstatus* gibt an, wie wahrscheinlich es ist, dass Ihr Gerät effektiv Inhalte an andere Clients weiterleiten kann. Auch in Berichten enthalten.
es: *Estado de alcance* indica qué tan probable es que tu dispositivo sea capaz de sembrar contenido efectivamente para otra(o)s clientes. También inclúyelo en informes.
fa: *وضعیت دسترس‌پذیری* نشان می‌دهد که دستگاه‌تان تا چه حد می‌تواند در عمل محتوا را به سرویس‌گیرندگان دیگر بذرپاشی کند. این را نیز در گزارش‌ها بگنجانید.
fr: *État d’accessibilité* indique la probabilité que votre appareil puisse propager efficacement du contenu à d’autres clients. À inclure également dans les relevés.
id: *Status keterjangkauan* menunjukkan seberapa besar kemungkinan perangkat Anda dapat menyebarkan konten secara efektif ke klien lain. Sertakan juga dalam laporan.
my: *ရောက်ရှိနိုင်မှု အခြေအနေ* သည် သင့်စက်က အခြားလက်ခံစက်များထံ အကြောင်းအရာကို ထိရောက်စွာ တင်ပို့ရန် မည်မျှဖြစ်နိုင်ခြေရှိကြောင်း ညွှန်ပြသည်။ အစီရင်ခံစာများတွင်လည်း ထည့်ပါ။
pt_br: *Estado de acessibilidade* indica o quão provável é que o seu dispositivo consiga efetivamente semear conteúdo para outros clientes. Inclua também nos relatórios.
ru: *Состояние доступности* показывает, насколько вероятно, что ваше устройство сможет эффективно передавать контент другим клиентам. Также включается в отчеты.
tr: *Erişebilirlik durumu* aygıtınızın diğer istemcilere içerik gönderebilme yetkinliğini gösterir. Sorun bildirirken bunu da ekleyin.
uk: *Стан доступності* показує, наскільки можливо, що Ваш пристрій зможе ефективно передавати вміст іншим клієнтам. Також додавайте до звітів.

source: *UPnP status* indicates whether Ceno was able to tell your router or access point to allow incoming connections towards it. Also include in reports.
ar: تشير *حالة UPnP* إلى ما إذا كان Ceno قادرًا على إخبار جهاز التوجيه أو نقطة الوصول الخاصة بك بالسماح بالاتصالات الواردة إليه. يرجى تضمين هذا أيضا في التقارير.
de: Der *UPnP-Status* zeigt an, ob Ceno Ihrem Router oder Access Point mitteilen konnte, dass er eingehende Verbindungen zu ihm zulassen soll. Wird auch in Berichte aufgenommen.
es: *Estado UPnP* indica si Ceno fue capaz de decirle a tu enrutador o punto de acceso que permita conexiones entrantes hacia él. También inclúyelo en informes.
fr: *État de l’UPnP* indique si Ceno a pu indiquer à votre routeur ou à votre point d’accès d’autoriser les connexions entrantes vers lui. À inclure également dans les relevés.
id: *Status UPnP* menunjukkan apakah Ceno dapat memberi tahu ruter atau titik akses Anda untuk mengizinkan koneksi masuk ke sana. Sertakan juga dalam laporan.

source: *Local UDP endpoints* are the Internet addresses in your device used by Ceno to seed signed content to other clients. These are shown to help test and debug the app, and should not be generally disclosed.
ar: *نقاط نهاية UDP المحلية* هي عناوين الإنترنت في جهازك التي يستخدمها Ceno لبث المحتوى المُوَقَّع إلى عملاء آخرين. يتم عرضها للمساعدة في اختبار التطبيق وتصحيح أخطائه، ويجب عدم الكشف عنها بشكل عام.
de: *Lokale UDP-Endpunkte* sind die Internetadressen auf Ihrem Gerät, die von Ceno verwendet werden, um signierte Inhalte an andere Clients zu senden. Diese werden zum Testen und Debuggen der Anwendung angezeigt und sollten nicht allgemein offengelegt werden.
es: *Puntos de conexión UDP locales* son las direcciones de Internet en tu dispositivo usadas por Ceno para sembrar contenido firmado para otra(o)s clientes. Estos se muestran para ayudar a probar la app y eliminar errores, y generalmente no deberían ser divulgados.
fr: Les *Extrémités UDP locales* sont les adresses Internet de votre appareil utilisées par Ceno pour propager vers les autres clients du contenu signé. Elles sont affichées pour aider à tester et à déboguer l’appli et ne doivent pas être divulguées publiquement.
id: *Titik akhir UDP lokal* adalah alamat Internet di perangkat Anda yang digunakan oleh Ceno untuk menyebarkan konten yang ditandatangani ke klien lain. Ini ditampilkan untuk membantu pengujian dan awakutu aplikasi, dan tidak boleh diungkapkan secara umum.

source: *External UDP endpoints* are the Internet addresses in your router given to your Ceno traffic. Only available with UPnP-enabled routers, they are also useful for diagnostics and not to be generally disclosed.
ar: *نقاط نهاية UDP الخارجية* هي عناوين الإنترنت في جهاز التوجيه الخاص بك المعطاة لحركة مرور Ceno الخاصة بك. تتوفر فقط مع أجهزة التوجيه التي تدعم UPnP، وهي مفيدة أيضًا للتشخيص ولا يتم الكشف عنها بشكل عام.
de: *Externe UDP-Endpunkte* sind die Internetadressen in Ihrem Router, die für Ihren Ceno-Verkehr vergeben werden. Sie stehen nur bei UPnP-fähigen Routern zur Verfügung und sind auch für die Diagnose nützlich und dürfen nicht allgemein bekannt gegeben werden.
es: *Puntos de conexión UDP externos* son las direcciones de Internet en tu enrutador dadas a tu tráfico de Ceno. Disponibles únicamente en enrutadores con UPnP habilitado, también son útiles para diagnósticos y generalmente no deberían ser divulgados.
fr: Les *Extrémités UDP externes* sont les adresses Internet de votre routeur attribuées à votre trafic Ceno. Seulement proposées avec les routeurs compatibles UPnP, elles sont aussi utiles au diagnostic et ne doivent pas être divulguées publiquement.
id: *Titik akhir UDP eksternal* adalah alamat Internet di ruter yang diberikan ke lalu lintas Ceno Anda. Hanya tersedia di ruter yang mendukung UPnP, mereka juga berguna untuk mendiagnosis masalah dan tidak diungkapkan secara umum.

source: *Public UDP endpoints* are the Internet addresses that Ouinet clients outside of your network see when communicating with your device. Also for diagnostics and not to be disclosed.
ar: *نقاط نهاية UDP العامة* هي عناوين الإنترنت التي يراها عملاء Ouinet خارج شبكتك عند الاتصال بجهازك. أيضاً للتشخيص ولا يتم الكشف عنها.
de: *Öffentliche UDP-Endpunkte* sind die Internetadressen, die Ouinet-Clients außerhalb Ihres Netzwerks sehen, wenn sie mit Ihrem Gerät kommunizieren. Sie dienen ebenfalls der Diagnose und dürfen nicht weitergegeben werden.
es: *Puntos de conexión UDP públicos* son las direcciones de Internet que ven las/los clientes Ouinet fuera de tu red cuando se comunican con tu dispositivo. También para diagnósticos y no deberían ser divulgados.
fr: Les *Extrémités UDP publiques* sont les adresses Internet que les clients Ouinet extérieurs à votre réseau voient quand ils communiquent avec votre appareil. Ils sont aussi utilisés pour le diagnostic et ne doivent pas être divulgués.
id: *Titik akhir UDP publik* adalah alamat Internet yang dilihat klien Ouinet di luar jaringan Anda saat berkomunikasi dengan perangkat Anda. Juga untuk diagnosis dan tidak untuk diungkapkan.
pt_br: *Endpoints UDP públicos* são os endereços de Internet que clientes Ouinet fora da sua rede vêem quando se comunicam com o seu dispositivo. Também são úteis para diagnóstico e não deveriam ser divulgados.
ru: *Публичные конечные точки UDP* - это интернет-адреса, которые клиенты Ouinet вне вашей сети видят при коммуникации с вашем устройством. Они также нужны для диагностики, их также не следует раскрывать.
tr: *Herkese açık UDP uç noktaları* ağınız dışındaki Ouinet istemcilerinin aygıtınızla iletişim kurarken göreceği internet adresleridir. Sorun tanılamasında yararlıdır ve gizli tutulmalıdır.
uk: *Публічні кінцеві точки UDP* – це Інтернет-адреси, які клієнти Ouinet за межами Вашої мережі бачать під час спілкування з Вашим пристроєм. Також суто для діагностики та не розголошуються.
