Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/settings.po
Languages: ar, de, es, fa, fr, id, my, pt_br, ru, tr, uk

source: *Extra BitTorrent bootstraps* are servers used to help your device get into the BitTorrent network, should the default ones not work. Also include in reports. You may edit the space-separated list of hosts (with optional ports) to set or add your own, then choose *Save*. The changes will be applied the next time that your Ouinet client is started.
ar: *تمهيدات بت تورنت الإضافية* هي خوادم تستخدم لمساعدة جهازك في الوصول إلى شبكة بت تورنت، في حالة عدم عمل الخوادم الافتراضية. يرجى تضمين هذا أيضاً في التقارير. يمكنك تعديل قائمة المضيفين المفصولة بمسافات (بمنافذ اختيارية) لتعيين أو إضافة مضيفيك، ثم اختر *حفظ*. سيتم تطبيق التغييرات في المرة التالية التي تشغل فيها عميل Ouinet الخاص بك.
de: *Extra BitTorrent Bootstraps* sind Server, die Ihrem Gerät helfen, in das BitTorrent-Netzwerk zu gelangen, falls die Standard-Bootstraps nicht funktionieren. Auch in Berichten enthalten. Sie können die durch Leerzeichen getrennte Liste der Hosts (mit optionalen Ports) bearbeiten oder Ihre eigenen hinzufügen und dann *Speichern* wählen. Die Änderungen werden beim nächsten Start Ihres Ouinet-Clients übernommen.
es: *Servidores extra de arranque de BitTorrent* son aquéllos que ayudarán a tu dispositivo a conectarse a la red BitTorrent, si los servidores por defecto no funcionan. También inclúyelos en informes. Puedes editar la lista de anfitriones separados por espacios (con puertos opcionales) o añadir los tuyos propios, a continuación elige *Guardar*. Los cambios se aplicarán la próxima vez cuando tu cliente Ouinet sea iniciado.
fr: Les *amorces BitTorrent supplémentaires* sont des serveurs utilisés pour aider votre appareil à accéder au réseau BitTorrent, au cas où les serveurs par défaut ne fonctionneraient pas. À inclure également dans les relevés. Vous pouvez modifier la liste d’hôtes séparés par des espaces (facultativement avec des ports) pour définir ou ajouter les vôtres, puis sélectionnez *Enregistrer*. Les changements seront appliqués lors du prochain démarrage de votre client Ouinet.
id: *Bootstrap BitTorrent ekstra* adalah server yang digunakan untuk membantu perangkat Anda masuk ke jaringan BitTorrent, jika yang tersedia tidak berfungsi. Sertakan juga dalam laporan. Anda dapat mengedit daftar host yang dipisahkan oleh spasi (dengan porta opsional) untuk mengatur atau menambahkan milik Anda sendiri, lalu pilih *Simpan*. Perubahan akan diterapkan saat klien Ouinet Anda dimulai lagi.
pt_br: *Bootstraps extra do BitTorrent* são servidores usados para ajudar o seu dispositivo a entrar na rede BitTorrent, caso os servidores padrão não funcionem. Também incluir nos relatórios. Você pode editar o a lista de hosts separada por espaços (com portas opcionais) para configurar ou adicionar o seu próprio host e depois escolher *Salvar*. As mudanças serão aplicadas na próxima vez em que o seu cliente Ouinet for inicializado.
ru: *Дополнительные загрузчики BitTorrent* — это серверы, которые помогают вашему устройству подключиться к сети BitTorrent, если стандартные серверы не работают. Также включаются в отчеты. Вы можете отредактировать разделенный пробелами список хостов (с необязательными портами), чтобы установить или добавить собственный, а затем нажмите *Сохранить*. Изменения будут применены при следующем запуске вашего клиента Ouinet.
tr: *Ek BitTorrent ön yükleyicileri* aygıtınız varsayılan ön yükleyiciler ile BitTorrent ağına giremediği zaman kullanılan sunuculardır. Sorun bildirirken bunu da ekleyin. Boşluk ile ayrılmış etki alanı listesini (ek bağlantı noktaları ile) düzenleyebilir ve ardından *Kaydet* ile kaydedebilirsiniz. Değişiklikler Ouinet istemcinizin bir sonraki çalıştırılmasında uygulanır.
uk: *Додаткові завантажувальні сервери BitTorrent* — це сервери, які допомагають вашому пристрою підключитися до мережі BitTorrent, якщо стандартні не працюють. Також додаються до звітів. Ви можете відредагувати розділений пробілами список хостів (з додатковими портами), аби встановити чи додати свій власний, а потім виберіть *Зберегти*. Зміни будуть застосовані під час наступного запуску клієнта Ouinet.

source: *Ceno Browser* indicates the exact version of Ceno that you are using. Also include in reports.
ar: يشير *متصفح Ceno* إلى إصدار Ceno الذي تستخدمه بالضبط. يرجى تضمين هذا أيضا في التقارير.
de: *Ceno Browser* gibt die genaue Version von Ceno an, die Sie verwenden. Wird auch in Berichte aufgenommen.
es: *Ceno Browser* indica la versión exacta de Ceno que estás usando. También inclúyela en los informes.
fr: *Navigateur Ceno* indique la version exacte de Ceno que vous utilisez. À inclure également dans les relevés.
id: *Peramban Ceno* menunjukkan versi Ceno yang Anda gunakan. Sertakan juga dalam laporan.

source: *Ceno Extension* shows the version of the extension that integrates Firefox with Ceno. Also include in reports.
ar: يُظهر *امتداد Ceno* إصدار الامتداد الذي يدمج فايرفكس مع Ceno. يرجى تضمين هذا أيضاً في التقارير.
de: *Ceno Extension* zeigt die Version der Erweiterung an, die Firefox mit Ceno integriert. Auch in Berichten enthalten.
es: *Extensión Ceno* muestra la versión de la extensión que integra Firefox con Ceno. También inclúyela en los informes.
fr: *Extension Ceno* indique la version de l’extension qui intègre Firefox à Ceno. À inclure également dans les relevés.
id: *Ekstensi Ceno* menampilkan versi ekstensi yang mengintegrasikan Firefox dengan Ceno. Sertakan juga dalam laporan.

source: *Ouinet* shows the version of Ouinet backing Ceno. Also include in reports.
ar: يُظهر *Ouinet* يظهر إصدار Ouinet الداعم لـ Ceno. يرجى تضمين هذا أيضاً في التقارير.
de: *Ouinet* zeigt die Version von Ouinet, die Ceno unterstützt. Auch in Berichten enthalten.
es: *Ouinet* muestra la versión de Ouinet detrás de Ceno. También inclúyela en los informes.
fr: *Ouinet* indique la version de Ouinet qui soutient Ceno. À inclure également dans les relevés.
id: *Ouinet* menampilkan versi Ouinet yang mendukung Ceno. Sertakan juga dalam laporan.

source: *Ouinet protocol* is the version number of the protocol that Ceno uses to talk to other Ouinet clients and injectors. Also include in reports.
ar: *بروتوكول Ouinet* هو رقم إصدار البروتوكول الذي يستخدمه Ceno للتواصل مع عملاء وحاقنات Ouinet الآخرين. يرجى تضمين هذا أيضاً في التقارير.
de: *Ouinet-Protokoll* ist die Versionsnummer des Protokolls, das Ceno für die Kommunikation mit anderen Ouinet-Clients und -Injektoren verwendet. Wird auch in Berichte aufgenommen.
es: *Protocolo Ouinet* es el número de versión del protocolo que usa Ceno para hablar con otros clientes Ouinet e inyectores. También inclúyela en los informes.
fr: *Protocole Ouinet* est le numéro de version du protocole que Ceno utilise pour communiquer avec les autres clients et injecteurs Ouinet. À inclure également dans les relevés.
id: *Protokol Ouinet* adalah nomor versi protokol yang digunakan Ceno untuk berkomunikasi dengan klien dan injektor Ouinet lainnya. Sertakan juga dalam laporan.

source: Purging the local cache
ar: تطهير ذاكرة التخزين المؤقت المحلية
de: Leeren des lokalen Caches
es: Purgando la caché local
fa: پالودنِ انبار محلی
fr: Purger le cache local
id: Membersihkan tembolok lokal
my: စက်တွင်း ယာယီသိမ်းဆည်းထားသော မှတ်ဉာဏ်ကို ထုတ်ပယ်ခြင်း
pt_br: Limpando o cache local
ru: Очистка локального кэша
tr: Yerel ön belleği temizlemek
uk: Очищення локального кешу

source: Next to the *Local cache size* value above, there is a button which allows you to stop seeding and drop all content shared by your device over Ouinet. This allows you to free up some storage space in your device while keeping other Ceno settings like Favorites.
ar: بجانب القيمة *حجم ذاكرة التخزين المؤقت المحلية* أعلاه، يوجد زر يسمح لك بإيقاف التوزيع والتخلي عن أي محتوى يشاركه جهازك عبر Ouinet. يسمح لك ذلك بتحرير بعض مساحة التخزين في جهازك مع الاحتفاظ بإعدادات Ceno الأخرى مثل المفضلات.
de: Neben dem obigen Wert *Lokale Cachegröße* befindet sich eine Schaltfläche, mit der Sie das Seeding beenden und alle von Ihrem Gerät über Ouinet freigegebenen Inhalte löschen können. Auf diese Weise können Sie Speicherplatz auf Ihrem Gerät freigeben und gleichzeitig andere Ceno-Einstellungen wie Favoriten beibehalten.
es: Al lado del valor de arriba *Tamaño de la caché local*, hay un botón que te permite detener el sembrado y descartar todo el contenido compartido por tu dispositivo a través de Ouinet. Esto te permite liberar algo del espacio de almacenamiento en tu dispositivo, mientras que mantienes otras configuraciones Ceno como los Favoritos.
fr: À côté de la valeur *Taille du cache local* ci-dessus se trouve un bouton qui vous permet d’arrêter la propagation et d’abandonner tout contenu partagé par votre appareil sur Ouinet. Cela vous permet de libérer de la mémoire sur votre appareil tout en conservant d’autres paramètres de Ceno tels que les Favoris.
id: Di samping angka *Ukuran tembolok lokal* di atas, terdapat tombol yang memungkinkan Anda untuk menghentikan penyebaran dan melepaskan semua konten yang dibagikan oleh perangkat Anda melalui Ouinet. Ini memungkinkan Anda untuk mengosongkan sebagian ruang penyimpanan di perangkat Anda sambil menyimpan pengaturan Ceno lainnya seperti Favorit.

source: If you want to clear Ceno's normal browsing cache (the one used by the browser but not shared with others) or other items like cookies, browsing history or favorites, you should choose *Settings* in the app's main menu, then *Clear private data*. You will be asked about which items you want to clear.
ar: إذا كنت ترغب في مسح ذاكرة التخزين المؤقت للتصفح العادي لـ Ceno (تلك التي يستخدمها المتصفح ولا تتم مشاركتها مع الآخرين) أو عناصر أخرى مثل ملفات تعريف الارتباط أو سجل التاريخ أو المفضلات، فيجب عليك اختيار *الإعدادات* في القائمة الرئيسية للتطبيق، ثم *مسح البيانات الخاصة*. سيتم سؤالك عن أي عناصر تريد مسحها.
de: Wenn Sie den normalen Browser-Cache von Ceno (der vom Browser verwendet, aber nicht mit anderen geteilt wird) oder andere Elemente wie Cookies, den Browserverlauf oder die Favoriten löschen möchten, sollten Sie im Hauptmenü der App *Einstellungen* und dann *Private Daten löschen* wählen. Sie werden dann gefragt, welche Daten Sie löschen möchten.
es: Si quieres limpiar la caché de navegación normal de Ceno (la usada por el navegador pero no compartida con otra(o)s) u otros ítems como cookies, el historial de navegación o los favoritos, deberías elegir *Configuración* en el menú principal de la app, luego *Limpiar datos privados*. Se te preguntará acerca de qué ítems deseas limpiar.
fr: Si vous souhaitez effacer le cache normal de navigation de Ceno (celui utilisé par le navigateur, non partagé avec les autres) ou d’autres éléments tels que les témoins de connexion, l’historique de navigation ou les favoris, vous devez choisir *Réglages* dans le menu principal de l’appli, puis *Effacer les données privées*. Un message vous demandera quels éléments vous souhaitez effacer.
id: Jika Anda ingin menghapus tembolok penelusuran normal Ceno (yang digunakan oleh peramban namun tidak dibagikan dengan orang lain) atau hal lain seperti kuki, riwayat penelusuran, atau favorit, Anda harus memilih *Pengaturan* di menu utama aplikasi, lalu *Hapus data pribadi*. Anda akan ditanya tentang hal mana yang ingin Anda hapus.

source: To drop everything at the same time (especially if you are in a hurry), please learn how to use the "panic button" feature described in [Installing Ceno](install.md).
ar: للتخلي عن كل شيء في نفس الوقت (خاصة إذا كنت في عجلة من أمرك)، يرجى معرفة كيفية استخدام ميزة "زر الطوارئ" الموضحة في [تثبيت Ceno](install.md).
de: Um alles gleichzeitig abzulegen (vor allem, wenn Sie es eilig haben), lernen Sie bitte, wie Sie die in [Installation von Ceno](install.md) beschriebene Funktion "Panikknopf" verwenden.
es: Para descartar todo al mismo tiempo (especialmente si estás en un apuro), por favor aprende cómo usar la característica "botón de pánico", descrita en [Instalando Ceno](install.md).
fr: Pour tout effacer d’un coup (surtout si vous êtes pressé.e), apprenez à utiliser la fonction « bouton d’urgence » décrite dans [Installer Ceno](install.md).
id: Untuk menghapus semuanya sekaligus (terutama jika Anda sedang terburu-buru), pelajari cara menggunakan fitur "tombol panik" yang dijelaskan di [Menginstal Ceno](install.md).

source: Collecting log messages
ar: جمع رسائل السجل
de: Sammeln von Protokollmeldungen
es: Recopilando mensajes de registro
fa: جمع‌آوری پیغام‌های لاگ
fr: Recueillir les messages du journal
id: Mengumpulkan pesan log
my: စာရင်း မက်ဆေ့ချ်များကို စုဆောင်းခြင်း
pt_br: Coletando mensagens de log
ru: Сбор сообщений журнала
tr: Günlük kayıtlarını tutmak
uk: Збір повідомлень журналу

source: At the bottom of the page there is an *Enable log file* check box that allows you to collect all of Ouinet's internal messages and download them to a file. This should only be used when diagnosing some problem in Ceno; just follow these steps:
ar: يوجد في أسفل الصفحة مربع اختيار *تمكين ملف السجل* الذي يسمح لك بجمع جميع الرسائل الداخلية لـ Ouinet وتنزيلها إلى ملف. يجب استخدام هذا فقط عند تشخيص بعض المشاكل في Ceno؛ ما عليك سوى اتباع هذه الخطوات:
de: Unten auf der Seite gibt es ein Kontrollkästchen *Protokolldatei aktivieren*, mit dem Sie alle internen Meldungen von Ouinet sammeln und in eine Datei herunterladen können. Dies sollte nur verwendet werden, wenn Sie ein Problem in Ceno diagnostizieren; folgen Sie einfach diesen Schritten:
es: En la parte inferior de la página hay una casilla de comprobación *Habilitar archivo de registro* que te permite recopilar todos los mensajes internos de Ouinet y descargarlos a un archivo. Esto solamente debería ser usado al diagnosticar algún problema en Ceno; solo sigue estos pasos:
fr: Au bas de la page se trouve une case à cocher *Activer le fichier journal* qui vous permet de recueillir tous les messages internes de Ouinet et de les télécharger dans un fichier. Cette option ne devrait être utilisée que pour diagnostiquer un problème dans Ceno ; il vous suffit de suivre les étapes suivantes :
id: Di bagian bawah halaman terdapat kotak centang *Aktifkan berkas log* yang memungkinkan Anda untuk mengumpulkan semua pesan internal Ouinet dan mengunduhnya ke sebuah berkas. Ini hanya boleh digunakan saat mendiagnosis beberapa masalah di Ceno. Cukup ikuti langkah-langkah ini:

source: At the *Ceno Settings* page, check *Enable log file*.
ar: في صفحة *إعدادات Ceno* ، حدد *تمكين ملف السجل*.
de: Aktivieren Sie auf der Seite *Ceno-Einstellungen* die Option *Protokolldatei aktivieren*.
es: En la página *Configuración de Ceno*, marca *Habilitar archivo de registro*.
fr: Dans la page *Paramètres de Ceno*, cochez *Activer le fichier journal*.
id: Di halaman *Pengaturan Ceno*, centang *Aktifkan berkas log*.

source: Go back to browsing and do whatever actions that trigger the troublesome behavior.
de: Kehren Sie zum Browsen zurück und führen Sie die Aktionen aus, die das problematische Verhalten auslösen.
es: Vuelve a navegar y haz cualquier acción que desencadene el comportamiento problemático.
fa: به مرور وب بازگردید و هر کاری را انجام دهید که جرقه‌ی رفتارهای دردسرساز را می‌زند.
fr: Revenez à la navigation et effectuez les actions qui déclenchent le comportement problématique.
id: Kembali ke penelusuran dan lakukan tindakan apa pun yang dapat memicu masalah.
my: ရှာဖွေမှုသို့ ပြန်သွားပြီး ပြဿနာဖြစ်စေသော အပြုအမူကို လှုံ့ဆော်သည့် မည်သည့် လုပ်ဆောင်ချက်များကိုမဆို ပြုလုပ်ပါ။
pt_br: Volte para a navegação e faça quaisquer ações que desencadeiem o comportamento problemático.
ru: Вернитесь к просмотру и выполните любые действия, которые вызывают проблемное поведение.
tr: Gezinmeye dönün ve sorun çıkan işlemleri yeniden yapın.
uk: Поверніться до перегляду та виконайте будь-які дії, що викликають проблемну поведінку.

source: Return to the *Ceno Settings* page and click on the *Download* link next to the *Enable log file* check box. Save the file for later use. Android may ask you at this point whether to allow Ceno access to stored media: this is needed to be able to save the file.
ar: عد إلى صفحة *إعدادات Ceno* وانقر على الرابط *تنزيل* بجوار مربع الاختيار *تمكين ملف السجل*. احفظ الملف لاستخدامه لاحقًا. قد يطلب منك أندرويد في هذه المرحلة إذا كنت ستسمح لـ Ceno بالوصول إلى الوسائط المخزنة: هذا ضروري لتتمكن من حفظ الملف.
de: Kehren Sie zur Seite *Ceno Einstellungen* zurück und klicken Sie auf den Link *Download* neben dem Kontrollkästchen *Protokolldatei aktivieren*. Speichern Sie die Datei zur späteren Verwendung. Android fragt Sie an dieser Stelle möglicherweise, ob Sie Ceno den Zugriff auf gespeicherte Medien erlauben möchten: Dies ist erforderlich, um die Datei speichern zu können.
es: Regresa a la página *Configuración de Ceno* y haz clic en el vínculo *Descargar* al lado de la casilla de comprobación *Habilitar archivo de registro*. Guarda el archivo para su uso posterior. Android podría preguntarte en este momento si le permites a Ceno acceso a medios almacenados: esto es necesario para poder guardar el archivo.
fr: Retournez sur la page *Paramètres de Ceno* et touchez le lien *Télécharger* à côté de la case à cocher *Activer le fichier journal*. Enregistrez le fichier pour une utilisation ultérieure. À ce stade, Android pourrait vous demander d’autoriser l’accès de Ceno aux médias stockés : cela est nécessaire afin d’enregistrer le fichier.
id: Kembali ke halaman *Pengaturan Ceno* dan klik tautan *Unduh* di sebelah kotak centang *Aktifkan berkas log*. Simpan berkas untuk digunakan nanti. Android mungkin bertanya kepada Anda pada saat ini apakah Anda akan mengizinkan Ceno untuk mengakses media yang disimpan: ini diperlukan untuk dapat menyimpan berkas tersebut.

source: Uncheck *Enable log file* to avoid the logs from growing too large.
ar: قم بإلغاء تحديد *تمكين ملف السجل* لتجنب أن تصبح السجلات كبيرة الحجم.
de: Deaktivieren Sie *Protokolldatei aktivieren*, damit die Protokolle nicht zu groß werden.
es: Desmarca *Habilitar archivo de registro* para evitar que crezca demasiado.
fa: علامت چک‌باکس *فعال‌سازیِ فایل لاگ* را با کلیک رویش از بین ببرید تا مانع رشد بیش‌ازاندازه‌ی لاگ‌ها شوید.
fr: Décochez la case *Activer le fichier journal* pour éviter que les journaux ne deviennent trop volumineux.
id: Hapus centang *Aktifkan berkas log* untuk menghindari bengkaknya ukuran log.
my: စာရင်းများ အလွန်အကျွံ ကြီးမားလာခြင်းကို ရှောင်ရှားရန် *စာရင်းဖိုင်ကို ဖွင့်မည်* ကို အမှန်ခြစ်ဖြုတ်ပါ။
pt_br: Desmarque *Ativar arquivo de log* para evitar que os logs se tornem grandes demais.
ru: Снимите флажок *Включить файл журнала*, чтобы избежать чрезмерного роста объема файла.
tr: Günlük kayıtlarının aşırı büyük dosyalar haline gelmemesi için *Günlük tutulsun* seçeneğinin işaretini kaldırın.
uk: Зніміть прапорець *Дозволити файл журналу*, щоб уникнути надмірного збільшення обсягу файлу.

source: You can now use the saved log file to document an issue report, but try to avoid making it public since it may contain sensitive information about your browsing.
ar: يمكنك الآن استخدام ملف السجل المحفوظ لتوثيق تقرير مشكل ما، ولكن حاول تجنب جعله عامًا لأنه قد يحتوي على معلومات حساسة حول تصفحك.
de: Sie können nun die gespeicherte Protokolldatei verwenden, um einen Fehlerbericht zu erstellen. Vermeiden Sie es jedoch, die Datei zu veröffentlichen, da sie vertrauliche Informationen über Ihr Surfverhalten enthalten könnte.
es: Ahora puedes usar el archivo de registro guardado para documentar un informe de problemas, pero intenta evitar hacerlo público ya que podría contener información delicada acerca de tu navegación.
fr: Vous pouvez maintenant utiliser le fichier journal enregistré pour documenter un relevé de problème, mais évitez de le rendre public, car il pourrait contenir des renseignements sensibles sur votre navigation.
id: Anda sekarang dapat menggunakan berkas log yang disimpan untuk mendokumentasikan laporan masalah, tetapi cobalah untuk tidak mempublikasikannya karena berkas itu mungkin berisikan informasi sensitif mengenai penjelajahan Anda.
my: ယခု သင်သည် ပြဿနာ အစီရင်ခံစာတစ်ခုကို မှတ်တမ်းတင်ရန် သိမ်းဆည်းထားသော စာရင်းဖိုင်ကို အသုံးပြုနိုင်သော်လည်း ၎င်းတွင် သင်၏ ရှာဖွေမှုအကြောင်း ထိလွယ်ရှလွယ်သော အချက်အလက် ပါဝင်နိုင်သောကြောင့် ၎င်းကို အများသိအောင် ပြုလုပ်ခြင်းကို ကြိုးစားရှောင်ရှားပါ။
pt_br: Você pode agora usar o arquivo de log salvo para documentar um relatório de problemas, mas tente evitar torná-lo público, pois ele pode conter informações sensíveis sobre a sua navegação.
ru: Теперь вы можете использовать сохраненный файл журнала для составления отчета о неполадках, но старайтесь не делать его публичным, поскольку он может содержать конфиденциальную информацию о вашем просмотре.
tr: Kaydedilen günlük dosyasını bir sorun bildirmek için kullanabilirsiniz. Ancak internet gezinmenizle ilgili hassas bilgiler içerebileceğinden bu dosyayı herkese açık hale getirmekten kaçının.
uk: Тепер Ви можете використовувати збережений файл журналу аби скласти звіт про несправності, але намагайтеся не робити його публічним, оскільки звіт може містити конфіденційну інформацію про перегляд вебсторінок.

source: CENO settings
fa: تنظیماتِ سنو
my: CENO ဆက်တင်များ
pt_br: Configurações do CENO
ru: Настройки CENO
tr: CENO ayarları
uk: Налаштування CENO

source: CENO Browser allows you to change some Ouinet-specific settings and get information about your client in a simple manner. This should not be needed for normal operation, but it would be helpful for testing different strategies against network interference, as well as reporting issues with the app.
my: CENO ဘရောက်ဇာသည် သင့်အား Ouinet သီးသန့် ဆက်တင်အချို့ကို ပြောင်းလဲပြီး ရိုးရှင်းသော နည်းလမ်းဖြင့် သင့်လက်ခံစက်အကြောင်း အချက်အလက် ရယူခွင့်ပြုသည်။ ယင်းကို ပုံမှန်လည်ပတ်မှုအတွက် မလိုအပ်နိုင်သော်လည်း ကွန်ရက် ကြားဝင် နှောင့်ယှက်မှုကို တိုက်ဖျက်ရန် မတူညီသော မဟာဗျူဟာများကို စမ်းသပ်ရာတွင် ကူညီရန်နှင့် အက်ပ်နှင့် သက်ဆိုင်သော ပြဿနာများကို အစီရင်ခံရန် အသုံးဝင်နိုင်သည်။
pt_br: O Navegador CENO permite que você mude algumas configurações específicas da Ouinet e obtenha informações sobre seu cliente de uma maneira simples. Isso não deve ser necessário para operações normais, mas seria útil para testar diferentes estratégias contra a interferência de rede, assim como para reportar problemas com o aplicativo.
ru: Браузер CENO позволяет изменить некоторые настройки Ouinet и быстро получить информацию о клиенте. Это не должно быть необходимо для нормальной работы, но будет полезно для тестирования различных стратегий против вмешательства в работу сети, а также для сообщения о неполадках в работе приложения.
tr: CENO Browser, normal işlemler için gerekli olmasa da, ağ kısıtlama ve kesme girişimlerine karşı farklı stratejileri denemek ve uygulamayla ilgili sorunları bildirmek için bazı Ouinet özel ayarlarını değiştirmenizi ve istemciniz hakkında bilgi alınmasını sağlar.
uk: Браузер CENO дозволяє змінити деякі налаштування Ouinet та швидко отримати інформацію про клієнта. Це не є необхідним для нормальної роботи, але буде корисно для тестування різних стратегій проти втручання в роботу мережі, а також для повідомлення про несправності роботи програми.
