Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/testing.po
Languages: ar, fa, fr, my, pt, pt_br, ru, tr, uk, ur

source: In contrast, if you had used private browsing with default settings, you may have seen a popup like the one below, with non-zero counts in *Direct from website* or *Via CENO network (private)*.
fa: در مقابل، اگر از مرور خصوصی با تنظیمات پیش‌فرض استفاده کرده‌اید، شاید پنجره‌ی بازشونده مانند پنجره‌ی پایینی دیده باشید، با شمارش‌های غیر-صفری در بخش *مستقیم از وب‌سایت* یا *از طریق شبکه‌ی (عمومی) CENO*.
my: ဆန့်ကျင်ဘက်အနေဖြင့် သင်သည် ပုံသေ ဆက်တင်များဖြင့် သီးသန့် ရှာဖွေမှဒကို အသုံးပြုခဲ့ပါက သင်သည် အောက်ပါ သတိပေးချက်ကဲ့သို့ သတိပေးချက်တစ်ခုကို မြင်ခဲ့နိုင်ပြီး *ဝက်ဘ်ဆိုက်မှ တိုက်ရိုက်* သို့မဟုတ် *CENO ကွန်ရက်မှတစ်ဆင့် (သီးသန့်)* တွင် သုည မဟုတ်သော အရေအတွက်များ ရှိပါသည်။
ru: С другой стороны, если вы использовали приватный просмотр с настройками по умолчанию, вы могли увидеть всплывающее окно, подобное приведенному ниже, с ненулевыми показателями в *Напрямую с веб-сайта* или *В приватной сети CENO*.
tr: Aksine, varsayılan ayarlarla gizli bir sekme kullanmış olsaydınız bu pencerede aşağıdaki gibi *Doğrudan siteden* ya da *CENO ağı üzerinden (gizli)* bölümlerinde sayılar görebilirdiniz.
uk: І навпаки, якщо ви використовували приватний перегляд з налаштуваннями за замовчуванням, ви могли побачити спливаюче вікно, подібне до наведеного нижче, з ненульовими показниками в *Напряму з веб-сайту* або *У приватній мережі CENO*.
ur: اس کے برعکس، اگر آپ نے ڈیفالٹ ترتیبات کے ساتھ نجی براؤزنگ کا استعمال کیا تھا، تو ہو سکتا ہے کہ آپ نے نیچے دیے گئے ایک پاپ اپ کو دیکھا ہو گا، جس میں *براہ راست ویب سائٹ* یا *CENO نیٹ ورک (نجی)* میں غیر صفر شمار ہوں گے۔

source: ![Figure: Sources used with private browsing](images/sources-proxy.png)
ar: ![الشكل: المصادر المستخدمة في التصفح الخاص](images/sources-proxy.png)
fa: ![شکل: منابع به‌کاررفته با مرور خصوصی](images/sources-proxy.png)
fr: ![Figure: Sources utilisées avec la navigation privée](images/sources-proxy.png)
pt: ![Figura: Sources usadas com a navegação privativa](images/sources-proxy.png)
pt_br: ![Figura: Sources usadas com a navegação privativa](images/sources-proxy.png)
tr: ![Görsel: Gizli gezinmede kullanılan kaynaklar](images/sources-proxy.png)
uk: ![Малюнок: Джерела, що використовуються при приватному перегляді](images/sources-proxy.png)
ur: ![تصویر: نجی براؤزنگ کے ساتھ استعمال ہونے والے ذرائع](images/sources-proxy.png)

source: Getting content from close users
ar: الحصول على المحتوى من المستخدمين القريبين
fa: دریافت محتوا از کاربران نزدیک
fr: Obtenir du contenu d’utilisateurs proches
my: နီးကပ်သော သုံးစွဲသူများထံမှ အကြောင်းအရာ ရယူခြင်း
pt: Obter conteúdo de utilizadores próximos
pt_br: Obtendo conteúdo de usuários próximos
ru: Получение контента от близких пользователей
tr: Yakındaki kullanıcılardan içerik alma
uk: Отримання контенту від локальних користувачів
ur: قریبی صارفین سے مواد حاصل کرنا

source: Since your first device was able to get some content from an injector, let us test if it is able to share it with another device over the distributed cache. The simplest way is to use CENO's device-to-device support to check whether getting and verifying signed content works.
fa: از آن‌جا که نخستین دستگاه‌تان توانست محتوایی را از یک injector دریافت کند، بیایید تست کنیم که آیا این دستگاه می‌تواند آن را با دستگاه دیگری روی کش توزیع‌شده به اشتراک بگذارد. ساده‌ترین راه استفاده از پشتیبانی دستگاه-به-دستگاه CENO برای چک‌کردن این است که آیا دریافت و راستی‌آزمایی محتوای امضاشده درست کار می‌کند یا نه.
my: သင်၏ ပထမစက်က ထိုးသွင်းဖိုင်တစ်ခုထံမှ အကြောင်းအရာအချို့ကို ရယူနိုင်ခဲ့သည့်အတွက် ဖြန့်ချိထားသော ယာယီသိမ်းဆည်းထားသည့် မှတ်ဉာဏ် သုံး၍ ၎င်းကို သင့်စက်က အခြားစက်နှင့် မျှဝေနိုင်ခြင်း ရှိ၊ မရှိ စမ်းသပ်ကြည့်ရအောင်။ အရိုးရှင်းဆုံး နည်းလမ်းမှာ CENO ၏ စက်အချင်းချင်း ပံ့ပိုးမှုကို အသုံးပြု၍ လက်မှတ်ထိုးထားသော အကြောင်းအရာကို ရယူပြီး မှန်ကန်ကြောင်း စစ်ဆေးခြင်း အလုပ်လုပ်၊ မလုပ် စစ်ဆေးရန် ဖြစ်သည်။
ru: Поскольку ваше первое устройство смогло получить некоторое содержимое от инъектора, давайте проверим, может ли оно поделиться им с другим устройством через распределенный кэш. Самый простой способ - использовать поддержку CENO между устройствами, чтобы проверить, работает ли получение и проверка подписанного контента.
tr: Birinci aygıtınız bir içerik ekleyiciden içerik yükleyebildiği için şimdi bu içeriği dağıtılmış ön bellek ile başka bir aygıt ile paylaşmasını sınayacağız. İmzalanmış içeriğin alımı ve doğrulanmasının çalıştığını denetlemenin en kolay yolu aygıttan aygıta CENO desteğini kullanmaktır.
uk: Оскільки ваш перший пристрій зміг отримати контент від ін'єктора, перевіримо, чи може він поділитися ним з іншим пристроєм через розподілений кеш. Найпростіший спосіб — використовувати підтримку прямого зв'язку між пристроями в CENO, щоб перевірити, чи отримання та перевірка підписаного контенту.
ur: چونکہ آپ کا پہلا ڈیوائس انجیکٹر سے کچھ مواد حاصل کرنے کے قابل تھا، آئیے یہ جانچتے ہیں کہ آیا یہ تقسیم شدہ کیش پر کسی دوسرے ڈیوائس کے ساتھ اشتراک کرنے کے قابل ہے۔ سب سے آسان طریقہ یہ ہے کہ CENO کی ڈیوائس ٹو ڈیوائس سپورٹ کا استعمال کریں تاکہ یہ معلوم کیا جا سکے کہ آیا دستخط شدہ مواد حاصل کرنا اور اس کی تصدیق کرنا کام کرتا ہے۔

source: After successfully completing the test above on the first device, leave CENO running on it (the CENO icon should appear in its notification bar). Then get hold of a second device (you can invite a friend over to help test) and connect it to the same Wi-Fi network. Next, follow the steps below on the second device:
fa: پس از تکمیل موفقیت‌آمیز تست بالا روی دستگاه نخست، CENO را روی آن در حال اجرا بگذارید (علامت CENO باید در نوار اطلاع‌رسانی آن ظاهر شود). سپس دستگاه دیگری را در اختیار بگیرید (می‌توانید یکی از دوستان‌تان را دعوت کنید تا در انجام این تست به شما کمک کند) و آن را به همان شبکه‌ی وای‌فای وصل کنید. سپس، مراحل زیر را روی دستگاه دوم انجام دهید:
tr: Birinci aygıtta yukarıdaki sınamayı tamamladıktan sonra, CENO'yu çalışır olarak bırakın (CENO simgesi bildirim çubuğunda gözükmeli). İkinci aygıtınızı alın (yardımcı olması için bir arkadaşınıza söyleyebilirsiniz) ve aynı kablosuz ağa bağlanın. Sonrasında ikinci aygıtınızda aşağıdaki adımları izleyin:
uk: Після успішного завершення вищезазначеного тесту на першому пристрої, залиште CENO запущеним на ньому (значок CENO має з'явитися на панелі повідомлень). Потім візьміть другий пристрій (ви можете запросити друга, щоб допомогти з тестуванням) і підключіть його до тієї ж мережі Wi-Fi. Виконайте наведені нижче дії на другому пристрої:
ur: پہلی ڈیوائس پر مذکورہ ٹیسٹ کو کامیابی کے ساتھ مکمل کرنے کے بعد، CENO کو اس پر چلتے رہنے دیں (CENO کا آئیکن اس کے نوٹیفکیشن بار میں ظاہر ہونا چاہیے)۔ پھر دوسرا ڈیوائس پکڑیں (آپ ٹیسٹ میں مدد کے لیے کسی دوست کو مدعو کر سکتے ہیں) اور اسے اسی Wi-Fi نیٹ ورک سے منسلک کریں۔ اس کے بعد ، دوسرے ڈیوائس پر درج ذیل مراحل پر عمل کریں:

source: Install CENO if needed and start it as above.
fa: در صورت نیاز CENO را نصب کنید و مانند قبل آن را اجرا کنید.
tr: Kurmadıysanız, CENO uygulamasını kurun ve yukarıdaki gibi başlatın.
uk: Встановіть CENO та запустіть його, як зазначено вище.
ur: اگر ضرورت ہو تو CENO انسٹال کریں اور اوپر کی طرح شروع کریں۔

source: Open the *CENO Settings* page as above. Since we only want to test distributed cache access, uncheck all the boxes for content sources except *Shared by other CENO users*.
fa: مانند قبل صفحه‌ی *تنظیمات CENO* را باز کنید. از آن‌جا که ما فقط می‌خواهیم دسترسی به کش توزیع‌شده را تست کنیم، تمام جعبه‌های مربوط به منابع محتوا به جز *به‌اشتراک‌گذاشته‌شده از سوی سایر کاربران CENO* را غیرفعال کنید.
tr: Uygulamanın ana menüsünü açın ve *CENO ayarlarını* açmak için *CENO* seçeneğine dokunun. Yalnızca içerik ekleyici erişim sınaması yapacağımız için, içerik kaynakları kısmında *CENO ağı üzerinden (herkese açık)* seçeneği dışındaki tüm seçeneklerin işaretini kaldırın.
uk: Відкрийте сторінку *Налаштування CENO*, як зазначено вище. Оскільки ми хочемо протестувати лише розподілений доступ до кешу, зніміть прапорці з джерел контенту, крім *Надано іншими користувачами CENO*.
ur: اوپر کی طرح *CENO ترتیبات* صفحہ کھولیں۔ چونکہ ہم صرف تقسیم شدہ کیش تک رسائی کی جانچ کرنا چاہتے ہیں، اس لیے مواد کے ذرائع کے تمام خانوں کو غیر نشان زد کریں سوائے *دوسرے CENO صارفین کے ذریعہ اشتراک کردہ* کے۔

source: Go back to CENO's home page and visit the same site in the same manner as you did above (i.e. by selecting one of the recommended web sites or entering its URL in the address bar).
fa: به صفحه‌ی خانگی CENO بازگردید و از همان سایت به همان شیوه‌ی قبلی در بالا بازدید کنید (یعنی با انتخاب یکی از وب‌سایت‌های توصیه‌شده یا واردکردن نشانی اینترنتی آن در نوار نشانی).
my: CENO ၏ ပင်မ စာမျက်နှာသို့ ပြန်သွားပြီး သင် အထက်တွင် ပြုလုပ်ခဲ့သည့်အတိုင်း တူညီသော အပြုအမူဖြင့် တူညီသော ဆိုက်သို့ ဝင်ကြည့်ပါ (ဆိုလိုသည်မှာ အကြံပြုထားသော ဝက်ဘ်ဆိုက်များမှတစ်ခုကို ရွေးချယ်ခြင်းဖြင့် ဖြစ်စေ၊ လိပ်စာဘားတွင် ၎င်း၏ URL ကို ရိုက်ထည့်ခြင်းဖြင့် ဖြစ်စေ)။
ru: Вернитесь на домашнюю страницу CENO и посетите тот же сайт тем же способом, что и выше (т.е. выбрав один из рекомендованных сайтов или введя его URL в адресной строке).
tr: CENO giriş sayfasına geri dönün ve yukarıda yaptığınız gibi aynı siteyi ziyaret edin (önerilen sitelerden birini seçerek ya da adres çubuğuna adresini yazarak).
uk: Поверніться на домашню сторінку CENO і відвідайте той самий сайт тим самим способом, що й вище (тобто обравши один із рекомендованих сайтів або ввівши його URL-адресу в адресному рядку).
ur: CENO کے ہوم صفحہ پر واپس جائیں اور اسی طرح اسی سائٹ پر جائیں جیسا کہ آپ نے اوپر کیا تھا (یعنی تجویز کردہ ویب سائٹس میں سے کسی ایک کو منتخب کرکے یا ایڈریس بار میں اس کا URL درج کرکے)۔

source: If it does not work, your Wi-Fi network may be blocking direct communication between its devices. This "client isolation" may happen in public networks like those of parks, bars or hotels. Please try again on a different network.
ar: إذا لم يعمل، فقد تكون شبكة Wi-Fi تحظر الاتصال المباشر بين أجهزتها. "عزل العميل" هذا قد يحدث في الشبكات العامة مثل تلك الموجودة في المتنزهات أو الحانات أو الفنادق. يرجى المحاولة مرة أخرى على شبكة مختلفة.
fa: اگر این کار نتیجه نمی‌دهد، شبکه‌ی بی‌سیم شما احتمالاً ارتباط مستقیم بین دستگاه‌هایش را مسدود می‌کند. این «انزوای سرویس‌گیرنده» می‌تواند در شبکه‌های همگانی مانند شبکه‌های موجود در پارک‌ها، بارها یا هتل‌ها پیش آید. لطفاً روی یک شبکه‌ی دیگر دوباره امتحان کنید.
fr: Si cela ne fonctionne pas, il se peut que votre réseau Wi-Fi bloque la communication directe entre ses appareils. Cet « isolement du client » peut se produire sur les réseaux publics tels que ceux de parcs, de bars ou d’hôtels. Réessayez sur un réseau différent.
pt: Caso não funcione, a sua rede WiFi pode estar bloqueando as comunicações diretas entre os aparelhos dela. Este "isolamento do cliente" pode acontecer em redes públicas como as de parques, bares ou hotéis. Por favor, tente novamente numa rede diferente.
pt_br: Caso não funcione, sua rede WiFi pode estar bloqueando as comunicações diretas entre os dispositivos dela. Este "isolamento do cliente" pode acontecer em redes públicas como as de parques, bares ou hotéis. Por favor, tente novamente em uma rede diferente.
tr: Çalışmazsa, kablosuz ağınız aygıtlar arasında doğrudan erişimi engelliyor olabilir. Bu "İstemci yalıtımı" durumu ile herkese açık ağlarda (parklar, barlar, oteller gibi yerlerde) karşılaşılabilir. Lütfen başka bir ağ kullanarak yeniden deneyin.
uk: Якщо він не працює, можливо, мережа Wi-Fi блокує прямий зв'язок між пристроями. Така «ізоляція клієнта» може відбуватися у громадських мережах, наприклад, у парках, барах чи готелях. Повторіть спробу в іншій мережі.
ur: اگر یہ کام نہیں کرتا ہے تو، آپ کا Wi-Fi نیٹ ورک اپنے ڈیوائسز کے درمیان براہ راست مواصلت کو روک رہا ہے۔ یہ "کلائنٹ کی تنہائی" عوامی نیٹ ورکس جیسے پارکس، بارز یا ہوٹلوں میں ہو سکتی ہے۔ براہ کرم ایک مختلف نیٹ ورک پر دوبارہ کوشش کریں۔

source: If it works, it means that both devices are able to deliver that content to other clients. Pushing the CENO address bar icon should show a popup like the one below, where only *Shared by other CENO users* has a non-zero value.
fa: اگر سایت کار کرد، این به معنای آن است که هردو دستگاه قادر به رساندن آن محتوا به سرویس‌گیرندگان دیگر هستند. فشردن علامت نوار نشانی CENO باید پنجره‌ی بازشونده‌ای را مانند پنجره‌ی پایینی نشان دهد، که در آن فقط *به‌اشتراک‌گذاشته‌شده از سوی سایر کاربران CENO* یک ارزش غیر-صفر دارد.
my: ၎င်းသည် အလုပ်လုပ်ပါက စက်နှစ်ခုလုံးသည် ထိုအကြောင်းအရာကို အခြားလက်ခံစက်များသို့ ပို့ဆောင်နိုင်သည်ဟု ဆိုလိုသည်။ CENO လိပ်စာဘား အိုင်ကွန်ကို နှိပ်လျှင် အောက်ပါ အသိပေးချက်ကဲ့သို့ အသိပေးချက်တစ်ခု ပေါ်လာမည်ဖြစ်ပြီး *အခြား CENO သုံးစွဲသူများက မျှဝေထားသည်* တွင်သာ သုည မဟုတ်သော တန်ဖိုး ရှိသည်။
ru: Если он работает, это означает, что оба устройства могут доставлять это содержимое другим клиентам. При нажатии на значок адресной строки CENO должно появиться всплывающее окно, как показано ниже, где только *Предоставлено другим пользователям CENO* имеет ненулевое значение.
tr: Çalışıyorsa, iki aygıt da diğer istemcilere içerik gönderebiliyordur. Adres çubuğundaki CENO simgesine dokunarak pencereyi açtığınızda aşağıdaki gibi *Diğer CENO kullanıcılarının paylaşımlarından* değerinin sıfır olmadığını görebilirsiniz.
uk: Якщо все працює, це означає, що обидва пристрої можуть доставляти контент іншим клієнтам. При натисканні на значок адресного рядка CENO з'явиться спливаюче вікно, як показано нижче, де тільки *Надано іншими користувачами CENO* має ненульове значення.
ur: اگر یہ کام کرتا ہے تو اس کا مطلب ہے کہ دونوں ڈیوائسز اس مواد کو دوسرے کلائنٹس تک پہنچانے کے قابل ہیں۔ CENO ایڈریس بار کے آئیکن کو دبانے سے نیچے کی طرح ایک پاپ اپ نظر آنا چاہیے، جہاں صرف *دوسرے CENO صارفین کے ذریعے اشتراک کردہ* کی قدر صفر نہیں ہے۔

source: ![Figure: Sources used when testing distributed cache retrieval](images/sources-dcache.png)
ar: ![الشكل: المصادر المستخدمة عند اختبار استرجاع ذاكرة التخزين المؤقت الموزعة](images/sources-dcache.png)
fa: ![شکل: منابع به‌کاررفته هنگام تست بازیابی کش توزیع‌شده](images/sources-dcache.png)
fr: ![Figure: Sources utilisées lors de tests de récupération du cache distribué](images/sources-dcache.png)
pt: ![Figura: Sources usadas durante o teste de recuperação do cache distribuído](images/sources-dcache.png)
pt_br: ![Figura: Sources usadas durante o teste de recuperação do cache distribuído](images/sources-dcache.png)
tr: ![Görsel: Dağıtılmış ön bellekten yükleme sınanırken kullanılan kaynaklar](images/sources-dcache.png)
uk: ![Малюнок: Джерела, що використовуються при тестуванні розподіленого пошуку кешу](images/sources-dcache.png)
ur: ! [تصویر: تقسیم شدہ کیش کی بازیابی کی جانچ کرتے وقت استعمال ہونے والے ذرائع] (images/sources-dcache.png)

source: Finally, you may have also noticed that there is a counter for *Shared by you*. This is not a different source *per se*: elements counted here are indeed part of the distributed cache, but they happen to already be stored in your device, so CENO does not need to retrieve them over the network.
fa: سرانجام، شاید به این نکته نیز دقت کرده باشید که شمارشگری برای *به‌اشتراک‌گذاشته‌شده از سوی شما* وجود دارد. این منبعی متفاوت *به معنای واقعی کلمه* نیست: عناصر شمارش‌شده در این‌جا در حقیقت بخشی از کش توزیع‌شده‌اند، اما آن‌ها پیشاپیش در دستگاه شما ذخیره شده‌اند، بنابراین CENO نیازی به بازیابی آن‌ها روی شبکه ندارد.
tr: Son olarak *Paylaştıklarınız* için de bir sayaç olduğunu farketmiş olabilirsiniz. Bu *ayrı* bir kaynak değildir. Burada sayılan içerikler dağıtılmış ön belleğin bir parçasıdır ve sizin aygıtınızda önceden kaydedilmiştir. Böylece CENO bu içerikleri ağ üzerinden yeniden almaya gerek duymaz.
uk: Нарешті, ви, можливо, помітили, що є лічильник *Надано вами*. Це не інше джерело *як таке*: елементи, що враховуються тут, є частиною розподіленого кеша, але вони вже зберігаються на вашому пристрої, тому CENO не потрібно отримувати їх по мережі.
ur: آخر میں، آپ نے یہ بھی محسوس کیا ہوگا کہ *آپ کے ذریعے اشتراک کردہ* کے لیے ایک کاؤنٹر موجود ہے۔ یہ کوئی مختلف ذریعہ نہیں ہے **فی خود**: یہاں شمار کیے گئے عناصر درحقیقت تقسیم شدہ کیش کا حصہ ہیں، لیکن ایسا ہوتا ہے کہ وہ پہلے سے ہی آپ کے ڈیوائس میں محفوظ ہیں، لہذا CENO کو نیٹ ورک پر انہیں بازیافت کرنے کی ضرورت نہیں ہے۔

source: Getting content from remote users
ar: الحصول على المحتوى من المستخدمين عن بعد
fa: دریافت محتوا از کاربران دور
fr: Obtenir du contenu d’utilisateurs distants
my: ဝေးလံသော သုံးစွဲသူများထံမှ အကြောင်းအရာ ရယူခြင်း
pt: Obter conteúdo de utilizadores distantes
pt_br: Obtendo conteúdo de usuários distantes
ru: Получение контента от удаленных пользователей
tr: Uzak kullanıcılardan içerik alma
uk: Отримання контенту від користувачів з іншої мережі
ur: دور دراز کے صارفین سے مواد حاصل کرنا

source: We have done a small-scale test of the distributed cache. Let us now test how it works over the Internet.
ar: لقد أجرينا اختبارًا لذاكرة التخزين المؤقت الموزعة على نطاق صغير. دعونا الآن نختبر كيف تعمل عبر الإنترنت.
fa: ما یک تست مقیاس کوچک از کش توزیع‌شده انجام داده‌ایم. بیایید حالا تست کنیم که چگونه روی اینترنت کار می‌کند.
fr: Nous avons effectué un test du cache distribué à petite échelle. Testons maintenant son fonctionnement sur Internet.
my: ကျွန်ုပ်တို့သည် ဖြန့်ချိထားသော ယာယီသိမ်းဆည်းထားသည့် မှတ်ဉာဏ်ကို အသေးစား စမ်းသပ်မှု ပြုလုပ်ပြီးပါပြီ။ ယခု အင်တာနက် သုံး၍ ၎င်းမည်သို့ အလုပ်လုပ်ကြောင်း စမ်းသပ်ကြည့်ရအောင်။
pt: Realizamos um teste de pequena escala do cache distribuído. Vamos agora testar como funciona através da Internet.
pt_br: Realizamos um teste de pequena escala do cache distribuído. Vamos agora testar como funciona através da Internet.
ru: Мы провели мелкомасштабное тестирование распределенного кэша. Теперь давайте проверим, как он работает через Интернет.
tr: Dağıtılmış ön bellek için küçük bir sınama yaptık. Şimdi internet üzerinden nasıl çalıştığını sınayalım.
uk: Ми провели дрібномасштабне тестування розподіленого кешу. Тепер перевіримо, як він працює через інтернет.
ur: ہم نے تقسیم شدہ کیش کا ایک چھوٹے پیمانے پر ٹیسٹ کیا ہے۔ آئیے اب جانچتے ہیں کہ یہ انٹرنیٹ پر کیسے کام کرتا ہے۔

source: After successfully completing the test above, leave CENO running on the first device as with the previous test, and stop CENO on the second device (by showing its notifications and pushing "Tap to stop").
fa: پس از اتمام موفقیت‌آمیز تست بالا، مانند تست قبلی CENO را در حال اجرا روی دستگاه اول رها کنید، و روی دستگاه دوم CENO را متوقف کنید (با نمایش اطلاع‌رسانی‌های آن و فشردن گزینه‌ی «برای توقف اینجا را بفشارید»).
tr: Yukarıdaki sınama tamamlandıktan sonra CENO uygulamasını birinci aygıttaki gibi açık bırakın ve ikinci aygıtta bildirimlerden CENO uygulamasını durdurun.
uk: Після успішного завершення вищезазначеного тесту, залиште CENO запущеним на першому пристрої, як і в попередньому тесті, та зупиніть CENO на другому пристрої (відкривши його повідомлення та натиснувши кнопку «Натисніть, щоб зупинити»).
ur: اوپر دیے گئے ٹیسٹ کو کامیابی سے مکمل کرنے کے بعد، CENO کو پچھلے ٹیسٹ کی طرح پہلے ڈیوائس پر چلتا چھوڑ دیں، اور CENO کو دوسرے ڈیوائس پر روک دیں (اس کے نوٹیفیکیشنز دکھا کر اور "روکنے کے لیے دبائيں" کو دبا کر)۔

source: This time you will need a third device, but it must be connected to a different Wi-Fi network (maybe another friend can help from home). The steps to follow for that device are exactly the same as those in the previous test.
ar: ستحتاج هذه المرة إلى جهاز ثالث، ولكن يجب أن يكون متصلاً بشبكة Wi-Fi مختلفة (ربما يمكن لصديق آخر المساعدة من منزله). الخطوات التي يجب اتباعها لهذا الجهاز هي بالضبط نفس تلك الموجودة في الاختبار السابق.
fa: این بار به یک دستگاه سوم نیاز دارید، اما این دستگاه باید به یک شبکه‌ی وای‌فای متفاوت وصل باشد (شاید دوستی دیگر بتواند از خانه به شما کمک کند). مراحل لازم برای آن دستگاه درست مانند همان مراحل اجراشده در تست قبلی هستند.
fr: Vous aurez cette fois besoin d’un troisième appareil, mais il doit être connecté à un réseau Wi-Fi différent (un.e autre ami.e pourrait vous aider de la maison). Les étapes à suivre pour cet appareil sont exactement les mêmes que celles du test précédent.
pt: Dessa vez precisará de um terceiro aparelho, mas ele precisa estar conectado a uma rede WiFi diferente (talvez outra pessoa amiga possa ajudar de casa). As etapas a seguir para esse aparelho são exatamente as mesmas daquelas no teste anterior.
pt_br: Dessa vez você precisará de um terceiro dispositivo, mas ele precisa estar conectado a uma rede WiFi diferente (talvez outra pessoa amiga possa ajudar de casa). As etapas a seguir para esse dispositivo são exatamente as mesmas daquelas no teste anterior.
tr: Şimdi başka bir kablosuz ağa bağlanan üçüncü bir aygıt gerekiyor (başka bir arkadaşınız kendi evinden yardım edebilir). Bu aygıt için izlenmesi gereken adımlar bir önceki aygıt ile aynıdır.
uk: Цього разу вам знадобиться третій пристрій, але він має бути підключений до іншої мережі Wi-Fi (можливо, хтось із ваших знайомих зможе перевірити це з дому). Для цього пристрою необхідно виконати ті ж дії, що й у попередньому тесті.
ur: اس بار آپ کو تیسرے ڈیوائس کی ضرورت ہوگی، لیکن اسے کسی دوسرے Wi-Fi نیٹ ورک سے منسلک ہونا چاہیے (ہو سکتا ہے کہ کوئی دوسرا دوست گھر سے مدد کر سکے)۔ اس ڈیوائس کے لیے پیروی کرنے کے اقدامات بالکل وہی ہیں جو پچھلے ٹیسٹ میں تھے۔

source: If the third device can load the site used for the test, you are all set. The first device is able to seed content to others, and it can most probably also act as a bridge.
ar: إذا تمكّن الجهاز الثالث من تحميل الموقع المستخدَم للاختبار، فأنت جاهز تمامًا. الجهاز الأول قادر على نشر المحتوى للآخرين، ويمكن أيضًا أن يعمل كجسر.
fa: اگر دستگاه سوم می‌تواند سایت به‌کاررفته برای تست را بارگذاری کند، شما کاملاً آماده‌اید. نخستین دستگاه قادر به بذرپاشی محتوا به دیگران است، و می‌تواند به احتمال قوی به‌عنوان یک پل نیز عمل کند.
fr: Si le troisième appareil peut charger le site utilisé pour le test, vous êtes prêt. Le premier appareil arrive à propager du contenu vers d’autres appareils et il peut aussi très probablement servir de pont.
pt: Caso o terceiro aparelho consiga carregar o website usado para o teste, está pronto. O primeiro aparelho é capaz de semear conteúdo para outros e pode, muito provavelmente, atuar também como ponte.
pt_br: Caso o terceiro dispositivo consiga carregar o website usado para o teste, você está pronto. O primeiro dispositivo é capaz de semear conteúdo para outros e pode, muito provavelmente, atuar também como ponte.
ru: Если третье устройство может загрузить сайт, используемый для теста, все готово. Первое устройство может передавать контент другим, и, скорее всего, оно также может выступать в качестве моста.
tr: Üçüncü aygıt sınama için kullanılan siteyi yükleyebiliyorsa, her şey hazır demektir. Birinci aygıt diğerlerine içerik gönderebiliyor ve büyük olasılıkla köprü olarak da çalışabilir.
uk: Якщо третій пристрій може завантажити сайт, який використовується для тестування, все готово. Перший пристрій може передавати контент іншим, і, швидше за все, він може виступати в якості мосту.
ur: اگر تیسرا ڈیوائس ٹیسٹ کے لیے استعمال ہونے والی سائٹ کو لوڈ کر سکتا ہے، تو آپ بالکل تیار ہیں۔ پہلا ڈیوائس دوسروں کے لیے مواد کو سیڈ کرنے کے قابل ہے، اور یہ غالباً ایک پل کا کام بھی کر سکتا ہے۔

source: Congratulations!
ar: مبروك!
fa: تبریک می‌گوییم!
fr: Félicitations !
pt: Parabéns!
pt_br: Parabéns!
ru: Поздравляем!
tr: Tebrikler!
uk: Вітаємо!
ur: مبارکباد!
