Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/testing.po
Languages: ar, fa, fr, my, pt, pt_br, ru, tr, uk, ur

source: Testing the Browser
ar: اختبر المتصفح
fa: تست مرورگر
fr: Tester le navigateur
my: ဘရောက်ဇာ စမ်းသပ်ခြင်း
pt: Testando o navegador
pt_br: Testando o Navegador
ru: Тестирование браузера
tr: Tarayıcıyı denemek
uk: Перевірка браузера
ur: براؤزر کی جانچ کرنا

source: Now that you know how to [install](install.md) and [configure](settings.md) CENO, let us follow some steps to test whether different Ouinet-specific features work. This will involve selectively enabling and disabling different access mechanisms. Keep in mind however that in day-to-day usage of CENO, you will seldom need to change the default settings at all.
fa: حالا که می‌دانید چگونه باید CENO را [نصب](install.md) و [تنظیم](settings.md) کنید، بیایید برخی مراحل را دنبال کنیم تا بسنجیم که آیا ویژگی‌های مختلف خاص Ouinet درست کار می‌کنند. این فرایند شامل فعال‌سازی و غیرفعال‌سازی گزینشی سازوکارهای متفاوت دسترسی خواهد بود. اما به یاد داشته باشید که در استفاده‌ی روزمره از CENO، شما به‌ندرت نیازی به تغییر تنظیمات پیش‌فرض نرم‌افزار خواهید داشت.
my: ယခု သင်သည် CENO ကို မည်သို့ [ထည့်သွင်း](install.md) ပြီး[စီစဉ်သတ်မှတ်](settings.md) ရမည်ကို သိပြီဖြစ်သောကြောင့် ကွဲပြားသော Ouinet သီးသန့် လုပ်ဆောင်ချက်များ အလုပ်လုပ်၊ မလုပ် စမ်းသပ်ရန် အဆင့်အချို့ကို လုပ်ဆောင်ကြည့်ရအောင်။ ယင်းတွင် ကွဲပြားသော ဝင်ရောက်သုံးစွဲခွင့် စက်ကိရိယာများကို ရွေးချယ်၍ ဖွင့်ခြင်းနှင့် ပိတ်ခြင်း ပါဝင်ပါမည်။ သို့သော် CENO ကို နေ့စဉ် အသုံးပြုရာတွင် သင်သည် ပုံသေ ဆက်တင်များကို ပြောင်းလဲရန် လိုအပ်ခဲမည် ဖြစ်ကြောင်း သိမှတ်ထားပါ။
ru: Теперь, когда вы знаете, как [установить](install.md) и [настроить](settings.md) CENO, давайте выполним несколько шагов, чтобы проверить, работают ли различные функции, специфичные для Ouinet. Это включает в себя выборочное включение и отключение различных механизмов доступа. Помните, что при повседневном использовании CENO вам редко придется изменять настройки по умолчанию.
tr: Artık CENO uygulamasını nasıl [kurup](install.md), [yapılandıracağınızı](settings.md) bildiğinize göre çeşitli Ouinet özelliklerinin çalışıp çalışmadığını deneyebiliriz. Deneme süresince farklı erişim yöntemlerini açıp kapatacağız. Normal CENO kullanımında varsayılan ayarları değiştirmeniz pek gerekmez.
uk: Тепер, коли ви знаєте, як [встановити](install.md) та [налаштувати](settings.md) CENO, давайте виконаємо кілька кроків, щоб перевірити, чи працюють різні функції, специфічні для Ouinet. Перевірка включає покрокове включення і відключення різних механізмів доступу. Пам'ятайте, що при повсякденному використанні CENO вам рідко доведеться змінювати стандартні налаштування.
ur: اب جب کہ آپ جانتے ہیں کہ کس طرح [انسٹال کریں](install.md) اور [ترتیب دیں](settings.md) CENO، آئیے یہ جانچنے کے لیے کچھ مراحل پر عمل کریں کہ آیا مختلف Ouinet مخصوص خصوصیات کام کرتی ہیں۔ اس میں رسائی کے مختلف طریقہ کار کو منتخب طور پر فعال اور غیر فعال کرنا شامل ہوگا۔ تاہم ذہن میں رکھیں کہ CENO کے روزانہ استعمال میں، آپ کو کبھی کبھار ہی پہلے سے طے شدہ ترتیبات کو تبدیل کرنے کی ضرورت ہوگی۔

source: To complete all the tests below you will need at least two devices connected to the same Wi-Fi network, and a third one on a completely different network.
ar: لإكمال جميع الاختبارات أدناه، ستحتاج إلى جهازين على الأقل متصلين بنفس شبكة Wi-Fi، وإلى جهاز ثالث متصل بشبكة مختلفة تمامًا.
fa: ‬برای کامل‌کردن تمام تست‌های پایین نیاز به دست‌کم دو دستگاه خواهید داشت که به یک شبکه‌ی وای‌فای مشترک وصل باشند، و نیز یک دستگاه سوم روی یک شبکه‌ی کاملاً متفاوت.
fr: Pour réaliser tous les tests ci-dessous, vous aurez besoin d’au moins deux appareils connectés au même réseau Wi-Fi et d’un troisième appareil connecté à un réseau complètement différent.
my: အောက်ပါ စမ်းသပ်မှုအားလုံးကို ပြီးမြောက်ရန် သင်သည် Wi-Fi ကွန်ရက် တစ်ခုတည်းသို့ ချိတ်ဆက်ထားသော စက် အနည်းဆုံး နှစ်လုံး လိုအပ်မည်ဖြစ်ပြီး တတိယစက်ကို လုံးဝ ကွဲပြားသော ကွန်ရက်သို့ ချိတ်ဆက်ထားရမည်။
pt: Para completar todos os testes abaixo, precisará de ao menos dois aparelhos conectados à mesma rede WiFi e um terceiro conectado a uma rede completamente diferente.
pt_br: Para completar todos os testes abaixo, você precisará de ao menos dois dispositivos conectados à mesma rede WiFi e um terceiro conectado a uma rede completamente diferente.
ru: Для выполнения всех приведенных ниже тестов вам потребуется как минимум два устройства, подключенных к одной и той же сети Wi-Fi, а третье - к совершенно другой сети.
tr: Aşağıdaki tüm sınamaları tamamlamak için aynı kablosuz ağa bağlı en az iki aygıt ve tümüyle başka bir ağda bulunan üçüncü bir aygıt gereklidir.
uk: Для виконання всіх наведених нижче тестів вам знадобиться як мінімум два пристрої, підключені до однієї мережі Wi-Fi, і один, підключений до іншої мережі.
ur: نیچے دیے گئے تمام ٹیسٹوں کو مکمل کرنے کے لیے آپ کو ایک ہی Wi-Fi نیٹ ورک سے منسلک کم از کم دو ڈیوائسز کی ضرورت ہوگی، اور تیسرا بالکل مختلف نیٹ ورک پر۔

source: All of the tests will be performed using [public browsing](public-private.md). If something does not work as expected, please be patient and check the section on [troubleshooting](troubleshooting.md). Specifically, if the browser gets stuck for more than a couple of minutes while loading a page, you may hit stop and reload it (although this may alter results slightly).
ar: سيتم إجراء جميع الاختبارات باستخدام [التصفح العام](public-private.md). إذا كان هناك شيء لا يعمل كما هو متوقع، يرجى التحلي بالصبر والتحقق من القسم الخاص بـ [استكشاف الأخطاء وإصلاحها](troubleshooting.md). على وجه التحديد، إذا توقف المتصفح لأكثر من دقيقتين أثناء تحميل الصفحة، فيمكنك الضغط على إيقاف وإعادة تحميلها (على الرغم من أن هذا قد يؤدي إلى تغير النتائج بشكل طفيف).
fa: تمام تست‌ها با استفاده از [مرور عمومی](public-private.md) اجرا خواهند شد. اگر چیزی طبق انتظار کار نکرد، لطفاً بردبار باشید و بخش مربوط به [شناسایی و رفع اشکالات](troubleshooting.md) را چک کنید. به‌طور مشخص، اگر مرورگر در حین بارگذاری یک صفحه بیشتر از چند دقیقه گیر کرد، می‌توانید دکمه‌ی توقف را بفشارید و آن را از نو بارگذاری کنید (گرچه این کار ممکن است باعث تغییر اندکی در نتایج شود).
fr: Tous les tests seront effectués en mode de [navigation publique](public-private.md). Si quelque chose ne fonctionne pas comme prévu, soyez patient et consultez la section [Dépannage](troubleshooting.md). Plus particulièrement, si le navigateur reste bloqué pendant plus de deux minutes lors du chargement d’une page, vous pouvez l’arrêter et la recharger (bien que cela puisse légèrement modifier les résultats).
pt: Todos os testes serão performados usando [navegação pública](public-private.md). Se algo não funcionar como esperado, por favor, seja utente e verifique a secção sobre [solução de problemas](troubleshooting.md). Especificamente, se o navegador ficar travado por mais que alguns minutos ao carregar uma página, pode apertar interromper e atualizá-la (embora isso possa alterar levemente os resultados).
pt_br: Todos os testes serão performados usando [navegação pública](public-private.md). Se algo não funcionar como esperado, por favor, seja paciente e verifique a seção sobre [solução de problemas](troubleshooting.md). Especificamente, se o navegador ficar travado por mais de alguns minutos ao carregar uma página, você pode apertar interromper e atualizá-la (embora isso possa alterar levemente os resultados).
ru: Все тесты будут проводиться с использованием [публичного просмотра](public-private.md). Если что-то работает не так, как ожидалось, пожалуйста, наберитесь терпения и ознакомьтесь с разделом [устранение неполадок](troubleshooting.md). В частности, если браузер застревает при загрузке страницы более чем на пару минут, вы можете остановить и перезагрузить ее (хотя это может несколько изменить результаты).
tr: Tüm sınamalar [herkese açık gezinme](public-private.md) kullanılarak yapılır. Bir şeyler beklendiği gibi çalışmazsa lütfen sabırlı olun ve [sorun giderme](troubleshooting.md) bölümüne bakın. Tarayıcı bir sayfayı yüklerken bir kaç dakikadan daha uzun süre beklerse, durdurup yeniden yükleyebilirsiniz (sonuçları biraz etkileyebilir).
uk: Усі тести будуть проводитись з використанням [публічного перегляду](public-private.md). Якщо щось працює не так, як очікувалося, будь ласка, наберіться терпіння та ознайомтеся з розділом [усунення несправностей](troubleshooting.md). Зокрема, якщо браузер зависає при завантаженні сторінки більш ніж на пару хвилин, ви можете зупинити та перезавантажити її (хоча це може дещо змінити результати).
ur: تمام ٹیسٹ [عوامی براؤزنگ] (public-private.md) کے ذریعے کیے جائیں گے۔ اگر کوئی چیز توقع کے مطابق کام نہیں کرتی ہے، تو براہ کرم صبر کریں اور [خرابی کا سراغ لگانا](troubleshooting.md) پر سیکشن چیک کریں۔ خاص طور پر، اگر صفحہ لوڈ کرتے وقت براؤزر چند منٹ سے زیادہ کے لیے پھنس جاتا ہے، تو آپ اسے روک کر دوبارہ لوڈ کر سکتے ہیں (حالانکہ اس سے نتائج میں قدرے تبدیلی ہو سکتی ہے)۔

source: Accessing an injector
ar: الوصول إلى حاقن
fa: دسترسی به یک injector
fr: Accéder à un injecteur
my: ထိုးသွင်းဖိုင် ဝင်ရောက်သုံးစွဲခြင်း
pt: Aceder um injetor
pt_br: Acessando um injetor
ru: Доступ к инъектору
tr: Bir içerik ekleyiciye erişmek
uk: Доступ до ін'єктора
ur: ایک انجیکٹر تک رسائی حاصل کرنا

source: Let us first check whether your CENO Browser can reach an injector. This may look trivial, but your client will already be exercising several Ouinet features in the process: looking up the injector address in the injector swarm, trying to contact it directly and, if it is blocked by your access provider or country, looking up the bridge swarm and trying to contact the injector via some other Ouinet client.
fa: بیایید نخست چک کنیم که آیا مرورگر CENO شما می‌تواند به یک injector دسترسی پیدا کند. این شاید پیش‌پاافتاده به نظر بیاید، اما سرویس‌گیرنده‌ی شما پیشاپیش چندین ویژگی Ouinet را در این فرایند به کار خواهد بست: جست‌وجوی نشانی injector در انبوهه‌ی injector ها، تلاش برای تماس مستقیم با آن و، اگر این injector از سوی ارائه‌دهنده‌ی دسترسی یا کشورتان مسدود شده بود، جست‌وجوی انبوهه‌ی پل و تلاش برای تماس با injector از طریق یک سرویس‌گیرنده‌ی Ouinet.
ru: Сначала давайте проверим, может ли ваш Браузер CENO связаться с инъектором. Это может показаться тривиальным, но ваш клиент уже будет использовать несколько функций Ouinet: искать адрес инъектора в узле инъекторов, пытаться связаться с ним напрямую и, если он заблокирован вашим провайдером доступа или страной, искать узел моста и пытаться связаться с инъектором через какой-либо другой клиент Ouinet.
tr: Öncelikle CENO Browser uygulamanızın bir içerik ekleyicisine erişebilirliğini denetlememiz gerekiyor. Önemsiz gelebilir fakat istemciniz bu işlem sırasında birçok Ouinet özelliklerini de sınar. Bu işlemler; içerik ekleyici havuzundan adres denetiminin yapılması, doğrudan erişim ve internet hizmeti sağlayıcınız veya devletiniz tarafından engelleme yapılıyorsa köprü havuzundan başka bir Ouinet istemcisi ile içerik ekleyiciye erişilmeye çalışılmasıdır.
uk: Спочатку давайте перевіримо, чи ваш браузер CENO може зв'язатися з ін'єктором. Цей етап може здатися тривіальним, але він використовує відразу кілька функцій Ouinet: пошук адреси ін'єктора в «рої» ін'єкторів, спробу зв'язатися з ним безпосередньо і якщо він заблокований вашим провайдером доступу або країною, пошук мостів і спробу зв'язатися з ін'єктором через будь-який інший клієнт Ouinet.
ur: آئیے پہلے چیک کریں کہ آیا آپ کا CENO براؤزر کسی انجیکٹر تک پہنچ سکتا ہے۔ یہ معمولی نظر آسکتا ہے، لیکن آپ کا کلائنٹ پہلے سے ہی اس عمل میں کئی Ouinet خصوصیات کا استعمال کر رہا ہو گا: انجیکٹر کے بھیڑ میں انجیکٹر کا پتہ تلاش کرنا، اس سے براہ راست رابطہ کرنے کی کوشش کرنا اور، اگر اسے آپ کے رسائی فراہم کنندہ یا ملک نے بلاک کر دیا ہے، تو تلاش کرنا۔ پل بھیڑ اور کسی دوسرے Ouinet کلائنٹ کے ذریعے انجیکٹر سے رابطہ کرنے کی کوشش کر رہا ہے۔

source: In the first device perform the following steps:
ar: في الجهاز الأول، نفذ الخطوات التالية:
fa: در نخستین دستگاه این مرحله‌ها را اجرا کنید:
fr: Sur le premier appareil, effectuez les étapes suivantes :
my: ပထမစက်တွင် အောက်ပါ အဆင့်များကို လုပ်ဆောင်ပါ-
pt: No primeiro aparelho, realize as seguintes etapas:
pt_br: No primeiro dispositivo, realize as seguintes etapas:
tr: Birinci aygıtta şu adımları uygulayın:
uk: На першому пристрої виконайте такі дії:
ur: پہلے ڈیوائس میں درج ذیل اقدامات کریں:

source: First of all, install CENO and start it. Its home page will appear.
fa: پیش از هرچیز، CENO را نصب و اجرا کنید. صفحه‌ی خانگی آن ظاهر خواهد شد.
tr: Öncelikle CENO uygulamasını kurun ve başlatın. Giriş sayfası görüntülenir.
uk: Насамперед, встановіть CENO і запустіть його. З'явиться головна сторінка.
ur: سب سے پہلے، CENO انسٹال کریں اور اسے شروع کریں۔ اس کا ہوم صفحہ ظاہر ہوگا۔

source: Open the app's main menu and choose *CENO* to open the *CENO Settings* page. Since we only want to test injector access, uncheck all the boxes for content sources except *Via the CENO network (public)*.
fa: منوی اصلی نرم‌افزار را باز کنید و *CENO* را انتخاب کنید تا صفحه‌ی *تنظیمات CENO* باز شود. چون ما فقط می‌خواهیم دسترسی به injector را تست کنیم، تمام جعبه‌های مربوط به منابع محتوا به جز *از طریق شبکه‌ی (عمومی) سنو* را غیرفعال کنید.
tr: Uygulamanın ana menüsünü açın ve *CENO ayarlarını* açmak için *CENO* seçeneğine dokunun. Yalnızca içerik ekleyici erişimi sınaması yapacağımız için, içerik kaynakları kısmında *CENO ağı üzerinden (herkese açık)* seçeneği dışındaki tüm seçeneklerin işaretini kaldırın.
uk: Відкрийте головне меню програми та виберіть *CENO*, щоб відкрити сторінку *Налаштування CENO*. Оскільки ми хочемо перевірити лише доступ до ін'єктора, зніміть прапорці з джерел контенту, крім *У публічній мережі CENO*.
ur: ایپ کا مین مینو کھولیں اور *CENO ترتیبات* صفحہ کھولنے کے لیے *CENO* کا انتخاب کریں۔ چونکہ ہم صرف انجیکٹر تک رسائی کی جانچ کرنا چاہتے ہیں، اس لیے مواد کے ذرائع کے تمام خانوں سے نشان ہٹا دیں سوائے *بذریعہ CENO نیٹ ورک (عوامی)*۔

source: Go back to CENO's home page. Either select one of the recommended Web sites, or enter the URL of some other site at the address bar at the top of the window. If you know about a site which is usually blocked for you, go ahead and enter it!
fa: به صفحه‌ی خانگی CENO بازگردید. یا یکی از وب‌سایت‌های توصیه‌شده را انتخاب کنید، یا نشانی اینترنتی سایتی دیگر را در نوار نشانی بالای پنجره‌ی مرورگر وارد کنید. اگر سایتی را سراغ دارید که معمولاً برای شما مسدود شده است، نشانی همان سایت را وارد کنید!
my: CENO ၏ ပင်မ စာမျက်နှာသို့ ပြန်သွားပါ။ အကြံပြုထားသော ဝက်ဘ်ဆိုက်များမှ တစ်ခုကို ရွေးချယ်ပါ သို့မဟုတ် ဝင်းဒိုး၏ ထိပ်ဘက်ရှိ လိပ်စာဘားတွင် အခြားဆိုက်တစ်ခုခု၏ URL ကို ရိုက်ထည့်ပါ။ သင့်အတွက် ပိတ်ဆို့ထားလေ့ရှိသော ဆိုက်တစခုအကြောင်းသိပါက ရှေ့ဆက်ပြီး ၎င်းကို ရိုက်ထည့်ပါ။
ru: Вернитесь на домашнюю страницу CENO. Либо выберите один из рекомендованных веб-сайтов, либо введите URL-адрес другого сайта в адресной строке в верхней части окна. Если вы знаете сайт, который обычно для вас заблокирован, введите его!
tr: CENO giriş sayfasına geri dönün. Önerilen sitelerden birini seçin ya da pencerenin üst kısmındaki adres çubuğuna başka bir sitenin adresini yazın. Erişimeniz engellenen bir site biliyorsanız onu deneyin!
uk: Поверніться до домашньої сторінки CENO. Або оберіть один із рекомендованих веб-сайтів або введіть URL-адресу іншого сайту в адресному рядку у верхній частині вікна. Якщо ви знаєте сайт, який зазвичай для вас заблокований — введіть його!
ur: CENO کے ہوم صفحہ پر واپس جائیں۔ یا تو تجویز کردہ ویب سائٹس میں سے ایک کو منتخب کریں، یا ونڈو کے اوپری حصے میں ایڈریس بار میں کسی دوسری سائٹ کا URL درج کریں۔ اگر آپ کسی ایسی سائٹ کے بارے میں جانتے ہیں جو عام طور پر آپ کے لیے مسدود ہوتی ہے، تو آگے بڑھیں اور اسے درج کریں!

source: The chosen site should eventually show up.
ar: يجب أن يظهر الموقع الذي اخترته.
fa: سایت انتخاب‌شده باید سرانجام دیده شود.
fr: Le site choisi devrait finir par apparaître.
my: ရွေးချယ်ထားသော ဆိုက်သည် နောက်ဆုံးတွင် ပေါ်လာပါမည်။
pt: O website escolhido deve eventualmente aparecer.
pt_br: O website escolhido deve eventualmente aparecer.
ru: В итоге должен отобразиться нужный сайт.
tr: Seçtiğiniz site bir süre sonra açılır.
uk: У результаті має відобразитись потрібний сайт.
ur: منتخب کردہ سائٹ کو آخرکار ظاہر ہونا چاہیے۔

source: **Note:** If you get a fake page instead of a legitimate one, use the address bar to enter the site's URL with `https://` at the beginning (instead of `http://`) and repeat the test.
ar: **ملاحظة:** إذا حصلت على صفحة مزيفة بدلاً من الصفحة الحقيقية، فاستخدم شريط العنوان لإدخال عنوان URL الخاص بالموقع مع`https://`في البداية (بدلاً من `http://`) وكرر الإختبار.
fa: **نکته:** اگر به جای صفحه‌ی واقعی یک صفحه‌ی جعلی را دریافت می‌کنید، در ابتدای نشانی اینترنتی سایت در نوار آدرس (به جای `http://`) `https://` را وارد کنید و تست را تکرار کنید.
fr: **Note :** Si vous obtenez une fausse page au lieu d’une page authentique, utilisez la barre d’adresse pour entrer l’URL du site avec `https: //` au début (au lieu de `http: //`) et recommencez le test.
pt: **Nota:** Se obtiver uma página falsa ao invés de uma legítima, use a barra de endereço para inserir a URL do website com `https://` no começo (ao invés de `http://`) e repita o teste.
pt_br: **Nota:** Se você obtiver uma página falsa ao invés de uma legítima, use a barra de endereço para inserir a URL do website com `https://` no começo (ao invés de `http://`) e repita o teste.
tr: **Not:** Asıl site yerine sahte bir siteyle karşılaşırsanız, adres çubuğunda site adresinin başlangıcını `https://` olarak (`http://`yerine) değiştirin ve sınamayı yineleyin.
uk: **Примітка:** Якщо замість потрібної сторінки ви отримали фальшиву (наприклад, сторінку блокування), на початку використовуйте `https://` (замість `http://`) під час введення URL сайту в адресному рядку та повторіть тест.
ur: **نوٹ:** اگر آپ کو جائز کے بجائے جعلی صفحہ ملتا ہے تو ، سائٹ کا URL شروع میں (`http://` کی بجائے) 'https://' کے ساتھ درج کرنے کے لئے ایڈریس بار کا استعمال کریں اور ٹیسٹ کو دہرائیں۔

source: If the site does load, you can be happy that your device can reach the injector! Since you are able to query swarms and contact other clients, you are also likely to be able to retrieve content from the distributed cache.
ar: إذا تم تحميل الموقع، فيمكنك أن تكون سعيدًا لأن جهازك يمكنه الوصول إلى الحاقن! نظرًا لأنك قادر على الاستعلام عن الأسراب والاتصال بالعملاء الآخرين، فمن المحتمل أن تكون قادرًا على استرداد المحتوى من ذاكرة التخزين المؤقت الموزعة.
fa: اگر سایت بارگذاری نشد، می‌توانید خوشحال باشید که دستگاه‌تان می‌تواند به injector دسترسی پیدا کند! از آن‌جا که شما می‌توانید انبوهه‌ها را به پرسش بکشید و با سرویس‌گیرنده‌های دیگر تماس بگیرید، شما همچنین احتمالاً می‌توانید محتوای برگرفته از کش توزیع‌شده را بازیابی کنید.
fr: Si le site se charge, vous pouvez vous réjouir du fait que votre appareil puisse atteindre l’injecteur. Puisque vous pouvez interroger des essaims et contacter d’autres clients, il est aussi probable que vous puissiez également récupérer du contenu du cache distribué.
my: ဆိုက် အမှန်တကယ် တင်ပါက သင့်စက်သည် ထိုးသွင်းဖိုင်ကို ရောက်ရှိနိုင်သဖြင့် သင် ဝမ်းသာနိုင်ပါပြီ။ သင်သည် အုပ်စုများကို မေးမြန်းပြီး အခြားလက်ခံစက်များကို ဆက်သွယ်နိုင်သောကြောင့် သင်သည် ဖြန့်ချိထားသော ယာယီသိမ်းဆည်းထားသည့် မှတ်ဉာဏ်မှ အကြောင်းအရာကို ပြန်ထုတ်နိုင်ရန်လည်း ဖြစ်နိုင်ခြေရှိသည်။
pt: Se o website carregar, pode comemorar que o seu aparelho conseguiu alcançar o injetor! Por ter sido capaz de consultar enxames e contatar outros clientes, é provável que seja capaz, também, de recuperar conteúdo do cache distribuído.
pt_br: Se o website carregar, você pode comemorar que o seu dispositivo conseguiu alcançar o injetor! Por você ter sido capaz de consultar enxames e contatar outros clientes, é provável que seja capaz, também, de recuperar conteúdo do cache distribuído.
ru: Если сайт загружается, вы можете быть довольны тем, что ваше устройство может связаться с инъектором! Поскольку вы можете запрашивать узлы и связываться с другими клиентами, вы также, скорее всего, сможете получить содержимое из распределенного кэша.
tr: Site yüklenirse, aygıtınız içerik ekleyiciye erişebiliyor demektir! Havuz sorguları yapıp diğer istemcilerle iletişim kurabildiğiniz için dağıtılmış ön bellekten içerikleri de yükleyebiliyor olmalısınız.
uk: Якщо сайт завантажується, можна порадіти з того, що ваш пристрій може зв'язатися з ін'єктором! Оскільки ви можете запитувати вузли та зв'язуватися з іншими клієнтами, ви, швидше за все, зможете отримати вміст з розподіленого кеша.
ur: اگر سائٹ لوڈ ہو جاتی ہے، تو آپ خوش ہو سکتے ہیں کہ آپ کا ڈیوائس انجیکٹر تک پہنچ سکتا ہے! چونکہ آپ بھیڑ سے استفسار کرنے اور دوسرے کلائنٹس سے رابطہ کرنے کے قابل ہیں، اس لیے آپ کو تقسیم شدہ کیش سے مواد کی بازیافت کرنے کا بھی امکان ہے۔

source: By the way, if you push the CENO icon in the address bar, it will open a popup like the one below, showing how many elements from the site were retrieved form the different sources. Only *Via CENO network (public)* should have a non-zero value since the other sources were disabled.
fa: در ضمن، اگر علامت CENO در نوار نشانی را بفشارید، یک پنجره‌ی جدید مانند پنجره‌ی پایینی گشوده خواهد شد، که نشان می‌دهد چند عنصر از سایت از منابع متفاوت بازیابی شده است. فقط *از طریق شبکه‌ی (عمومی) CENO* باید یک ارزش غیر-صفر داشته باشد چرا که سایر منابع غیرفعال شده‌اند.
tr: Adres çubuğundaki CENO simgesine dokunursanız aşağıdaki gibi bir pencere açılır. Bu pencerede sitenin kaç parçasının farklı kaynaklardan yüklendiğini görebilirsiniz. Diğer kaynakları önceki adımda kapattığımız için yalnızca *CENO ağı üzerinden (herkese açık)* dışındaki tüm veriler sıfır olmalıdır.
uk: До речі, якщо натиснути на значок CENO в адресному рядку, відкриється спливаюче вікно (як показано нижче), яке показує, скільки елементів сайту було отримано з різних джерел. Тільки джерело *Через публічну мережу CENO* повинен мати ненульове значення, оскільки інші джерела було вимкнено.
ur: ویسے، اگر آپ ایڈریس بار میں CENO آئیکن کو دبائیں گے، تو یہ نیچے کی طرح ایک پاپ اپ کھولے گا، جس میں دکھایا جائے گا کہ سائٹ سے کتنے عناصر مختلف ذرائع سے حاصل کیے گئے تھے۔ صرف *بذریعہ CENO نیٹ ورک (عوامی)* کی غیر صفر قدر ہونی چاہیے کیونکہ دیگر ذرائع غیر فعال تھے۔

source: ![Figure: Sources used when testing injection](images/sources-inject.png)
ar: ![الشكل: المصادر المستخدمة عند اختبار الحقن](images/sources-inject.png)
fa: ![شکل: منابع به‌کار رفته هنگام تست injection](images/sources-inject.png)
fr: ![Figure: Sources utilisées lors de tests d’injection](images/sources-inject.png)
pt: ![Figura: Sources usadas ao testar a injeção](images/sources-inject.png)
pt_br: ![Figura: Sources usadas ao testar a injeção](images/sources-inject.png)
tr: ![Görsel: İçerik ekleyici sınanırken kullanılan kaynaklar](images/sources-inject.png)
uk: ![Малюнок: Джерела, що використовуються при тестуванні ін'єкцій](images/sources-inject.png)
ur: ![تصویر: انجیکشن کی جانچ کرتے وقت استعمال ہونے والے ذرائع](images/sources-inject.png)
