Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/testing.po
Languages: ar, fa, fr, my, pt, pt_br, ru, tr, uk, ur

source: Please leave CENO running on the first device as with the previous test, and stop CENO on the second device (by showing its notifications and pushing "Tap to stop"). This time you will need a third device, but it must be connected to a different Wi-Fi network (maybe another friend can help from home). The steps to follow for that device are exactly the same as those in the previous test.
my: ကျေးဇူးပြု၍ ယခင် စမ်းသပ်မှုမှ ပထမ စက်ပေါ်တွင် CENO ကို ဆက်လက် လုပ်ဆောင်စေပြီး ဒုတိယ စက်ပေါ်တွင် (၎င်း၏ သတိပေးချက်များကို ပြသပြီး "ရပ်ရန် နှိပ်ပါ" ကို နှိပ်ခြင်းဖြင့်) CENO ကို ရပ်တန့်လိုက်ပါ။ ဤအကြိမ်တွင် သင်သည် တတိယစက်ကို လိုအပ်မည် ဖြစ်သော်လည်း ၎င်းကို ကွဲပြားသော Wi-Fi ကွန်ရက်သို့ ချိဆက်ထားရမည် (အခြားသူငယ်ချင်းတစ်ဦးက အိမ်မှ ကူညီကောင်း ကူညီနိုင်ပါမည်)။ ထိုစက်အတွက် လုပ်ဆောင်ရမည့် အဆင့်များမှာ ယခင် စမ်းသပ်မှုမှ အဆင့်များနှင့် လုံးဝ တူညီပါသည်။
ru: Пожалуйста, оставьте CENO запущенным на первом устройстве, как и в предыдущем тесте, и остановите CENO на втором устройстве (показав его уведомления и нажав “Нажмите чтобы остановить"). На этот раз вам понадобится третье устройство, но оно должно быть подключено к другой сети Wi-Fi (возможно, вам поможет другой друг из дома). Для этого устройства необходимо выполнить те же действия, что и в предыдущем тесте.

source: All the tests will be performed using [public browsing](public-private.md). If something does not work as expected, please be patient and check the section on [troubleshooting](troubleshooting.md). Specifically, if the browser gets stuck for more than a couple of minutes while loading a page, you may hit stop and reload it (although this may alter results slightly).
my: စမ်းသပ်မှုအားလုံးကို [အများသုံး ရှာဖွေမှု](public-private.md) အသုံးပြု၍ လုပ်ဆောင်ပါမည်။ တစ်စုံတစ်ရာ မျှော်လင့်ထားသည့်အတိုင်း ဖြစ်မလာပါက ကျေးဇူးပြု၍ စိတ်ရှည်ပြီး [ပြဿနာဖြေရှင်းခြင်း](troubleshooting.md) ရှိ အပိုင်းကို စစ်ဆေးပါ။ တိတိကျကျ ဆိုရလျှင် စာမျက်နှာ တင်နေစဉ် ဘရောက်ဇာသည် နှစ်မိနစ်ထက်ပို၍ ကပ်နေလျှင် သင်သည် ရပ်တန့်ရန် နှိပ်ပြီး ၎င်းကို ပြန်တင်နိုင်ပါသည် (သို့သော် ယင်းသည် ရလဒ်များကို အနည်းငယ် ပြောင်းလဲနိုင်သည်)။

source: Let us first check whether your CENO Browser can reach an injector. This may look trivial but your client will already be exercising several Ouinet features in the process: looking up the injector address in the injector swarm, trying to contact it directly and, if it is blocked by your access provider or country, looking up the bridge swarm and trying to contact the injector via some other Ouinet client.
my: ပထမဦးစွာ သင့် CENO ဘရောက်ဇာသည် ထိုးသွင်းဖိုင်ကို ရောက်နိုင်ခြင်း ရှိ၊ မရှိ စစ်ဆေးကြည့်ရအောင်။ ယင်းသည် မပြောပလောက်ဟု ထင်ရသော်လည်း သင့်လက်ခံစက်သည် လုပ်ငန်းစဉ်တွင် Ouinet လုပ်ဆောင်ချက် အနည်းငယ်ကို ကျင့်သုံးပြီး ဖြစ်နေပါမည်- ထိုးသွင်းဖိုင် အုပ်စုတွင် ထိုးသွင်းဖိုင် လိပ်စာကို ရှာကြည့်ခြင်း၊ ၎င်းကို တိုက်ရိုက် ဆက်သွယ်ရန် ကြိုးစားခြင်းနှင့် ၎င်းကို သင်၏ ဝင်ရောက်သုံးစွဲခွင့်ပေးသူ သို့မဟုတ် နိုင်ငံက ပိတ်ဆို့ထားပါက ပေါင်းကူး အုပ်စုတွင် ရှာကြည့်ပြီး ထိုးသွင်းဖိုင်ကို အခြား Ouinet လက်ခံစက်တစ်ခုခုမှတစ်ဆင့် ဆက်သွယ်ရန် ကြိုးစားခြင်း။

source: First of all, install CENO if needed and start it. On the first run a series of introductory screens will appear: just click on *NEXT* until *START BROWSING* appears, then click it. In the end, CENO's home page will appear.
my: ပထမဦးစွာ လိုအပ်ပါက CENO ကို ထည့်သွင်းပြီး စတင်ပါ။ ပထမအကြိမ် လုပ်ဆောင်ချိန်တွင် မိတ်ဆက် မျက်နှာပြင် တစ်ခုပြီးတစ်ခု ပေါ်လာပါမည်။ *စတင် ရှာဖွေမည်*ပေါ်လာသည်အထိ *ရှေ့သို့* ကိုသာနှိပ်ပြီးနောက် ၎င်းကို နှိပ်ပါ။ အဆုံးတွင် CENO ၏ ပင်မ စာမျက်နှာပေါ်လာပါမည်။

source: After completing the test above on the first device, leave CENO running on it (the CENO icon should appear in its notification bar). Then get hold of a second device (you can invite a friend over to do the test) and connect it to the same Wi-Fi network. Then follow the steps below on that device:
my: အထက်ပါ စမ်းသပ်မှုကို ပထမစက်တွင် ပြီးစီးပြီးနောက် CENO ကို ၎င်းတွင် လုပ်ဆောင်ထားပါ (CENO အိုင်ကွန်သည် ၎င်း၏ သတိပေးအချက်ပြမှုဘားတွင် ပေါ်လာပါမည်)။ ထို့နောက် ဒုတိယစက်ကို ယူပြီး (သင်သည် စမ်းသပ်မှု ပြုလုပ်ရန် သူငယ်ချင်းတစ်ယောက်ကို ဖိတ်နိုင်သည်) ၎င်းကို တူညီသော Wi-Fi ကွန်ရက်သို့ ချိတ်ဆက်ပါ။ ထို့နောက် ထိုစက်တွင် အောက်ပါအဆင့်များကို လုပ်ဆောင်ပါ-

source: If the third device can load the site used for the test, you are all set. The first device is able to seed content to others, and it can most probably also act as a bridge. Congratulations!
my: တတိယစက်သည် စမ်းသပ်မှုအတွက် အသုံးပြုသော ဆိုက်ကို တင်နိုင်ပါက သင်သည် အသင့်ဖြစ်နေပါပြီ။ ပထမစက်သည် အခြားစက်များသို့ အကြောင်းအရာ တင်ပို့နိုင်ပြီး ၎င်းသည် ပေါင်းကူးအဖြစ်လည်း လုပ်ဆောင်နိုင်ခြေ များသည်။ ဂုဏ်ယူပါသည်။
