Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/testing.po
Languages: ar, fa, fr, my, pt, pt_br, ru, tr, uk, ur

source: Now that you know how to [install](install.md) and [configure](settings.md) Ceno, let us follow some steps to test whether different Ouinet-specific features work. This will involve selectively enabling and disabling different access mechanisms. Keep in mind however that in day-to-day usage of Ceno, you will seldom need to change the default settings at all.
ar: الآن بعد أن عرفت كيفية [تثبيت](install.md) و [تهيئة](settings.md) Ceno، دعنا نتبع بعض الخطوات لاختبار ما إذا كانت الميزات المختلفة الخاصة بـ Ouinet تعمل أم لا. سيشمل هذا تمكين وتعطيل آليات الوصول المختلفة بشكل انتقائي. ضع في اعتبارك أنه أثناء الاستخدام اليومي لـ Ceno، نادرًا ما ستحتاج إلى تغيير الإعدادات الافتراضية.
fr: Maintenant que vous savez comment [installer](install.md) et [configurer](settings.md) Ceno, suivons quelques étapes pour tester le fonctionnement de différents aspects de Ouinet. Nous activerons et désactiverons sélectivement différents mécanismes d’accès. Gardez cependant à l’esprit que dans l’utilisation quotidienne de Ceno, vous ne devrez que rarement modifier les paramètres par défaut.
pt: Agora que sabe como [instalar](install.md) e [configurar](settings.md) o Ceno, permita-nos seguir alguns passos para testar se algumas funcionalidades específicas da Ouinet funcionam. Essa ação envolve ativar e desativar seletivamente diferentes mecanismos de acesso. Lembre-se, contudo, que no uso diário do Ceno raramente precisará modificar as configurações padrão.
pt_br: Agora que você sabe como [instalar](install.md) e [configurar](settings.md) o Ceno, permita-nos seguir alguns passos para testar se algumas funcionalidades específicas da Ouinet funcionam. Essa ação envolve habilitar e desabilitar seletivamente diferentes mecanismos de acesso. Lembre-se, contudo, de que no uso diário do Ceno você raramente precisará modificar as configurações padrão.

source: Let us first check whether your Ceno Browser can reach an injector. This may look trivial, but your client will already be exercising several Ouinet features in the process: looking up the injector address in the injector swarm, trying to contact it directly and, if it is blocked by your access provider or country, looking up the bridge swarm and trying to contact the injector via some other Ouinet client.
ar: دعنا نتحقق أولاً مما إذا كان متصفح Ceno الخاص بك يمكنه الوصول إلى حاقنٍ ما. قد يبدو هذا بديهيًا، لكن سوف يمارس عميلك العديد من ميزات Ouinet في هذه العملية: البحث عن عنوان الحاقن في سرب الحاقنات، ومحاولة الاتصال به مباشرة، وإذا تم حظره بواسطة مزود الوصول أو البلد، سيحاول البحث عن سرب الجسور ومحاولة الاتصال بالحاقن عبر بعض عملاء Ouinet الآخرين.
fr: Vérifions d’abord si votre Navigateur Ceno peut atteindre un injecteur. Cela peut sembler anodin, mais votre client fera déjà appel à plusieurs fonctions de Ouinet au cours de processus : il cherchera l’adresse de l’injecteur dans l’essaim d’injecteurs, essaiera de le contacter directement et, s’il est bloqué par votre fournisseur d’accès ou votre pays, il cherchera l’essaim de ponts et essaiera de contacter l’injecteur grâce à un autre client Ouinet.
pt: Vamos primeiramente verificar se o seu Navegador Ceno consegue alcançar um injetor. Essa ação pode parecer trivial, mas o seu cliente já estará exercitando diversas funcionalidades da Ouinet nesse processo: procurar o endereço do injetor no enxame de injetores, tentar contatá-lo diretamente e, se ele estiver bloqueado pelo seu provedor de acesso ou país, procurar um enxame de pontes e tentar contatar o injetor via algum outro cliente Ouinet.
pt_br: Vamos primeiramente verificar se o seu Navegador Ceno consegue alcançar um injetor. Essa ação pode parecer trivial, mas o seu cliente já estará exercitando diversas funcionalidades da Ouinet nesse processo: procurar o endereço do injetor no enxame de injetores, tentar contatá-lo diretamente e, se ele estiver bloqueado pelo seu provedor de acesso ou país, procurar um enxame de pontes e tentar contatar o injetor via algum outro cliente Ouinet.

source: First of all, install Ceno and start it. Its home page will appear.
ar: في البداية، قم بتثبيت Ceno وابدأ تشغيله. سوف تظهر صفحته الرئيسية.
fr: Commencez par installer Ceno et démarrez-le. Sa page d’accueil apparaîtra.
pt: Primeiramente, instale o Ceno e o inicie. A página de início aparecerá.
pt_br: Primeiramente, instale o Ceno e o inicie. A página de início aparecerá.

source: Open the app's main menu and choose *Ceno* to open the *Ceno Settings* page. Since we only want to test injector access, uncheck all the boxes for content sources except *Via the Ceno network (public)*.
pt_br: Abra o menu principal do aplicativo e escolha *Ceno* para abrir a página *Configurações do Ceno*. Já que apenas queremos testar o acesso do injetor, desmarque todas as caixas para sources de conteúdo exceto *Via rede do Ceno (pública)*.

source: Go back to Ceno's home page. Either select one of the recommended Web sites, or enter the URL of some other site at the address bar at the top of the window. If you know about a site which is usually blocked for you, go ahead and enter it!
ar: عد للصفحة الرئيسية لـ Ceno. يمكنك إما تحديد أحد مواقع الويب الموصى بها، أو إدخال عنوان URL موقع آخر في شريط العناوين أعلى النافذة. إذا كنت تعرف موقعًا يتم حظره عادةً، فلا تتردد في إدخاله!
fr: Retournez à la page d’accueil de Ceno. Sélectionnez l’un des sites Web recommandés ou entrez l’URL d’un autre site dans la barre d’adresse supérieure. Si vous connaissez un site qui est habituellement bloqué pour vous, n’hésitez pas à le saisir.
pt: Retorne à página inicial do Ceno. Selecione um dos websites recomendados ou entre a URL de algum outro website na barra de endereço no topo da janela. Se conhece um website que é frequentemente bloqueado para si, continue e insira-o!
pt_br: Retorne à página inicial do Ceno. Selecione um dos websites recomendados ou entre a URL de algum outro website na barra de endereço no topo da janela. Se conhece um website que é frequentemente bloqueado para você, continue e insira-o!

source: By the way, if you push the Ceno icon in the address bar, it will open a popup like the one below, showing how many elements from the site were retrieved form the different sources. Only *Via Ceno network (public)* should have a non-zero value since the other sources were disabled.
ar: بالمناسبة، إذا قمت بالضغط على أيقونة Ceno في شريط العناوين، فسيتم فتح نافذة منبثقة مثل الموجودة أدناه، والتي توضح عدد العناصر التي تم استردادها من الموقع من المصادر المختلفة. المصدر *عبر شبكة Ceno (العامة)* دون غير يجب أن يكون له قيمة غير الصفر بما أنه تم تعطيل المصادر الأخرى.
fr: D’ailleurs, si vous touchez l’icône Ceno dans la barre d’adresse, une fenêtre surgissante telle que celle ci-dessous s’ouvrira, indiquant le nombre d’éléments du site récupérés de différentes sources. Seule *Par le réseau Ceno (public)* devrait avoir une valeur différente de zéro puisque les autres sources ont été désactivées.
pt: A propósito, se pressionar o ícone do Ceno na barra de endereço, ele abrirá um popup como o abaixo, mostrando quantos elementos do website foram recuperados das diferentes sources. Somente em *Via rede Ceno (pública)* deve haver um valor diferente de zero, dado que as outras sources estavam desativadas.
pt_br: A propósito, se você pressionar o ícone do Ceno na barra de endereço, ele abrirá um popup como o abaixo, mostrando quantos elementos do website foram recuperados das diferentes sources. Somente em *Via rede Ceno (pública)* deve haver um valor diferente de zero, dado que as outras sources estavam desabilitadas.

source: In contrast, if you had used private browsing with default settings, you may have seen a popup like the one below, with non-zero counts in *Direct from website* or *Via Ceno network (private)*.
pt_br: Em contrapartida, se usou a navegação privativa com configurações padrão, você pode ter visto um popup como o abaixo, com contagens diferentes de zero em *Direto do website* ou *Via rede Ceno (privativa)*.

source: Since your first device was able to get some content from an injector, let us test if it is able to share it with another device over the distributed cache. The simplest way is to use Ceno's device-to-device support to check whether getting and verifying signed content works.
ar: بما أن جهازك الأول كان قادرًا على الحصول على محتوى ما من حاقن، فلنختبر ما إذا كان قادرًا على مشاركته مع جهاز آخر عبر ذاكرة التخزين المؤقت الموزعة. إنّ أبسط طريقة هي استخدام دعم Ceno من جهاز إلى جهاز للتحقق مما إذا كان الحصول على محتوى الموقع والتحقق منه يعمل.
fr: Puisque votre premier appareil a pu obtenir du contenu d’un injecteur, testons sa capacité à le partager avec un autre appareil grâce au cache distribué. La façon la plus simple est d’utiliser la prise en charge du transfert d’appareil à appareil de Ceno pour vérifier si l’obtention et la vérification de contenus signés fonctionnent.
pt: Visto que o seu aparelho foi capaz de obter algum conteúdo de um injetor, vamos testar se ele consegue compartilhá-lo com outro aparelho através do cache distribuído. A maneira mais simples é usar o suporte aparelho a aparelho do Ceno para verificar se a obtenção e verificação de conteúdo assinado funcionam.
pt_br: Visto que seu dispositivo foi capaz de obter algum conteúdo de um injetor, vamos testar se ele consegue compartilhá-lo com outro dispositivo através do cache distribuído. A maneira mais simples é usar o suporte dispositivo a dispositivo do Ceno para verificar se a obtenção e verificação de conteúdo assinado funcionam.

source: After successfully completing the test above on the first device, leave Ceno running on it (the Ceno icon should appear in its notification bar). Then get hold of a second device (you can invite a friend over to help test) and connect it to the same Wi-Fi network. Next, follow the steps below on the second device:
ar: بعد إكمال الاختبار أعلاه بنجاح على الجهاز الأول، اترك Ceno يعمل عليه (يجب أن يظهر رمز Ceno في شريط الإشعارات الخاص به). ثم احصل على جهاز ثانٍ (يمكنك دعوة صديق للمساعدة في الاختبار) وتوصيله بنفس شبكة Wi-Fi. بعد ذلك، اتبع الخطوات أدناه على الجهاز الثاني:
fr: Après avoir effectué avec succès le test ci-dessus sur le premier appareil, laissez Ceno tourner sur celui-ci (l’icône Ceno devrait apparaître dans sa barre de notification). Procurez-vous ensuite un deuxième appareil (vous pouvez inviter un ami pour vous aider à tester) et connectez-le au même réseau Wi-Fi. Ensuite, suivez les étapes ci-dessous sur le deuxième appareil :
pt: Após completar com sucesso o teste acima no primeiro aparelho, deixe o Ceno continuar a ser executado nele (o ícone do Ceno deve aparecer na barra de notificações). Consiga, então, um segundo aparelho (pode convidar uma pessoa amiga para ajudar no teste) e conecte à mesma rede WiFi. Depois, siga as etapas abaixo para o segundo aparelho:
pt_br: Após completar com sucesso o teste acima no primeiro dispositivo, deixe o Ceno continuar a ser executado nele (o ícone do Ceno deve aparecer na barra de notificações). Consiga, então, um segundo dispositivo (você pode convidar uma pessoa amiga para ajudar no teste) e conecte à mesma rede WiFi. Depois, siga as etapas abaixo para o segundo dispositivo:

source: Install Ceno if needed and start it as above.
ar: قم بتثبيت Ceno إذا لزم الأمر وابدأ كما هو مذكور أعلاه.
fr: Installez Ceno si cela est nécessaire et démarrez-le comme indiqué ci-dessus.
pt: Instale o Ceno se necessário e inicie como acima.
pt_br: Instale o Ceno se necessário e inicie como acima.

source: Open the *Ceno Settings* page as above. Since we only want to test distributed cache access, uncheck all the boxes for content sources except *Shared by other Ceno users*.
ar: افتح صفحة *إعدادات Ceno* على النحو الوارد أعلاه. نظرًا لأننا نريد فقط اختبار الوصول إلى ذاكرة التخزين المؤقت الموزعة، قم بإلغاء تحديد جميع المربعات الخاصة بمصادر المحتوى باستثناء *تم مشاركته من قبل مستخدمي Ceno الآخرين*.
fr: Ouvrez la page *Paramètres de Ceno* comme indiqué ci-dessus. Puisque nous voulons seulement tester l’accès au cache distribué, décochez toutes les cases des sources de contenu sauf *Partagé par d’autres utilisateurs de Ceno*.
pt: Abra a página *Configurações do Ceno* como acima. Já que apenas desejamos testar o acesso ao cache distribuído, desmarque as caixas para sources de conteúdo exceto *Compartilhado por outros utilizadores Ceno*.
pt_br: Abra a página *Configurações do Ceno* como acima. Já que apenas desejamos testar o acesso ao cache distribuído, desmarque as caixas para sources de conteúdo exceto *Compartilhado por outros usuários Ceno*.

source: Go back to Ceno's home page and visit the same site in the same manner as you did above (i.e. by selecting one of the recommended web sites or entering its URL in the address bar).
ar: ارجع إلى الصفحة الرئيسية لـ Ceno وقم بزيارة نفس الموقع بنفس الطريقة التي قمت بها أعلاه (أي عن طريق اختيار أحد مواقع الويب الموصى بها أو إدخال عنوان URL الخاص به في شريط العناوين).
fr: Retournez à la page d’accueil de Ceno et visitez le même site de la même façon que ci-dessus (c.-à-d. en sélectionnant l’un des sites Web recommandés ou en saisissant son URL dans la barre d’adresse).
pt: Volte à página inicial do Ceno e visite o mesmo website da mesma maneira que fez acima (isto é, a selecionar os websites recomendados ou entrar a sua URL na barra de endereço).
pt_br: Volte para a página inicial do Ceno e visite o mesmo website da mesma maneira que você fez acima (isto é, selecionando os websites recomendados ou entrando sua URL na barra de endereço).

source: If it works, it means that both devices are able to deliver that content to other clients. Pushing the Ceno address bar icon should show a popup like the one below, where only *Shared by other Ceno users* has a non-zero value.
ar: إذا نجح الأمر، فهذا يعني أن كلا الجهازين قادرين على توصيل هذا المحتوى إلى عملاء آخرين. يجب أن يؤدي الضغط على رمز شريط عنوان Ceno إلى إظهار نافذة منبثقة مثل الموجودة أدناه، حيث يكون خيار *تم مشاركته من قبل مستخدمي Ceno الآخرين* فقط دون غيره يظهر قيمة غير الصفر.
fr: Si cela fonctionne, les deux appareils peuvent remettre ce contenu à d’autres clients. Toucher l’icône Ceno de la barre d’adresse devrait afficher une fenêtre surgissante telle que celle ci-dessous, dans laquelle seule *Partagé par d’autres utilisateurs de Ceno* a une valeur non nulle.
pt: Caso funcione, significa que ambos os aparelhos são capazes de entregar aquele conteúdo para outros clientes. Apertar o ícone da barra de endereço do Ceno deve mostrar um popup como o abaixo, no qual somente *Compartilhado por outros utilizadores Ceno* possui um valor diferente de zero.
pt_br: Caso funcione, significa que ambos os dispositivos são capazes de entregar aquele conteúdo para outros clientes. Apertar o ícone da barra de endereço do Ceno deve mostrar um popup como o abaixo, no qual somente *Compartilhado por outros usuários Ceno* possui um valor diferente de zero.

source: Finally, you may have also noticed that there is a counter for *Shared by you*. This is not a different source *per se*: elements counted here are indeed part of the distributed cache, but they happen to already be stored in your device, so Ceno does not need to retrieve them over the network.
ar: أخيرًا، ربما لاحظت أيضًا وجود عداد لـ *تم مشاركته من طرفك*. هذا ليس مصدرًا مختلفًا *في حد ذاته*: العناصر التي تم عدها هنا هي في الواقع جزء من ذاكرة التخزين المؤقت الموزعة، ولكن تصادف أنها مخزنة بالفعل في جهازك، لذلك لا يحتاج Ceno إلى استعادتها عبر الشبكة.
fr: Pour finir, vous avez peut-être aussi remarqué le compteur *Contenu partagé par vous*. Ce n’est pas vraiment une source différente : les éléments comptabilisés ici font effectivement partie du cache distribué, mais ils sont déjà enregistrés dans votre appareil et Ceno n’a donc pas besoin de les récupérer sur le réseau.
pt: Finalmente, também pode ter notado que há um contador para *Compartilhado por si*. Essa não é uma source diferente *em si*: elementos contados aqui são, de fato, parte do cache distribuído. Porém, eles já estão armazenados no seu aparelho, então o Ceno não precisa recuperá-los ao longo da rede.
pt_br: Finalmente, você também pode ter notado que há um contador para *Compartilhado por você*. Essa não é uma source diferente *em si*: elementos contados aqui são, de fato, parte do cache distribuído. Porém, eles já estão armazenados no seu dispositivo, então o Ceno não precisa recuperá-los ao longo da rede.

source: After successfully completing the test above, leave Ceno running on the first device as with the previous test, and stop Ceno on the second device (by showing its notifications and pushing "Tap to stop").
ar: بعد إكمال الاختبار أعلاه بنجاح، اترك Ceno قيد التشغيل على الجهاز الأول كما في الاختبار السابق، وأوقف Ceno على الجهاز الثاني (من خلال إظهار الإشعارات والضغط على "انقر للإيقاف").
fr: Après avoir mené à bien le test ci-dessus, laissez Ceno tourner sur le premier appareil comme pour le test précédent et arrêtez Ceno sur le deuxième appareil (en affichant ses notifications et en touchant « Toucher pour arrêter »).
pt: Após completar com sucesso o teste acima, mantenha a execução do Ceno no primeiro aparelho como no teste anterior e interrompa o Ceno no segundo aparelho (para interromper, exiba as notificações do Ceno e pressione "Toque para interromper").
pt_br: Após completar com sucesso o teste acima, mantenha a execução do Ceno no primeiro dispositivo como no teste anterior e interrompa o Ceno no segundo dispositivo (para interromper, exiba as notificações do Ceno e pressione "Toque para interromper").

source: On the first device perform the following steps:
ru: На первом устройстве выполните следующие действия:

source: First of all, install CENO and start it. On the first run, a series of introductory screens will appear: just click on *NEXT* until *START BROWSING* appears, then click it. In the end, CENO's home page will appear.
ru: Прежде всего, установите CENO и запустите его. При первом запуске появится ряд вводных экранов: просто нажмите на *NEXT*, пока не появится *START BROWSING*, затем нажмите на него. В конце появится главная страница CENO.

source: Open the app's main menu and choose *CENO* to open the *CENO Settings* page. Since we only want to test injector access, uncheck all the boxes for access mechanisms except *Via the CENO network (public)*.
my: *CENO ဆက်တင်များ* စာမျက်နှာကို ဖွင့်ရန် အက်ပ်၏ အဓိက မီနူးကို ဖွင့်ပြီး *CENO* ကို ရွေးချယ်ပါ။ ကျွန်ုပ်တို့သည် ထိုးသွင်းဖိုင် ဝင်ရောက်သုံးစွဲခွင့်ကိုသာ စမ်းသပ်လိုသောကြောင့် ဝင်ရောက်သုံးစွဲခွင့် စက်ကိရိယာများအတွက် *CENO ကွန်ရက်မှတစ်ဆင့် (အများသုံး)* မှလွဲ၍ အကွက်အားလုံးကို အမှန်ခြစ်ဖြုတ်ပါ။
ru: Откройте главное меню приложения и выберите *CENO*, чтобы открыть страницу *Настройки CENO*. Поскольку мы хотим проверить только доступ к инжектору, снимите флажки со всех механизмов доступа, кроме *В публичной сети CENO*.

source: By the way, if you push the CENO icon in the address bar, it will open a popup like the one below, showing how many elements from the site were retrieved using each of the different access mechanisms. Only *Via CENO network (public)* should have a non-zero value since the other mechanisms were disabled.
my: စကားမစပ် သင်သည် လိပ်စာဘားရှိ CENO အိုင်ကွန်ကို နှိပ်ပါက ၎င်းသည် အောက်ပါ သတိပေးချက်ကဲ့သို့ သတိပေးချက်တစ်ခုကို ပွင့်စေပြီး ကွဲပြားသော ဝင်ရောက်သုံးစွဲခွင့်ဆိုင်ရာ စက်ကိရိယာများမှ တစ်ခုစီကို အသုံးပြု၍ ဆိုက်မှ အကြောင်းအရာ မည်မျှကို ပြန်ထုတ်ခဲ့ကြောင်း ပြသပါမည်။ အခြားစက်ကိရိယာများကို ပိတ်ထားသောကြောင့် *CENO ကွန်ရက်မှတစ်ဆင့် (အများသုံး) တွင်သာ သုညမဟုတ်သော တန်ဖိုး ရှိသင့်သည်။
ru: Кстати, если нажать на значок CENO в адресной строке, откроется всплывающее окно, как показано ниже, показывающее, сколько элементов с сайта было получено с помощью каждого из различных механизмов доступа. Только *В публичной сети CENO* должно иметь ненулевое значение, поскольку другие механизмы будут отключены.

source: ![Figure: Mechanisms used when testing injection](images/sources-inject.png)
my: ![ပုံ-ထိုးသွင်းမှုကို စမ်းသပ်စဉ် အသုံးပြုသော စက်ကိရိယာများ](images/sources-inject.png)
ru: ![Рисунок: Схемы, используемые при тестировании инъекций](images/sources-inject.png)

source: ![Figure: Mechanisms used with private browsing](images/sources-proxy.png)
my: ![ပုံ- သီးသန့် ရှာဖွေမှုနှင့် အသုံးပြုသော စက်ကိရိယာများ](images/sources-proxy.png)
ru: ![Рисунок: Схемы, используемые при приватном просмотре] (images/sources-proxy.png)

source: After completing the test above on the first device, leave CENO running on it (the CENO icon should appear in its notification bar). Then add a second device (you can invite a friend over to help test) and connect it to the same Wi-Fi network. Next, follow the steps below on that device:
ru: После выполнения описанной выше проверки на первом устройстве оставьте CENO запущенным на нем (значок CENO должен появиться в панели уведомлений). Затем добавьте второе устройство (вы можете пригласить друга, чтобы помочь с тестированием) и подключите его к той же сети Wi-Fi. Затем выполните описанные ниже действия на этом устройстве:

source: Install CENO if needed, start it and proceed to CENO's home page as above.
my: လိုအပ်ပါက CENO ကို ထည့်သွင်းပါ၊ ၎င်းကို စတင်ပြီး အထက်ပါအတိုင်း CENO ၏ ပင်မ စာမျက်နှာသို့ ဆက်သွားပါ။
ru: Установите CENO, если необходимо, запустите его и перейдите на домашнюю страницу CENO, как указано выше.

source: Open the *CENO Settings* page as above. Since we only want to test distributed cache access, uncheck all the boxes for access mechanisms except *Shared by other CENO users*.
my: *CENO ဆက်တင်များ* စာမျက်နှာကို အထက်ပါအတိုင်း ဖွင့်ပါ။ ကျွန်ုပ်တို့သည် ဖြန့်ချိထားသော ယာယီသိမ်းဆည်းထားသည့် မှတ်ဉာဏ် ဝင်ရောက်သုံးစွဲခွင့်ကိုသာ စမ်းသပ်လိုသောကြောင့် *အခြား CENO သုံးစွဲသူများက မျှဝေထားသည်* မှလွဲ၍ ဝင်ရောက်သုံးစွဲခွင့် စက်ကိရိယာများအတွက် အကွက်အားလုံးကို အမှန်ခြစ်ဖြုတ်ပါ။
ru: Откройте страницу *Настройки CENO*, как указано выше. Поскольку мы хотим протестировать только распределенный доступ к кэшу, снимите флажки со всех механизмов доступа, кроме *Предоставленным другими пользователями CENO*.

source: ![Figure: Mechanisms used when testing distributed cache retrieval](images/sources-dcache.png)
my: ![ပုံ- ဖြန့်ချိထားသော ယာယီသိမ်းဆည်းထားသည့် မှတ်ဉာဏ် ပြန်ထုတ်မှုကို စမ်းသပ်ချိန်တွင် အသုံးပြုသော စက်ကိရိယာများ](images/sources-dcache.png)
ru: ![Рисунок: Схемы, используемые при тестировании распределенного поиска кэша](images/sources-dcache.png)

source: Finally, you may have also noticed that there is a counter for *Shared by you*. This is not a different mechanism *per se*: elements counted here are indeed part of the distributed cache, but they happen to already be stored in your device, so CENO does not need to retrieve them over the network.
ru: Наконец, вы, возможно, заметили, что есть счетчик *Предоставлено вами*. Это не другой механизм *как таковой*: элементы, учитываемые здесь, действительно являются частью распределенного кэша, но они уже хранятся на вашем устройстве, поэтому CENO не нужно извлекать их по сети.
