Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/troubleshooting.po
Languages: ar, de, es, fa, fr, id, my, pt, pt_br, ru, tr, uk, ur

source: No other client can reach an injector. Since it is unlikely that all injectors are simultaneously down, that may mean that you can only reach Ouinet clients which are themselves affected by similar network interference as yours.
ar: لا يمكن لأي عميل آخر الوصول إلى حاقن. نظرًا لأنه من غير المحتمل أن تكون جميع المحاقن معطلة في وقت واحد، فقد يعني ذلك أنه لا يمكنك الوصول إلا لعملاء Ouinet الذين يتأثرون أيضًا بتداخل شبكة مشابه لتداخلك.
de: Kein anderer Client kann einen Injektor erreichen. Da es unwahrscheinlich ist, dass alle Injektoren gleichzeitig ausfallen, kann dies bedeuten, dass Sie nur Ouinet-Clients erreichen können, die selbst von ähnlichen Netzstörungen betroffen sind wie Sie.
es: Ningún otro cliente puede alcanzar a un inyector. Ya que es improbable que todos los inyectores estén caídos simultáneamente, eso podría significar que solamente puedes alcanzar clientes Ouinet que están afectados por una interferencia de red similar a la tuya.
fa: هیچ سرویس‌گیرنده‌ی دیگری نمی‌تواند به یک انژکتور دسترسی پیدا کند. از آن‌جا که بعید است که تمام انژکتورها همزمان از کار بیفتند، که شاید به این معنا باشد که شما فقط می‌توانید به گروهی از سرویس‌گیرندگان وینت دسترسی پیدا کنید که خودشان تحت تأثیر اختلالی در شبکه مشابه اختلال شما باشند.
fr: Aucun autre client ne peut atteindre un injecteur. Comme il est peu probable que tous les injecteurs soient en panne simultanément, cela peut signifier que vous ne pouvez atteindre que les clients Ouinet qui sont eux-mêmes affectés par des interférences réseau similaires aux vôtres.
id: Tidak ada klien lain yang dapat menjangkau injektor. Karena tidak mungkin semua injektor mati secara bersamaan, itu mungkin berarti bahwa Anda hanya dapat menjangkau klien Ouinet yang terpengaruh oleh gangguan jaringan yang sama dengan Anda.
my: အခြား မည်သည့်လက်ခံစက်ကမျှ ထိုးသွင်းဖိုင်သို့ မရောက်ရှိနိုင်ပါ။ ထိုးသွင်းဖိုင်အားလုံး တစ်ပြိုင်တည်း ပျက်ခြင်းမှာ မဖြစ်နိုင်သောကြောင့် သင့်စက်ကဲ့သို့ အလားတူ ကွန်ရက် ကြားဝင်နှောင့်ယှက်မှုကြောင့် အကျိုးသက်ရောက်မှု ခံရသည့် Ouinet လက်ခံစက်များကိုသာ သင် ရောက်ရှိနိုင်ခြင်း ဖြစ်နိုင်သည်။
pt: Nenhum outro cliente consegue alcançar o injetor. Por ser improvável que todos os injetores estejam simultaneamente inativos, isso pode significar que apenas pode alcançar clientes Ouinet que estejam afetados por uma interferência na rede similar à sua.
pt_br: Nenhum outro cliente consegue alcançar o injetor. Por ser improvável que todos os injetores estejam simultaneamente inativos, isso pode significar que você apenas pode alcançar clientes Ouinet que estejam afetados por uma interferência na rede similar à sua.
ru: Ни один другой клиент не может связаться с инъектором. Поскольку маловероятно, что все инъекторы перестали работать одновременно, это может означать, что вы можете связаться только с теми клиентами Ouinet, которые сами подвержены тому же вмешательству в их работу, что и вы.
tr: Herhangi bir içerik ekleyiciye erişebilen istemci olmaması. Tüm içerik ekleyicilerinin aynı anda kapalı olmasının olasılığı düşük olduğundan yalnızca bağlantınızdaki gibi bulundukları ağa karışılan istemcilere erişiyor olabilirsiniz.
uk: Жоден інший клієнт не може звʼязатися з інʼєктором. Оскільки малоймовірно, що всі інʼєктори перестали працювати одночасно, це може означати, що Ви можете звʼязатися тільки з тими клієнтами Ouinet, у яких, як і у Вас, теж є проблеми з мережевими перешкодами.
ur: کوئی دوسرا کلائنٹ انجیکٹر تک نہیں پہنچ سکتا۔ چونکہ اس بات کا امکان نہیں ہے کہ تمام انجیکٹر بیک وقت نیچے ہوں، اس کا مطلب یہ ہو سکتا ہے کہ آپ صرف Ouinet کلائنٹس تک پہنچ سکتے ہیں جو خود آپ کی طرح نیٹ ورک کی مداخلت سے متاثر ہیں۔

source: This can happen when all traffic leaving or entering the country you are in is interrupted. Ceno would resort in this case to getting and using the content from the distributed cache, even if it is stale.
ar: يمكن أن يحدث هذا عند قطع حركة المرور التي تغادر أو تدخل البلد الذي تتواجد فيه. يلجأ Ceno في هذه الحالة إلى الحصول على المحتوى من ذاكرة التخزين المؤقت الموزعة واستخدامها، حتى لو كان قديمًا.
de: Dies kann passieren, wenn der gesamte Verkehr, der das Land, in dem Sie sich befinden, verlässt oder betritt, unterbrochen wird. Ceno würde in diesem Fall die Inhalte aus dem verteilten Cache abrufen und verwenden, auch wenn sie veraltet sind.
es: Esto puede pasar cuando todo el tráfico saliendo o entrando al país en el que estás es interrumpido. En este caso, Ceno recurriría a obtener y usar el contenido desde la caché distribuída, aún si no está actualizado.
fr: Cela peut se produire lorsque tout le trafic sortant ou entrant dans le pays dans lequel vous vous trouvez est interrompu. Dans ce cas, Ceno aurait recours à l'obtention et à l'utilisation du contenu du cache distribué, même s'il est obsolète.
id: Hal ini dapat terjadi ketika semua lalu lintas yang keluar atau masuk ke negara tempat Anda berada sedang terganggu. Ceno dalam hal ini akan menggunakan cara untuk mendapatkan dan menggunakan konten dari tembolok terdistribusi, meskipun konten tersebut sudah basi.
pt: Tal situação pode acontecer quando todo o tráfego que sai ou entra no país em que se encontra estiver interrompido. O Ceno iria recorrer, nesse caso, à obtenção e ao uso do conteúdo do cache distribuído, mesmo se estiver obsoleto.
pt_br: Tal situação pode acontecer quando todo o tráfego saindo ou entrando no país em que você se encontra estiver interrompido. O Ceno iria recorrer, nesse caso, à obtenção e ao uso do conteúdo do cache distribuído, mesmo se estiver obsoleto.
ru: Это может произойти, когда весь трафик, выходящий или входящий в страну, в которой вы находитесь, прерван. В этом случае Ceno прибегает к получению и использованию контента из распределенного кэша, даже если он устарел.
tr: Bulunduğunuz ülkedeki tüm ağ trafiğine karışıldığında bu durum ortaya çıkabilir. CENO, eski olsa bile dağıtılmış ön bellekteki içerikleri yüklemeye çalışır.
ur: یہ اس وقت ہو سکتا ہے جب آپ جس ملک میں ہیں وہاں سے نکلنے یا داخل ہونے والی تمام ٹریفک میں خلل پڑتا ہے۔ Ceno اس معاملے میں تقسیم شدہ کیش سے مواد حاصل کرنے اور استعمال کرنے کا سہارا لے گا، چاہے وہ پرانا ہی کیوں نہ ہو۔

source: Again, as Ceno and Ouinet become more popular, the chances increase that there are at least a few clients that do have some kind of access to international sites. Even if access is precarious, a single Ouinet client able to inject some content into the country could suffice to enable it to spread (over the distributed cache) without further need to access the outside world.
ar: مرة أخرى، مع زيادة شعبية Ceno و Ouinet، تزداد فرص وجود عدد من العملاء لديهم وصول ما إلى المواقع الدولية. حتى إذا كان الوصول رديئا، فإن عميل Ouinet وحيد قادر على ضخ بعض المحتوى للدولة قد يكون كافياً لتمكينه من الانتشار (عبر ذاكرة التخزين المؤقت الموزعة) دون الحاجة إلى الوصول إلى العالم الخارجي.
de: Auch hier gilt: Je populärer Ceno und Ouinet werden, desto wahrscheinlicher ist es, dass es zumindest einige wenige Kunden gibt, die in irgendeiner Form Zugang zu internationalen Websites haben. Selbst wenn der Zugang prekär ist, könnte ein einziger Ouinet-Client, der einige Inhalte in das Land einspeisen kann, ausreichen, um sie (über den verteilten Cache) zu verbreiten, ohne dass ein weiterer Zugang zur Außenwelt erforderlich ist.
es: De nuevo, en la medida en que Ceno y Ouinet se tornen más populares, se incrementan las oportunidades de que haya al menos unos pocos clientes que sí tengan alguna clase de acceso a sitios internacionales. Aún si el acceso es precario, un único cliente Ouinet capaz de inyectar algún contenido dentro del país podría bastar para prmitir que se difunda (sobre la caché distribuída) sin necesidad ulterior de acceder al mundo exterior.
fr: Encore une fois, à mesure que Ceno et Ouinet deviennent plus populaires, il y a de plus en plus de chances qu'au moins quelques clients aient accès à des sites internationaux. Même si l'accès est précaire, un seul client Ouinet capable d'injecter du contenu dans le pays pourrait suffire à lui permettre de se propager (sur le cache distribué) sans avoir besoin d'accéder à l'extérieur.
pt: Novamente, conforme Ceno e Ouinet se tornarem mais populares, aumentarão as chances de que haja ao menos alguns clientes com algum tipo de acesso a websites internacionais. Mesmo se o acesso for precário, um único cliente Ouinet capaz de injetar algum conteúdo dentro do país pode ser suficiente para permitir que ele se propague (através do cache distribuído) sem necessidade de aceder o mundo exterior.
pt_br: Novamente, conforme Ceno e Ouinet se tornarem mais populares, aumentarão as chances de que haja ao menos alguns clientes com algum tipo de acesso a websites internacionais. Mesmo se o acesso for precário, um único cliente Ouinet capaz de injetar algum conteúdo dentro do país pode ser suficiente para permitir que ele se propague (através do cache distribuído) sem necessidade de acessar o mundo exterior.
ru: Опять же, по мере роста популярности Ceno и Ouinet увеличивается вероятность того, что есть хотя бы несколько клиентов, имеющих доступ к международным сайтам. Даже если доступ нестабилен, одного клиента Ouinet, способного передавать некоторый контент в страну, может быть достаточно, чтобы он распространялся (через распределенный кэш) без необходимости дальнейшего доступа к внешнему миру.
tr: CENO ve Ouinet yaygınlaştıkça, uluslararası sitelere bir şekilde erişebilen en az birkaç istemci bulunma olasığı artar. Erişim güvenli olmasa bile, ülkeye bir parça içerik ekleyebilen tek bir Ouinet istemcisi, ülke dışına erişmeye gerek kalmadan (dağıtılmış ön bellek üzerinden) içeriğin yayılmasını sağlamaya yeterli olabilir.
ur: ایک بار پھر، جیسے Ceno اور Ouinet زیادہ مقبول ہو جاتے ہیں، اس بات کے امکانات بڑھ جاتے ہیں کہ کم از کم چند کلائنٹس ایسے ہیں جن کی بین الاقوامی سائٹس تک کسی قسم کی رسائی ہے۔ یہاں تک کہ اگر رسائی ناگزیر ہے، تو ایک واحد Ouinet کلائنٹ جو ملک میں کچھ مواد داخل کرنے کے قابل ہو اسے باہر کی دنیا تک رسائی کی مزید ضرورت کے بغیر اسے پھیلانے کے لیے کافی ہو سکتا ہے۔

source: Finally, we do run some Ouinet clients with good connectivity in (hopefully) censorship-free countries to try to avoid those two situations, but please note that clients with such stable Internet addresses could get blocked as well.
ar: أخيرًا، نقوم بتشغيل بعض عملاء Ouinet الذين لديهم اتصال جيد في (نأمل ذلك) دول خالية من الرقابة لمحاولة تجنب هاتين الحالتين، ولكن يرجى ملاحظة أنه يمكن حظر العملاء الذين لديهم عناوين إنترنت مستقرة أيضًا.
de: Schließlich betreiben wir einige Ouinet-Clients mit guten Verbindungen in (hoffentlich) zensurfreien Ländern, um diese beiden Situationen zu vermeiden, aber bitte beachten Sie, dass auch Clients mit solchen stabilen Internetadressen blockiert werden können.
es: Finalmente, nosotra(o)s administramos algunos clientes Ouinet con buena conectividad en países (esperemos) libres de censura para intentar evitar esas dos situaciones, pero por favor ten en cuenta que clientes con direcciones de Internet de tal estabilidad también podrían ser bloqueados.
fa: سرانجام، ما برخی سرویس‌گیرندگان وینت را با اتصال خوبی در کشورهای عاری از سانسور (امیدواریم) تلاش می‌کنند از این دو وضعیت اجتناب کنند، اما لطفاً دقت کنید که سرویس‌گیرندگان با چنین نشانی‌های اینترنتی باثباتی بتوانند مسدود هم شوند.
fr: Enfin, nous servons certains clients Ouinet avec une bonne connectivité dans des pays (espérons-le) sans censure pour essayer d'éviter ces deux situations, mais veuillez noter que les clients avec des adresses Internet aussi stables pourraient également être bloqués.
id: Akhirnya, kami menjalankan beberapa klien Ouinet dengan konektivitas yang baik di negara-negara yang (mudah-mudahan) bebas dari penyensoran untuk mencoba menghindari dua situasi tersebut, tetapi harap dicatat bahwa klien dengan alamat internet yang stabil seperti itu juga bisa diblokir.
my: နောက်ဆုံးတွင် ကျွန်ုပ်တို့သည် ထိုအခြေအနေနှစ်ရပ်ကို ကြိုးစားရှောင်ရှားရန် ဆင်ဆာမလုပ်သည့် (မျှော်လင့်ရသော) နိုင်ငံများတွင် ချိတ်ဆက်မှုအားကောင်းသော Ouinet လက်ခံစက်အချို့ကို လုပ်‌ဆောင်သော်လည်း ထိုကဲ့သို့ တည်ငြိမ်သော အင်တာနက် လိပ်စာများ ရှိသည့် လက်ခံစက်များသည်လည်း ပိတ်ဆို့ခံရနိုင်ကြောင်း ကျေးဇူးပြု၍ သတိပြုပါ။
pt: Por fim, executamos alguns clientes Ouinet com boa conectividade em (esperamos) países livres de censura para tentar evitar essas duas situações. Porém, note que clientes com tais endereços de Internet estáveis poderiam ser igualmente bloqueados.
pt_br: Por fim, nós executamos alguns clientes Ouinet com boa conectividade em (esperamos) países livres de censura para tentar evitar essas duas situações. Porém, note que clientes com tais endereços de Internet estáveis poderiam ser igualmente bloqueados.
ru: Наконец, мы сами поддерживаем несколько клиентов Ouinet с хорошим соединением в странах, свободных (надеемся) от цензуры, чтобы попытаться избежать этих двух ситуаций, но, пожалуйста, обратите внимание, что клиенты с такими стабильными интернет-адресами также могут быть заблокированы.
tr: Bu iki durumdan kaçınmaya çalışmak için (umarız ki) sansürsüz ülkelerde iyi bağlantısı olan bazı Ouinet istemcileri işletiyoruz. Ancak internet adresleri sabit olan böyle istemcilerin de engellenebileceğini unutmayın.
uk: Зрештою, ми самі підтримуємо кілька клієнтів Ouinet із хорошим зʼєднанням у вільних від цензури країнах (ми сподіваємося), щоб спробувати уникнути таких двох ситуацій, але, будь ласка, майте на увазі: клієнти з такими стабільними Інтернет-адресами також можуть бути заблоковані.
ur: آخر میں، ہم ان دو حالات سے بچنے کی کوشش کرنے کے لیے (امید ہے کہ) سنسر شپ سے پاک ممالک میں اچھی کنیکٹیویٹی کے ساتھ کچھ Ouinet کلائنٹس چلاتے ہیں، لیکن براہ کرم نوٹ کریں کہ ایسے مستحکم انٹرنیٹ ایڈریس والے کلائنٹس بھی بلاک ہو سکتے ہیں۔

source: Distributed cache
ar: ذاكرة التخزين المؤقت الموزعة
de: Verteilter Cache
es: Caché distribuída
fa: انبار توزیع‌شده
fr: Cache distribué
id: Tembolok terdistribusi
my: ဖြန့်ချိထားသော ယာယီသိမ်းဆည်းထားသည့် မှတ်ဉာဏ်
pt: Cache distribuído
pt_br: Cache distribuído
ru: Распределенный кэш
tr: Dağıtılmış ön bellek
uk: Розподілений кеш
ur: تقسیم شدہ کیش

source: Keep in mind that an absolute requirement to be able to retrieve any content from the distributed cache is that it has already been injected by some other Ceno or Ouinet user. This means that popular content is more likely to eventually get injected and replicated in a natural manner, while more obscure content is less so, unless someone takes care of using Ceno or some other Ouinet client to inject and keep seeding it (which may further expose them to some [risks](../concepts/risks.md)).
ar: ضع في اعتبارك أنه للتمكن من استرداد أي محتوى من ذاكرة التخزين المؤقت الموزعة يجب بالضرورة أن يكون قد تم حقنه بواسطة مستخدم Ceno أو Ouinet آخر. هذا يعني أنه من المرجح أن يتم حقن المحتوى الشائع ونسخه بطريقة طبيعية، في حين أن المحتوى الأقل شعبية يكون أقل من ذلك، ما لم يقم شخص ما باستخدام Ceno أو عميل آخر لـ Ouinet لحقن المحتوى ومواصلة نشره (مما قد يؤدي إلى تعريضهم لبعض [المخاطر](../concepts/risks.md)).
de: Denken Sie daran, dass eine unbedingte Voraussetzung für den Abruf von Inhalten aus dem verteilten Cache ist, dass sie bereits von einem anderen Ceno- oder Ouinet-Benutzer eingespeist wurden. Das bedeutet, dass populäre Inhalte mit größerer Wahrscheinlichkeit auf natürliche Weise injiziert und repliziert werden, während dies bei obskuren Inhalten weniger der Fall ist, es sei denn, jemand kümmert sich darum, Ceno oder einen anderen Ouinet-Client zu verwenden, um sie zu injizieren und weiter zu verbreiten (was ihn weiteren [Risiken](../concepts/risks.md) aussetzen kann).
es: Ten en mente que un requerimiento absoluto para ser capaz de descargar algún contenido desde la caché distribuída es que ya haya sido inyectado por algún otra(o) usuaria(o) de Ouinet o Ceno. Esto significa que un contenido popular es más probable que sea inyectado y replicado eventualmente en una manera natural, mientras que el contenido más oscuro lo es en menor medida, a menos que alguien se haga cargo de usar Ceno o algún otro cliente Ouinet para inyectarlo y mantenerse sembrándolo (lo cual podría exponerlos más a algunos [riesgos](../concepts/risks.md)).
fr: Gardez à l'esprit qu'une exigence absolue pour pouvoir récupérer tout contenu du cache distribué est qu'il ait déjà été injecté par un autre utilisateur Ceno ou Ouinet. Cela signifie que le contenu populaire est plus susceptible d'être éventuellement injecté et répliqué de manière naturelle, tandis que le contenu plus obscur l'est moins, à moins que quelqu'un ne prenne soin d'utiliser Ceno ou un autre client Ouinet pour l'injecter et continuer à le semer (ce qui peut exposer davantage à certains [risques](../concepts/risks.md)).
id: Perlu diingat bahwa persyaratan mutlak untuk dapat mengambil konten apa pun dari tembolok terdistribusi adalah konten tersebut telah disuntikkan oleh pengguna Ceno atau Ouinet lainnya. Ini berarti bahwa konten yang populer lebih mungkin untuk disuntikkan dan direplikasi secara alami, sementara konten yang kurang begitu jelas, kecuali jika seseorang menggunakan Ceno atau klien Ouinet lainnya untuk menyuntikkan dan terus menyebarkannya (yang selanjutnya dapat membuat mereka terpapar pada beberapa [risiko](../concepts/risks.md)).
pt: Tenha em mente que um requisito absoluto para conseguir recuperar qualquer conteúdo do cache distribuído é tal conteúdo já ter sido injetado por algum outro utilizador do Ceno ou da Ouinet. Ou seja, muito provavelmente conteúdos populares serão injetados e replicados de maneira orgânica e conteúdos mais desconhecidos, não. A menos que alguém se disponha a usar Ceno ou algum outro cliente Ouinet para injetá-lo e o manter semeando (o que pode gerar ainda mais exposição a alguns [riscos](../concepts/risks.md)).
pt_br: Tenha em mente que um requisito absoluto para conseguir recuperar qualquer conteúdo do cache distribuído é tal conteúdo já ter sido injetado por algum outro usuário do Ceno ou da Ouinet. Ou seja, muito provavelmente conteúdos populares serão injetados e replicados de maneira orgânica e conteúdos mais desconhecidos, não. A menos que alguém se disponha a usar Ceno ou algum outro cliente Ouinet para injetá-lo e o manter semeando (o que pode gerar ainda mais exposição a alguns [riscos](../concepts/risks.md)).
ru: Имейте в виду, что абсолютным требованием для получения любого контента из распределенного кэша является то, что он уже был загружен другим пользователем Ceno или Ouinet. Это означает, что популярный контент будет загружен в сеть с большей вероятностью, а специализированный — с меньшей, если только кто-то не будет целенаправленно распространять его через Ceno или другой клиент Ouinet (что может дополнительно подвергнуть его некоторым [рискам](../concepts/risks.md)).
tr: herhangi bir içeriği dağıtılmış ön bellekten alabilmek için, bu içeriğin başka bir CENO veya Ouinet kullanıcısı tarafından daha önce eklenmiş olması gerektiğini unutmayın. Yaygın içeriklerin doğal bir şekilde eklenme ve çoğaltılma olasılığı daha yüksekken az bilinen içerikler birisi tarafından CENO veya başka bir Ouinet istemcisi ile eklenip gönderilmek üzere ilgilenilmediği sürece (bu da onları bazı [tehlikelerle](../concepts/risks.md) karşı karşıya bırakabilir) daha azdır.
ur: اس بات کو ذہن میں رکھیں کہ تقسیم شدہ کیش سے کسی بھی مواد کو بازیافت کرنے کے قابل ہونے کے لئے ایک مطلق ضرورت یہ ہے کہ اسے پہلے ہی کسی دوسرے Ceno یا Ouinet صارف کے ذریعہ انجیکشن لگایا گیا ہے۔ اس کا مطلب یہ ہے کہ مقبول مواد کے بالآخر قدرتی انداز میں انجیکشن اور نقل کیے جانے کا امکان زیادہ ہوتا ہے، جب کہ زیادہ غیر واضح مواد کم ہوتا ہے، جب تک کہ کوئی Ceno یا کسی دوسرے Ouinet کلائنٹ کو انجیکشن لگانے اور اسے سیڈنگ کرنے کا خیال نہ رکھے (جو انہیں کچھ مزید [خطرات](../concepts/risks.md)) میں بے نقاب کر سکتا ہے۔
