Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/troubleshooting.po
Languages: ar, de, es, fa, fr, id, my, pt, pt_br, ru, tr, uk, ur

source: Keep in mind that an absolute requirement to be able to retrieve any content from the distributed cache is that it has already been injected by some other CENO or Ouinet user. This means that popular content is more likely to eventually get injected and replicated in a natural manner, while more obscure content is less so, unless someone takes care of using CENO or some other Ouinet client to inject and keep seeding it (which may further expose them to some [risks](../concepts/risks.md)).
fa: به خاطر داشته باشید که یک پیش‌نیاز مطلق برای تواناشدن به بازیابی هر محتوا از انبار توزیع‌شده این است که این پیشاپیش به‌وسیله‌ی یک کاربر دیگر سنو یا وینت تزریق شده است. این به معنای آن است که محتوای پرطرفدار به احتمال قوی سرانجام به سیاقی طبیعی تزریق می‌شود و بازساخته می‌شود، در حالی که محتوای مبهم‌تر کم‌تر چنین است، مگر آن‌که کسی مراقب استفاده از سنو یا سرویس‌گیرنده‌ی دیگری از وینت باشد تا آن را تزریق کند و به بذرپاشی‌اش ادامه دهد (که شاید آن‌ها را هرچه بیشتر در معرض [خطرات](../concepts/risks.md) قرار دهد).
my: ဖြန့်ချိထားသော ယာယီသိမ်းဆည်းထားသည့် မှတ်ဉာဏ်မှ မည်သည့်အကြောင်းအရာကိုမဆို ပြန်ထုတ်နိုင်ရန် ထိုအကြောင်းအရာကို အခြား CENO သို့မဟုတ် Ouinet သုံးစွဲသူက ထိုးသွင်းပြီးဖြစ်ရန် မရှိမဖြစ် လိုအပ်ကြောင်း သတိပြုပါ။ ဆိုလိုသည်မှာ လူကြိုက်များသော အကြောင်းအရာကို နောက်ဆုံးတွင် ထိုးသွင်းနိုင်ပြီး သဘာဝကျသော နည်းလမ်းဖြင့် ပွားရန် ဖြစ်နိုင်ခြေ ပိုများသည်။ သို့သော် တစ်စုံတစ်ယောက်က ပိုမိုလူသိနည်းသော အကြောင်းအရာကို ထိုးသွင်းရန်နှင့် ဆက်လက်တင်ပို့နေရန် CENO သို့မဟုတ် အခြား Ouinet လက်ခံစက်တစ်ခုခုကို အသုံးပြု၍ တာဝန်မယူပါက (တာဝန်ယူခြင်းသည် ထိုသူအား အချို့သော [စွန့်စားမှုများ](../concepts/risks.md) ကို ထပ်မံကြုံတွေ့စေနိုင်သည်) ထိုအကြောင်းအရာကို သဘာဝကျစွာ ပွားယူရန် ဖြစ်နိုင်ခြေ ပိုနည်းသည်။
uk: Майте на увазі, що абсолютною вимогою для отримання будь-якого вмісту з розподіленого кешу є те, що він вже був завантажений іншим користувачем CENO або Ouinet. Це означає, що популярний вміст буде завантажений в мережу з більшою ймовірністю, а спеціалізований – з меншою, якщо хтось не буде цілеспрямовано поширювати його через CENO або інший клієнт Ouinet (що може додатково наразити його на деякі [ризики](../concepts/risks.md)).

source: CENO automatically switches to the more secure HTTPS protocol to access sites which would otherwise be accessed using plain, insecure HTTP. This is done by the embedded [HTTPS by default][HTTPS by default] extension when you enter a bare domain name like `example.com` or an HTTP URL like `http://example.com/…` in the location bar, or when you follow a link with such a URL in a page.
my: CENO သည် လုံခြုံမှုမရှိသော HTTP ကဲ့သလို့သော ဆိုက်အစား ပိုမို စိတ်ချလုံခြုံသော HTTPS protocol သို့ အလိုအလျောက်ပြောင်းလဲပြီး ရယူပေးပါသည်။ ဤအရာကို [HTTPS by default][HTTPS by default] မြှုပ်နှံထားသော extension မှ လုပ်ဆောင်ပေးခြင်းဖြစ်ပြီး သင်သည် တည်နေရာဘားတွင် `example.com`ကဲ့သို့သော ဒိုမိန်းတစ်ခု သို့မဟုတ် `http://example.com/…`ကဲ့သို့သော HTTP URL တစ်ခုကို ထည့်သွင်းလိုက်သောအခါ သို့မဟုတ် စာမျက်နှာတစ်ခုတွင် ပါဝင်သော URL link ကို နှိပ်လိုက်သောအခါ အလိုအလျောက် လုပ်ဆောင်ပေးခြင်းဖြစ်ပါသည်။
uk: CENO автоматично перемикається на більш безпечний протокол HTTPS для доступу до сайтів, до яких можна було б отримати доступ за допомогою звичайного, незахищеного HTTP. Це робиться за допомогою вбудованого розширення [HTTPS by default][HTTPS by default], коли ви вводите тільки доменне ім’я, наприклад, `example.com` або URL-адресу HTTP, як-от `http://example.com/…`, у відповідному полі браузера, або коли ви переходите за посиланням із такою URL-адресою на сторінці.

source: The automatic switching to HTTPS is done to prevent someone from intercepting an HTTP connection and directing it to an illegitimate server, resulting in bogus content (like a block message). This kind of hijacking is trivial to detect with HTTPS, so CENO can work around it instead of being tricked into loading the bogus content.
my: HTTPS သို့ အလိုအလျောက် ပြောင်းလဲပေးခြင်းသည် HTTP ချိတ်ဆက်မှုတွင် တစ်စုံတစ်ယောက်ထံမှ ကြားဖြတ်ခံရခြင်း နှင့် တရားမဝင်သော ဆာဗာများသို့ ရောက်ရှိသွားခြင်းမှ အကြောင်းအရာအတုများ ရရှိလာခြင်း (ဥပမာ - ပိတ်ဆို့ခံရကြောင်း မက်ဆေ့ချ်)တို့ကို ကာကွယ်ပေးရန်အတွက် ပြုလုပ်ထားခြင်းဖြစ်ပါသည်။ ယခုကဲ့သို့ အပိုင်စီးခြင်းလုပ်ရပ်သည် HTTPS နှင့် စမ်းသပ်ရှာဖွေလျှင် အသေးအဖွဲမျှသာ ဖြစ်ပါသည်၊ ထို့ကြောင့် CENO သည် အကြောင်းအရာအတုများ ပေါ်လာခြင်းကဲ့သို့သော လှည့်စားခြင်းမျိုးတို့မခံရဘဲ အလုပ်လုပ်နိုင်ပါသည်။
uk: Автоматичне перемикання на HTTPS здійснюється, щоб запобігти перехопленню HTTP-з’єднання з боку зловмисників та подальшого його перенаправлення на сервер зловмисників, що веде на фальшивий контент (наприклад, повідомлення щодо блокування). Цей вид викрадення є простим для виявлення за допомогою HTTPS, тому CENO може обійти це перехоплення замість того, аби завантажувати фальшивий контент.

source: Although very unusual, some sites do not support HTTPS, and no access mechanism will work for them. If you are completely sure that this is the case for a site which just failed to load in CENO, you can edit its URL in the location bar, change `https://` to `http://`, and try again.
my: ဖြစ်လေ့ဖြစ်ထမရှိသော်လည်း တချို့သောဆိုက်များသည် HTTPS ကို မထောက်ပံ့ပါ၊ ၎င်းတို့အတွက် ဝင်ရောက်သုံးစွဲခွင့် စက်ကိရိယာများကိုလည်း အလုပ်လုပ်ခွင့်မပေးပါ။ အကယ်၍များ သင့်အနေဖြင့် CENO တွင် ဤကဲ့သို့သော ကိစ္စမျိုးဖြင့် ဆိုက်တစ်ခုကို ဝင်ရောက်ကြည့်ရှုလို့မရသောအခါ တည်နေရာဘားတွင် `https://` အစား`http://`ဟုပြောင်းလဲ ပြင်ဆင်လိုက်ပြီးမှ ပြန်လည် စမ်းကြည့်ပါ။
uk: Хоча це звучить доволі дивно сьогодні, однак деякі сайти досі не підтримують HTTPS, і жоден механізм доступу для цих сайтів не працює. Якщо ви стовідсотково впевнені у сайті, який щойно не завантажився в CENO, ви можете відредагувати його URL-адресу вручну у відповідному полі браузера, змінивши "https://" на "http://" і спробувати завантажити ще раз.

source: In the app's main menu, choose *Tools / Add-ons*.
my: အက်ပ်၏ အဓိက မီနူးထဲတွင် *Tools/ Add-ons*ကိုရွေးပါ။

source: Tap on *HTTPS by default*. You will see that extension's settings page.
my: *HTTPS by default*ကို နှိပ်ပါ။ ထိုအဆက်၏ ဆက်တင်စာမျက်နှာကို မြင်ရပါမည်။

source: **Note:** In the unfortunate case that a site is only accessible via HTTP, and it is also being hijacked by a censor, you will need to go to the [Settings page](settings.md), disable Origin access, and try again. Please note that this setting affects all sites, and it is not remembered by CENO for subsequent runs. We encourage you to contact the site administrators and tell them to enable HTTPS support.
my: **မှတ်ချက်** ကံမကောင်းစွာဖြင့် ဆိုက်တစ်ခုသည် HTTP ဖြင့်သာ ဝင်ရောက်နိုင်ပြီး၊ ဆင်ဆာတစ်ခုမှ ထိန်းချုပ်ခြင်းကိုလည်း ခံနေရပါက၊ [ဆက်တင်စာမျက်နှာ](settings.md) ကို သွားပါ၊ မူလဝင်ရောက်သုံးစွဲခွင့်ကို ပိတ်ပါ၊ ထို့နောက် ပြန်လည် ကြိုးစားကြည့်ပါ။ ယခုဆက်တင်သည် ဆိုက်များအားလုံးကို သက်ရောက်မှုရှိကြောင်း၊ နောက်ထပ်ရှာဖွေ အလုပ်လုပ်ခြင်းများအတွက် CENO မှ မမှတ်မိနိုင်ကြောင်းကို ‌ကျေးဇူးပြုပြီး သတိထားပါ။ ဝဘ်ဆိုက် ထိန်းချုပ်သူများကို ဆက်သွယ်ပြီး HTTPS ထောက်ပံ့မှုကို ပြုလုပ်ရန်ပြောခြင်းကို ကျွန်ုပ်တို့ တိုက်တွန်းလိုက်ပါသည်။
uk: **Примітка.** Якщо сайт доступний лише через незахищенний протокол HTTP, і його перехопив цензор, вам потрібно буде перейти на [сторінку налаштувань](settings.md), вимкнути доступ до Origin, і спробуйте ще раз. Зверніть увагу, що цей параметр впливає на всі сайти, і CENO не запам’ятовує його для наступних запусків. Ми радимо вам зв’язатися з адміністраторами сайту та порадити їм увімкнути підтримку захищенного протоколу HTTPS.

source: This may happen when you used an old version of CENO to visit a blocked site in the past, and someone intercepted the connection and directed it to an illegitimate server. CENO then remembered that redirection, and now it automatically opens the later site when trying to visit the former.
my: ပိတ်ထားသော ဆိုက်တစ်ခုကို ကြည့်ရှုဖို့ CENO ဗားရှင်းအဟောင်းကို အသုံးပြုသောအခါ တစ်စုံတစ်ယောက်က ဆက်သွယ်မှုကို ကြားဖြတ်ပြီး တရားမဝင်သော ဆာဗာတစ်ခုဆီသို့ လမ်းကြောင်းလွှဲလိုက်ခြင်းများ ဖြစ်ပေါ်နိုင်ပါသည်။ နောက်ပိုင်းတွင် CENO မှ လမ်းကြောင်းလွှဲခြင်းကို မှတ်မိပြီး အရင်ဆိုက်တစ်ခုကို ကြည့်ရှုဖို့ကြိုးစားတိုင်း လမ်းကြောင်းလွှဲသော ဆိုက် ကို အလိုအလျောက်ဖွင့်ပေးခြင်းများ ဖြစ်နိုင်ပါသည်။

source: One way to fix this issue is to clear CENO's normal browsing cache by choosing *Settings* in the app's main menu, then *Clear private data*, and disabling all boxes but *Cache* before tapping on *Clear data*.
my: ထိုပြဿနာကို ဖြေရှင်းရန် တစ်ခုတည်းသောနည်းလမ်းမှာ CENO၏ ပုံမှန်ရှာဖွေခြင်း ယာယီမှတ်ဥာဏ်ကို ဖျက်ပစ်ရပါမည်။ အက်ပ်၏ အဓိက မီနူးထဲမှ *ဆက်တင်*ကိုရွေးပါ၊ ပြီးနောက် *Clear private data* ကိုရွေးပါ၊ ထို့နောက် *Cache*ဆိုသောအရာတစ်ခုတည်းကိုသာရွေးပြီး *Clear data* ကိုနှိပ်ပါ။
uk: Один із способів вирішити цю проблему — очистити звичайний кеш перегляду CENO, вибравши *Налаштування* в головному меню програми, потім *Очистити особисті дані* і відімкнути всі поля, окрім *Кеш*, перш ніж натиснути *Очистити дані*.

source: Please note that CENO version 1.3.0 and newer avoid that hijacking of newly visited sites by always using HTTPS, as explained in the previous section.
my: CENO ဗားရှင်း 1.3.0 နှင့်အထက်တွင် နောက်ဆုံးကြည့်ရှုခဲ့သောဆိုက်များ၏ ထိန်းချုပ်ခံရခြင်းကို HTTPS ကို အမြဲတမ်းသုံးပြီး ဖယ်ရှားလိုက်ပြီဖြစ်ကြောင်း ပြီးခဲ့သောအခန်းတွင် ရှင်းပြခဲ့ကြောင်းကို ကျေးဇူးပြုပြီး သတိရပါ။
uk: Зауважте, що CENO версія 1.3.0 і новіші версії уникають перехоплення нещодавно відвідуваних сайтів, адже завжди використовують HTTPS, як це було пояснено у попередньому розділі.

source: First, make sure that your device is still seeding the content by going to the [*CENO Settings* page](settings.md), only leaving the *Shared by other CENO users* source box checked, then accessing that content again: it should load (at least partially), and pushing the CENO address bar icon should only show non-zero values under *Shared by other CENO users* or *Shared by you*.
fa: نخست، با رفتن به [صفحه‌ی *تنظیمات سنو*](settings.md) مطمئن شوید که دستگاه‌تان هنوز محتوا را بذرپاشی می‌کند، فقط چک‌باکس منبع *به‌اشتراک‌گذاشته‌شده توسط سایر کاربران سنو* را چک‌خورده رها کنید، سپس دوباره به آن محتوا دسترسی پیدا کنید: این محتوا بایستی بارگذاری شود (دست‌کم بخش‌هایی از آن باید بارگذاری شوند)، و علامت مستطیل نشانی سنو را فقط در صورتی زور کند که ارزش‌های غیر-صفر ذیل *به‌اشتراک‌گذاشته‌شده توسط سایر کاربران سنو* یا *به‌اشتراک‌گذاشته‌شده توسط شما* نمایش داده شوند.
my: ပထမဦးစွာ [*CENO ဆက်တင်များ* စာမျက်နှာ](settings.md) သို့ သွား၍ သင့်စက်သည် အကြောင်းအရာကို တင်ပို့နေသေးကြောင်း သေချာအောင်လုပ်ပါ။ *အခြား CENO သုံးစွဲသူများက မျှဝေထားသည်* ရင်းမြစ် အကွက်ကိုသာ အမှန်ခြစ်၍ ချန်ထားပြီးနောက် ထိုအကြောင်းအရာကို ထပ်မံ ဝင်ရောက်သုံးစွဲကြည့်ပါ။ ၎င်းသည် (အနည်းဆုံး တစ်စိတ်တစ်ပိုင်း) တက်လာသင့်သည်။ ထို့ပြင် CENO လိပ်စာဘား အိုင်ကွန်ကို နှိပ်လျှင် *အခြား CENO သုံးစွဲသူများက မျှဝေထားသည်* သို့မဟုတ် *သင် မျှဝေထားသည်* အောက်တွင် သုညမဟုတ်သော တန်ဖိုးများကိုသာ ပြသသင့်သည်။

source: If the content does not load, it could be that CENO has already removed it, since it automatically cleans up stale content (older than a week by default) from your local cache. Enable the *Via the CENO network (public)* source in the Settings page and access the content again. Please allow a couple of minutes to pass for the device to announce the content in the distributed cache index. Make *Shared by other CENO users* the only checked box again and access the content once more; if it still does not load, it may be that the particular content is not deemed safe for sharing by Ouinet.
fa: اگر محتوا بارگذاری نشود، می‌تواند به این علت باشد که سنو پیشاپیش آن را حذف کرده است، چون سنو به‌طور خودکار محتوای کهنه (به‌طور پیش‌فرض هر محتوای قدیمی‌تر از یک هفته) را از روی انبار محلی شما پاک می‌کند. منبع *از طریق شبکه‌ی (عمومی) سنو* را در صفحه‌ی تنظیمات فعال کنید و دوباره به همان محتوا دسترسی پیدا کنید. لطفاً اجازه بدهید چند دقیقه بگذرد تا دستگاه وجود محتوا را در نمایه‌ی انبار توزیع‌شده اعلام نماید. جعبه‌ی *به‌اشتراک‌گذاشته‌شده توسط سایر کاربران سنو* را تنها جعبه‌ی علامت‌خورده کنید و یک بار دیگر به محتوا دسترسی پیدا کنید؛ اگر باز هم بارگذاری نشد، شاید این به این دلیل باشد که آن محتوای خاص برای اشتراک‌گذاری از سوی وینت امن انگاشته نمی‌شود.
my: အကြောင်းအရာ တက်မလာလျှင် CENO က ၎င်းကို ဖယ်ရှားပြီးသောကြောင့် ဖြစ်နိုင်သည်။ ၎င်းသည် ဟောင်းသော အကြောင်းအရာ (ပုံသေအားဖြင့် တစ်ပတ်ထက် ပိုကြာသော အကြောင်းအရာ) ကို သင်၏ စက်တွင်း ယာယီသိမ်းဆည်းထားသော မှတ်ဉာဏ်မှ အလိုအလျောက် ရှင်းလင်းပစ်သည်။ ဆက်တင်များ စာမျက်နှာတွင် *CENO ကွန်ရက်မှတစ်ဆင့် (အများသုံး)* ရင်းမြစ်ကို ဖွင့်ပြီး အကြောင်းအရာကို ပြန်လည်ဝင်ရောက်သုံးစွဲပါ။ စက်က အကြောင်းအရာကို ဖြန့်ချိထားသော ယာယီသိမ်းဆည်းထားသည့် မှတ်ဉာဏ် အညွှန်းတွင် ကြေညာရန် နှစ်မိနစ်ခန့် စောင့်ပေးပါ။ *အခြား CENO သုံးစွဲသူများက မျှဝေထားသည်* ကို အမှန်ခြစ်ထားသည့် တစ်ခုတည်းသော အကွက်ဖြစ်အောင် ထပ်မံပြုလုပ်ပြီး အကြောင်းအရာကို ထပ်မံ ဝင်ရောက်သုံးစွဲပါ။ ၎င်းသည် တက်မလာသေးပါက ထိုအကြောင်းအရာကို မျှဝေရန် ဘေးမကင်းဟု Ouinet က ယူဆခြင်း ဖြစ်နိုင်သည်။
uk: Якщо вміст не завантажується, можливо, CENO вже видалив його, оскільки він автоматично очищає застарілий вміст (за замовчуванням більше тижня) з локального кешу. Увімкніть режим *Публічної мережі CENO* на сторінці налаштувань та знову отримайте доступ до вмісту. Будь ласка, зачекайте кілька хвилин, щоб пристрій вніс вміст в індекс розподіленого кешу. Знову встановіть прапорець *Надано іншими користувачами CENO* та знову спробуйте завантажити вміст; якщо він, як і раніше, не завантажується, ймовірно, Ouinet не вважає цей вміст безпечним для загального доступу.

source: If the previous step works, but another device with only the *Shared by other CENO users* source enabled still shows "Failed to retrieve the resource…", there are two possible scenarios. If both devices are in the same network (e.g. on the same Wi-Fi access point), it could be that the network does not allow direct communication between devices connected to it. This happens in some public Wi-Fi networks, so try using a private one.
fa: اگر مراحل قبلی جواب داد، اما دستگاه دیگری با تنها منبع *به‌اشتراک‌گذاشته‌شده توسط سایر کاربران سنو* فعال شده اما پیغام «بازیابی منبع ناموفق بود...» را نشان می‌دهد، دو سناریوی ممکن وجود دارند. اگر هردو دستگاه در یک شبکه باشند (مثلاً یک نقطه‌ی دسترسی وای‌فای مشترک)، این می‌تواند به این دلیل باشد که شبکه اجازه‌ی ارتباط مستقیم بین دستگاه‌های متصل به آن را مجاز نمی‌دهد. این اتفاق در برخی از شبکه‌های وای‌فای عمومی می‌افتد، بنابراین سعی کنید از مرور حالت خصوصی استفاده کنید.
my: ယခင် အဆင့်က အလုပ်ဖြစ်သော်လည်း *အခြား CENO သုံးစွဲသူများက မျှဝေထားသည်* ရင်းမြစ်ကိုသာ ဖွင့်ထားသော အခြားစက်တွင် "ရင်းမြစ်ကို ပြန်ထုတ်၍ မရပါ…" ကို ပြသသေးလျှင် ဖြစ်နိုင်ခြေ နှစ်မျိုးရှိသည်။ စက်နှစ်လုံးစလုံးသည် ကွန်ရက်တစ်ခုတည်းတွင် ရှိနေလျှင် (ဥပမာ- တူညီသော Wi-Fi ဝင်ရောက်သုံးစွဲမှု ပွိုင့်တွင် ရှိနေလျှင်) ကွန်ရက်က ၎င်းနှင့် ချိတ်ဆက်ထားသော စက်များအကြား တိုက်ရိုက် ဆက်သွယ်ခွင့် မပြုခြင်း ဖြစ်နိုင်သည်။ ယင်းသည် အများသုံး Wi-Fi ကွန်ရက်အချို့တွင် ဖြစ်ပွားသောကြောင့် သီးသန့်ကွန်ရက်ကို အသုံးပြုကြည့်ပါ။
uk: Якщо попередній крок працює, але інший пристрій, на якому ввімкнено лише режим *Надано іншими користувачами CENO*, як і раніше показує повідомлення «Не вдалося завантажити ресурс...», можливі два сценарії. Якщо обидва пристрої знаходяться в одній мережі (наприклад, на одній точці доступу Wi-Fi), може виявитися, що мережа не дозволяє безпосередній обмін даними між приєднаними до неї пристроями. Це відбувається в деяких публічних мережах Wi-Fi, тому спробуйте використати приватну мережу.

source: If the devices are in different networks, it could be due to a variety of reasons. One of them is that the network of the first device does not allow incoming connections: if you open its *CENO Settings* page, under *Reachability status* it should say *reachable* or *likely reachable*. Otherwise seeding may not be possible from that network as it is.
fa: اگر دستگاه‌ها در شبکه‌های مختلف بودند، این می‌تواند به دلیل طیفی گوناگون از علت‌ها باشد. یکی از این علت‌ها این است که شبکه‌ی نخستین دستگاه اجازه‌ی ورود اتصال‌های ورودی را نمی‌دهد: اگر صفحه‌ی *تنظیمات سنو* را باز کنید، ذیل *وضعیت دسترس‌پذیری* باید بگوید *دسترس‌پذیر* یا *احتمالاً دسترس‌پذیر*. در غیر این صورت بذرپاشی چه‌بسا از آن شبکه چنان‌که هست ممکن نباشد.
my: စက်များသည် ကွဲပြားသော ကွန်ရက်များတွင် ရှိနေပါက အကြောင်းရင်း အမျိုးမျိုးကြောင့် ဖြစ်နိုင်သည်။ ၎င်းတို့ထဲမှ တစ်ခုမှာ ပထမစက်၏ ကွန်ရက်သည် အဝင် ချိတ်ဆက်မှုများကို ခွင့်မပြုခြင်း ဖြစ်သည်။ သင်သည် ၎င်း၏ *CENO ဆက်တင်များ* စာမျက်နှာကို ဖွင့်လျှင် *ရောက်ရှိနိုင်မှု အခြေအနေ* အောက်တွင် *ရောက်ရှိနိုင်သည်* သို့မဟုတ် *ရောက်ရှိနိုင်ခြေ ရှိသည်* ကို တွေ့သင့်သည်။ ထိုသို့ မဟုတ်ပါက ထိုကွန်ရက်မှ တင်ပို့ရန် မဖြစ်နိုင်ပါ။
uk: Якщо пристрої перебувають в різних мережах, може бути кілька причин. Одна з них — мережа першого пристрою не дозволяє вхідні зʼєднання: якщо Ви відкриєте сторінку *Налаштування CENO*, в розділі *Стан доступності* має бути написано *доступно* або *ймовірно доступно*. Інакше передача даних із цієї мережі неможлива.

source: This may happen when you used an old version of CENO to visit a blocked site in the past, and someone intercepted the connection and directed it to an illegitimate server. CENO then remembered that redirection, and now it automatically opens the latter site when trying to visit the former.
uk: Ця ситуація може статися, якщо ви використовували стару версію CENO для відвідування заблокованого сайту в минулому, і хтось перехопив з’єднання і перенаправив його на сервер зловмисників. Потім CENO запам’ятав це перенаправлення, і тепер браузер автоматично відкриває останній сайт при спробі відвідати перший.

source: First, make sure that your device is still seeding the content by going to the [*CENO Settings* page](settings.md), only leaving the *Shared by other CENO users* source box checked, then accessing that content again: it should load (at least partially), and tapping the CENO address bar icon should only show non-zero values under *Shared by other CENO users* or *Shared by you*.
uk: По-перше, переконайтеся, що Ваш пристрій все ще роздає вміст. Перейдіть на сторінку [*Налаштування CENO*](settings.md), залиште позначеним лише прапорець *Надано іншими користувачами CENO*, а потім знову спробуйте завантажити вміст: він повинен завантажитися (принаймні частково), а натискання на значок адресного рядка CENO має показати ненульові значення лише в розділах *Надано іншими користувачами CENO* або *Надано Вами*.

source: You are running a recent version of the CENO Browser. Obsolete versions may not be able to communicate with newer injectors or other clients. Check the [installation instructions](install.md) to know where to get new versions.
fa: شما نسخه‌ای جدید از مرورگر سنو را اجرا می‌کنید. نسخه‌های منسوخ قدیمی چه‌بسا نتوانند با انژکتورهای جدیدتر یا سایر سرویس‌گیرندگان ارتباط برقرار کنند. برای اطلاع از چگونگی دریافت نسخه‌های جدید به [راهنمای نصب](install.md) نگاه کنید.
