Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/troubleshooting.po
Languages: ar, de, es, fa, fr, id, my, pt, pt_br, ru, tr, uk, ur

source: Please note that some content which is not considered safe for sharing will never be injected, no matter how many people retrieve it using public browsing. This includes content marked as private by the origin server, content that requires authentication, and some traffic exchanged by certain dynamic Web applications.
ar: يرجى ملاحظة أن بعض المحتوى لا يعتبر آمنًا للمشاركة و لن يتم حقنه أبدًا، بغض النظر عن عدد الأشخاص الذين يستردونه باستخدام التصفح العام. يتضمن ذلك المحتوى الذي تم تمييزه على أنه خاص من قبل الخادم الأصلي، والمحتوى الذي يتطلب المصادقة، وبعض حركة المرور المتبادلة بواسطة بعض تطبيقات الويب الديناميكية.
de: Bitte beachten Sie, dass einige Inhalte, die nicht als sicher für die Weitergabe gelten, niemals eingespeist werden, egal wie viele Personen sie über das öffentliche Browsing abrufen. Dazu gehören Inhalte, die vom Ursprungsserver als privat gekennzeichnet sind, Inhalte, die eine Authentifizierung erfordern, und ein Teil des Datenverkehrs, der von bestimmten dynamischen Webanwendungen ausgetauscht wird.
es: Por favor ten en cuenta que algún contenido que no es considerado seguro para compartir nunca será inyectado, sin importar cuántas personas lo descarguen usando navegación pública. Esto incluye contenido marcado como privado por el servidor de origen, contenido que requiere autenticación, y algo del tráfico intercambiado por ciertas aplicaciones Web dinámicas.
fr: Veuillez noter que certains contenus qui ne sont pas considérés comme sûrs pour le partage ne seront jamais injectés, quel que soit le nombre de personnes qui les récupèrent en utilisant la navigation publique. Cela inclut le contenu marqué comme privé par le serveur d'origine, le contenu nécessitant une authentification et une partie du trafic échangé par certaines applications Web dynamiques.
id: Harap diperhatikan bahwa beberapa konten yang dianggap tidak aman untuk dibagikan tidak akan pernah disuntikkan, tidak peduli berapa banyak orang yang mengambilnya menggunakan penjelajahan publik. Ini termasuk konten yang ditandai sebagai privat oleh server asal, konten yang memerlukan autentikasi, dan beberapa lalu lintas yang dipertukarkan oleh aplikasi web dinamis tertentu.
my: မျှဝေရန် ဘေးမကင်းဟု ယူဆရသော အကြောင်းအရာအချို့ကို အများသုံး ရှာဖွေမှု အသုံးပြု၍ ပြန်ထုတ်သည့်လူ မည်မျှများသည်ဖြစ်စေ လုံးဝ ထိုးသွင်းမည် မဟုတ်ကြောင်း သတိပြုပါ။ ယင်းတွင် မူလ ဆာဗာမှ သီးသန့်အဖြစ် မှတ်သားထားသော အကြောင်းအရာ၊ စစ်မှန်ကြောင်း သက်သေပြရန် လိုအပ်သော အကြောင်းအရာနှင့် အချို့သော တက်ကြွသည့် ဝက်ဘ် အက်ပလီကေးရှင်းများက ဖလှယ်ထားသော အသွားအလာအချို့ ပါဝင်သည်။
pt: Por favor, observe que alguns conteúdos não considerados seguros para partilhamento nunca serão injetados, não importa quantas pessoas os recuperem usando a navegação pública. Isso inclui conteúdo marcado como privado pelo servidor de origem, conteúdo que requer autenticação e algum tráfego intercambiado por certas aplicações Web dinâmicas.
pt_br: Por favor, observe que alguns conteúdos não considerados seguros para compartilhamento nunca serão injetados, não importa quantas pessoas os recuperem usando a navegação pública. Isso inclui conteúdo marcado como privado pelo servidor de origem, conteúdo que requer autenticação e algum tráfego intercambiado por certas aplicações Web dinâmicas.
ru: Обратите внимание, что некоторый контент, который не считается безопасным для распространения, никогда не будет загружен, вне зависимости от того, сколько людей получат его с помощью публичного просмотра. К этой категории относится контент, помеченный исходным сервером как приватный, контент, требующий аутентификации, и некоторый трафик, которым обмениваются определенные динамические веб-приложения.
tr: Ne kadar çok kişi herkese açık gezinme ile alsa bile, paylaşımı güvenli olmayan içeriklerin asla eklenmeyeceğini unutmayın. Bunlar, kaynak sunucu tarafından kişisel veya gizli olduğu belirtilen, kimlik doğrulaması gerektiren veya çeşitli değişken site uygulamalarının trafik içerikleri olabilir.
uk: Зверніть увагу, що певний вміст, який не вважається безпечним для розповсюдження, ніколи не буде завантажений незалежно від того, скільки людей отримають його за допомогою публічного перегляду. До цієї категорії відноситься вміст, позначений вихідним сервером як приватний, вміст, що потребує автентифікації, та певний трафік, яким обмінюються певні динамічні веб-програми.
ur: براہ کرم نوٹ کریں کہ کچھ مواد جو اشتراک کے لیے محفوظ نہیں سمجھا جاتا ہے کبھی بھی انجیکٹ نہیں كيا جائے گا، چاہے کتنے ہی لوگ عوامی براؤزنگ کا استعمال کرتے ہوئے اسے بازیافت کریں۔ اس میں اصل سرور کے ذریعہ نجی طور پر نشان زد کردہ مواد، وہ مواد جس کی توثیق کی ضرورت ہوتی ہے، اور بعض متحرک ویب ایپلیکیشنز کے ذریعہ کچھ ٹریفک کا تبادلہ شامل ہے۔

source: Also note that the clients holding copies of injected content need to be reachable by you. The same observations described in the previous point for reaching bridge clients do apply here.
ar: خد بعين الإعتبار أيضًا أنه يجب أن تتمكن من الوصول للعملاء الذين لديهم نسخ من المحتوى المحقون. تنطبق هنا نفس الملاحظات الموضحة في النقطة السابقة بالنسبة للوصول إلى جسر عملاء.
de: Beachten Sie auch, dass die Clients, die Kopien der injizierten Inhalte besitzen, für Sie erreichbar sein müssen. Für die Erreichbarkeit von Bridge-Clients gelten die gleichen Überlegungen wie im vorherigen Punkt beschrieben.
es: También ten presente que clientes que tienen copias de contenido inyectado necesitan ser alcanzables por tí. Aquí se aplican las mismas observaciones descritas en el punto previo para alcanzar clientes puente.
fa: همچنین توجه کنید که سرویس‌گیرندگان دارای نسخه‌هایی از محتوای تزریق‌شده لازم است در دسترس شما باقی بمانند. همین ملاحظات توصیف‌شده در نکته‌ی پیشین برای دستیابی به سرویس‌گیرندگان پل در این‌جا نیز مصداق دارند.
fr: Notez également que les clients détenant des copies du contenu injecté doivent être joignables par vous. Les mêmes observations décrites dans le point précédent pour atteindre les clients du pont s'appliquent ici.
id: Perhatikan juga bahwa klien yang memegang salinan konten yang disuntikkan harus dapat Anda jangkau. Pengamatan yang sama yang dijelaskan pada poin sebelumnya untuk menjangkau klien jembatan juga berlaku di sini.
my: ထို့ပြင် ထိုးသွင်းထားသော အကြောင်းအရာ၏ မိတ္တူများ ရှိသည့် လက်ခံစက်များကို သင့်အနေနှင့် ရောက်ရှိနိုင်ရန် လိုအပ်ကြောင်း သတိပြုပါ။ ပေါင်းကူး လက်ခံစက်များသို့ ရောက်ရှိရန် ယခင်က ဆွေးနွေးချက်တွင် ဖော်ပြခဲ့သော တူညီသည့် လေ့လာတွေ့ရှိမှုများသည် ဤကိစ္စရပ်နှင့် သက်ဆိုင်သည်။
pt: Observe também que os clientes detentores de cópias de conteúdo injetado precisam estar alcançáveis por si. As mesmas observações descritas no ponto anterior sobre alcançar uma ponte se aplicam aqui.
pt_br: Observe também que os clientes detentores de cópias de conteúdo injetado precisam estar alcançáveis por você. As mesmas observações descritas no ponto anterior sobre alcançar uma ponte se aplicam aqui.
ru: Также обратите внимание, что клиенты, хранящие копии загружаемого содержимого, должны быть доступны для вас в сети. Здесь также применимы все наблюдения, описанные в предыдущем пункте о доступе к клиентам моста.
tr: Ayrıca eklenen içeriklerin kopyalarını tutan istemcilerine erişebilmeniz gerektiğini de unutmayın. Önceki konuda köprü istemcilerine erişmek için gerekli olan durumlar burada da geçerlidir.
uk: Також зверніть увагу, що клієнти, які зберігають копії завантаженого вмісту, повинні бути доступними для Вас у мережі. Тут також застосовані всі умови, описані в попередньому пункті доступу до клієнтів мосту.
ur: یہ بھی نوٹ کریں کہ انجیکٹ شدہ مواد کی کاپیاں رکھنے والے کلائنٹس کو آپ تک رسائی حاصل کرنے کی ضرورت ہے۔ پل کلائنٹس تک پہنچنے کے لیے پچھلے نقطہ میں بیان کیے گئے وہی مشاہدات یہاں لاگو ہوتے ہیں۔

source: A note on HTTP-only sites
ar: ملاحظة تخص مواقع HTTP فقط
de: Ein Hinweis zu reinen HTTP-Sites
es: Una nota sobre sitios solo HTTP
fr: Une note sur les sites HTTP uniquement
id: Catatan tentang situs khusus HTTP
my: HTTP သီးသန့် ဆိုက်များအတွက် မှတ်ချက်
pt: Uma nota sobre websites unicamente HTTP
pt_br: Uma nota sobre websites unicamente HTTP
ru: Примечание для сайтов, поддерживающих только HTTP
tr: Yalnızca HTTP kullanan sitelerle ilgili bir not
uk: Примітка щодо сайтів, які працюють на протоколі HTTP
ur: صرف HTTP سائٹس پر ایک نوٹ

source: Ceno automatically switches to the more secure HTTPS protocol to access sites which would otherwise be accessed using plain, insecure HTTP. This is done by the embedded [HTTPS by default][HTTPS by default] extension when you enter a bare domain name like `example.com` or an HTTP URL like `http://example.com/…` in the location bar, or when you follow a link with such a URL in a page.
ar: يتحول Ceno تلقائيًا إلى بروتوكول HTTPS الأكثر أمانًا للوصول إلى المواقع التي يمكن الوصول إليها باستخدام بروتوكول HTTP العادي والغير آمن. يتم ذلك بواسطة امتداد [HTTPS افتراضيًا][HTTPS افتراضيًا] المدمج و ذلك عند إدخال اسم نطاق مجرد مثل `example.com` أو عنوان HTTP مثل `http://example.com/…` في شريط الموقع، أو عند اتباع رابط بعنوان مماثل في صفحة ما.
de: Ceno schaltet automatisch auf das sicherere HTTPS-Protokoll um, um auf Websites zuzugreifen, auf die sonst über einfaches, unsicheres HTTP zugegriffen werden würde. Dies geschieht durch die eingebettete Erweiterung [HTTPS standardmäßig][[HTTPS by default], wenn Sie einen bloßen Domänennamen wie `example.com` oder eine HTTP-URL wie `http://example.com/...` in die Adressleiste eingeben oder wenn Sie einem Link mit einer solchen URL auf einer Seite folgen.
es: Ceno selecciona automáticamente el protocolo HTTPS más seguro para acceder a sitios que de otra manera serían accedidos usando simple, inseguro HTTP. Esto se hace por medio de la extensión incorporada [HTTPS by default][HTTPS by default] cuando ingresas un nombre de dominio aislado como `ejemplo.com` o un URL HTTP como `http://ejemplo.com/…` en la barra de direcciones, o cuando sigues un vínculo con un URL como tal en una página.
fr: Ceno bascule automatiquement vers le protocole HTTPS plus sécurisé pour accéder à des sites qui seraient autrement accessibles via HTTP simple et non sécurisé. Ceci est fait par l'extension intégrée [HTTPS par défaut][HTTPS par défaut] lorsque vous entrez un nom de domaine nu comme `example.com` ou une URL HTTP comme `http://example.com/…` dans la barre d'adresse , ou lorsque vous suivez un lien avec une telle URL dans une page.
id: Ceno secara otomatis beralih ke protokol HTTPS yang lebih aman untuk mengakses situs yang seharusnya diakses menggunakan HTTP biasa yang tidak aman. Hal ini dilakukan oleh ekstensi [HTTPS secara bawaan] [HTTPS secara bawaan] yang disematkan ketika Anda memasukkan nama domain biasa seperti `contoh.com` atau URL HTTP seperti `http://contoh.com/...` pada bilah lokasi, atau ketika Anda mengikuti tautan dengan URL seperti itu pada sebuah halaman.
pt: Ceno automaticamente seleciona o protocolo mais seguro HTTPS para aceder websites que seriam de outra maneira acessados usando o simples e inseguro HTTP. A seleção é feita pela extensão [HTTPS by default][HTTPS by default] incorporada quando entra um nome de domínio cru como `example.com` ou uma URL HTTP como `http://example.com/…` na barra de endereço, ou quando segue uma ligação com tal URL numa página.
pt_br: Ceno automaticamente seleciona o protocolo mais seguro HTTPS para acessar websites que seriam de outra maneira acessados usando o simples e inseguro HTTP. A seleção é feita pela extensão [HTTPS by default][HTTPS by default] incorporada quando você entra um nome de domínio cru como `example.com` ou uma URL HTTP como `http://example.com/…` na barra de endereço, ou quando você segue um link com tal URL em uma página.
ru: Ceno автоматически переключается на более безопасный протокол HTTPS для доступа к сайтам, которые иначе были бы доступны по обычному незащищённому HTTP. Это происходит с помощью встроенного расширения [HTTPS by default], в случаях когда в адресную строку введён домен без указания протокола, например `example.com`, или HTTP URL, например `http://example.com/…`, или при переходе по ссылке с таким URL.
tr: Sitelere güvenli olmayan ve düz HTTP kullanarak erişilmeden önce CENO kendiliğinden daha güvenli olan HTTPS iletişim kuralına geçer. Bu işlem adres çubuğuna düz bir adres `orneksite.com/` ya da `http://orneksite.com/…`gibi güvenli olmayan bir adres yazdığınızda ya da sayfadaki bağlantılara tıkladığınızda yerleşik [Varsayılan olarak HTTPS][HTTPS by default] eklentisi tarafından yapılır.
ur: Ceno خود بخود زیادہ محفوظ HTTPS پروٹوکول میں تبدیل ہو جاتا ہے تاکہ ان سائٹس تک رسائی حاصل کی جا سکے جو بصورت دیگر سادہ، غیر محفوظ HTTP کا استعمال کرتے ہوئے حاصل کی جا سکتی ہیں۔ یہ سرایت شدہ [HTTPS by default][HTTPS by default] ایکسٹینشن کے ذریعے کیا جاتا ہے جب آپ لوکیشن بار میں 'example.com' جیسا ایک واضح ڈومین نام یا 'http://example.com/…` جیسا HTTP URL درج کرتے ہیں۔ ، یا جب آپ کسی صفحہ میں اس طرح کے URL والے لنک کی پیروی کرتے ہیں۔

source: The automatic switching to HTTPS is done to prevent someone from intercepting an HTTP connection and directing it to an illegitimate server, resulting in bogus content (like a block message). This kind of hijacking is trivial to detect with HTTPS, so Ceno can work around it instead of being tricked into loading the bogus content.
ar: يتم التحويل التلقائي إلى HTTPS لمنع أي شخص من اعتراض اتصال HTTP وتوجيهه إلى خادم غير شرعي، مما يؤدي إلى الحصول على محتوى زائف (مثل رسالة حظر). هذا النوع من القرصنة يسهل الكشف عنه باستخدام HTTPS، لذلك يمكن لـ Ceno حل المشكل بدلاً من خداعه لتحميل المحتوى الخاطئ.
de: Die automatische Umstellung auf HTTPS soll verhindern, dass jemand eine HTTP-Verbindung abfängt und sie zu einem nicht zugelassenen Server leitet, was zu gefälschten Inhalten (wie einer Sperrmeldung) führt. Diese Art von Hijacking ist mit HTTPS leicht zu erkennen, so dass Ceno sie umgehen kann, anstatt dazu verleitet zu werden, die gefälschten Inhalte zu laden.
es: La selección automática de HTTPS es hecha para prevenir que alguien intercepte una conexión HTTP y la dirija hacia un servidor ilegítimo, resultando en contenido espurio (como un mensaje de bloqueo). Esta clase de secuestro es trivial de detectar con HTTPS, por lo que Ceno puede evitarla en vez de ser engañado para cargar el contenido espurio.
fr: Le basculement automatique vers HTTPS est fait pour empêcher quelqu'un d'intercepter une connexion HTTP et de la diriger vers un serveur illégitime, ce qui entraînerait un faux contenu (comme un message de blocage). Ce type de piratage est facile à détecter avec HTTPS, donc Ceno peut le contourner au lieu d'être amené à charger le faux contenu.
id: Peralihan otomatis ke HTTPS dilakukan untuk mencegah seseorang mencegat koneksi HTTP dan mengarahkannya ke server yang tidak sah, yang akan menghasilkan konten palsu (seperti pesan blokir). Pembajakan semacam ini sangat mudah dideteksi dengan HTTPS, sehingga Ceno dapat mengatasinya alih-alih tertipu untuk memuat konten palsu.
pt: A escolha automática do HTTPS é feita para evitar que alguém intercepte uma conexão HTTP e a direcione para um servidor ilegítimo, resultando em conteúdo falso (como uma mensagem de bloqueio). Esse tipo de sequestro é trivial de detetar com HTTPS, portanto, Ceno pode contorná-lo em vez de ser induzido a carregar conteúdo falso.
pt_br: A escolha automática do HTTPS é feita para evitar que alguém intercepte uma conexão HTTP e a direcione para um servidor ilegítimo, resultando em conteúdo falso (como uma mensagem de bloqueio). Esse tipo de sequestro é trivial de detectar com HTTPS, portanto, Ceno pode contorná-lo em vez de ser induzido a carregar conteúdo falso.
ru: Автоматическое переключение на HTTPS выполняется чтобы предотвратить перехват HTTP соединения и перенаправление его на подставной сервер, что приводит к получению заменённого контента (напрмер сообщения о блокировке). Такой перехват легко отследить используя HTTPS, так что Ceno может обходить его, вместо того чтобы загружать заменённый контент.
tr: Kendiliğinden HTTPS iletişim kuralına geçiş, birinin bir HTTP bağlantısını kesmesini ve başka bir sunucuya yönlendirip sahte içerik göstermesini (erişim engellendi iletileri gibi) önlemek için yapılır. HTTPS kullanıldığında bu tür bir ele geçirmenin algılanması önemini yitirir. Böylece CENO kandırılarak sahte içeriği yüklemek yerine sorunun etrafından dolaşabilir.
ur: HTTPS میں خودکار سوئچنگ کسی کو HTTP کنکشن کو روکنے اور اسے کسی ناجائز سرور پر بھیجنے سے روکنے کے لیے کیا جاتا ہے، جس کے نتیجے میں جعلی مواد (جیسے بلاک پیغام) ہوتا ہے۔ HTTPS کے ساتھ اس قسم کی ہائی جیکنگ کا پتہ لگانا معمولی بات ہے، اس لیے Ceno جعلی مواد کو لوڈ کرنے کے لیے دھوکہ دہی کے بجائے اس کے ارد گرد کام کر سکتا ہے۔

source: Although very unusual, some sites do not support HTTPS, and no access mechanism will work for them. If you are completely sure that this is the case for a site which just failed to load in Ceno, you can edit its URL in the location bar, change `https://` to `http://`, and try again.
ar: على الرغم من كون ذلك غير معتادًا، إلا أن بعض المواقع لا تدعم HTTPS، ولن تعمل أي آلية وصول لها. إذا كنت متأكدًا تمامًا من أن هذا هو الحال بالنسبة لموقع فشل تحميله في Ceno، فيمكنك تحرير عنوان URL الخاص به في شريط الموقع وتغيير `https://` إلى `http://`، وحاول مرة أخرى.
de: Es ist zwar sehr ungewöhnlich, aber einige Websites unterstützen kein HTTPS, so dass kein Zugangsmechanismus für sie funktioniert. Wenn Sie ganz sicher sind, dass dies bei einer Website der Fall ist, die gerade nicht in Ceno geladen werden konnte, können Sie die URL in der Adressleiste bearbeiten, `https://` in `http://` ändern und es erneut versuchen.
es: Aunque es muy inusual, algunos sitios no aceptan HTTPS, y ningún mecanismo de acceso funcionará para ellos. Si tienes completa seguridad de que este es el caso para un sitio que acaba de fallar al cargarse en Ceno, puedes editar su URL en la barra de direcciones, cambiando `https://` a `http://`, e intentar de nuevo.
fr: Bien que très inhabituel, certains sites ne prennent pas en charge HTTPS et aucun mécanisme d'accès ne fonctionnera pour eux. Si vous êtes complètement sûr que c'est le cas pour un site qui vient d'échouer à se charger dans Ceno, vous pouvez modifier son URL dans la barre d'adresse, remplacer `https://` par `http://` et réessayer.
id: Meskipun sangat tidak biasa, beberapa situs tidak mendukung HTTPS dan tidak ada mekanisme akses yang dapat digunakan. Jika Anda benar-benar yakin bahwa ini adalah kasus situs yang gagal dimuat di Ceno, Anda bisa mengedit URL-nya di bilah lokasi, ubah `https://` menjadi `http://`, dan cobalah kembali.
pt: Apesar de muito incomum, alguns websites não suportam HTTPS e nenhum mecanismo de acesso funcionará para eles. Se tem total certeza de que este é o caso para um website cujo carregamento no Ceno acaba de falhar, pode editar a URL dele na barra de endereços: mude `https://` para `http://` e tente novamente.
pt_br: Apesar de muito incomum, alguns websites não suportam HTTPS e nenhum mecanismo de acesso funcionará para eles. Se tem total certeza de que este é o caso para um website cujo carregamento no Ceno acaba de falhar, você pode editar a URL dele na barra de endereços: mude `https://` para `http://` e tente novamente.
ru: Хотя это крайне необычно, некоторые сайты не поддерживают HTTPS, и для них не будут работать механизмы доступа. Если вы совершенно уверены, что Ceno не смог загрузить данный сайт именно по этой причине, вы можете исправить URL в адресной строке. Замените `https://` на `http://`и попробуйте снова.
tr: Nadir de olsa bazı siteler HTTPS desteklemeyebilir ve bu sitelerde hiçbir yöntem işe yaramaz. CENO ile yükleyemediğiniz sitenin HTTPS desteklemediğinden eminseniz adres çubuğundan `https://` bölümünü `http://` olarak değiştirip yeniden deneyin.
ur: اگرچہ بہت غیر معمولی ہے، کچھ سائٹس HTTPS کو سپورٹ نہیں کرتی ہیں، اور ان کے لیے رسائی کا کوئی طریقہ کار کام نہیں کرے گا۔ اگر آپ کو پوری طرح یقین ہے کہ یہ اس سائٹ کا معاملہ ہے جو ابھی Ceno میں لوڈ ہونے میں ناکام رہی ہے، تو آپ لوکیشن بار میں اس کے URL میں ترمیم کر سکتے ہیں، `https://` کو `http://` میں تبدیل کر سکتے ہیں، اور دوبارہ کوشش کر سکتے ہیں۔

source: If you want to always access a particular site over plain HTTP, you can add a permanent exception like this:
ar: إذا كنت دائمًا تريد الوصول إلى موقع ما عبر HTTP العادي، فيمكنك إضافة استثناء دائم هكذا:
de: Wenn Sie auf eine bestimmte Website immer über einfaches HTTP zugreifen möchten, können Sie eine permanente Ausnahme wie die folgende hinzufügen:
es: Si siempre quieres acceder a un sitio en particular sobre HTTP simple, puedes agregar una excepción permanente así:
fr: Si vous souhaitez toujours accéder à un site particulier via HTTP simple, vous pouvez ajouter une exception permanente comme celle-ci :
id: Jika Anda ingin selalu mengakses situs tertentu melalui HTTP biasa, Anda dapat menambahkan pengecualian permanen seperti ini:
my: အကယ်၍ သင်က HTTP ကိုသုံးပြီး သီးခြားဆိုက်တစ်ခုကို အမြဲတမ်း ရယူလိုပါက သင့်အနေဖြင့် ဤကဲ့သို့သော အမြဲတမ်းအတွက်ခြွင်းချက်တစ်ခုကို ထည့်ထားနိုင်ပါသည်။
pt: Se quiser sempre aceder um website particular através de HTTP simples, pode adicionar uma exceção permanente como esta:
pt_br: Se quiser sempre acessar um website particular através de HTTP simples, você pode adicionar uma exceção permanente como esta:
ru: Если вы хотите всегда обращаться к определённому сайту по обычному HTTPS, следующим образом вы можете добавить постоянное исключение:
tr: Belirli bir siteye her zaman düz HTTP ile erişmek istiyorsanız şu şekilde bir kalıcı istisna ekleyebilirsiniz:
uk: Якщо ви хочете завжди мати доступ до конкретного сайту, що працює на незахищенному протоколі HTTP, ви можете вручну додати сайт як постійний виняток, а саме:
ur: اگر آپ ہمیشہ سادہ HTTP پر کسی خاص سائٹ تک رسائی حاصل کرنا چاہتے ہیں، تو آپ اس طرح ایک مستقل استثناء شامل کر سکتے ہیں:

source: In the app's main menu, choose *HTTPS by default*. You will see that extension's settings page.
ar: في القائمة الرئيسية للتطبيق، اختر *HTTPS افتراضيًا*. سترى صفحة إعدادات هذا الامتداد.
de: Wählen Sie im Hauptmenü der App *HTTPS standardmäßig*. Sie sehen dann die Einstellungsseite dieser Erweiterung.
es: En el menú principal de la app, elige *HTTPS by default*. Verás la página de configuraciones de la extensión.
fr: Dans le menu principal de l'application, choisissez *HTTPS par défaut*. Vous verrez la page des paramètres de cette extension.
id: Pada menu utama aplikasi, pilih *HTTPS secara bawaan*. Anda akan melihat halaman pengaturan ekstensi tersebut.
pt: No menu principal da app, escolha *HTTPS by default*. Verá a página de configurações dessa extensão.
pt_br: No menu principal do aplicativo, escolha *HTTPS by default*. Você verá a página de configurações dessa extensão.
ru: В главном меню приложения, выберите *HTTPS by default*. Вы увидите страницу настроек разрешения.
tr: Uygulamanın ana menüsünden *Varsayılan olarak HTTPS* seçeneğini seçin. Eklentinin ayarlar sayfasını göreceksiniz.
uk: У головному меню додатку виберіть *HTTPS by default*. Ви побачите сторінку налаштувань цього розширення.
ur: ایپ کے مین مینو میں، *HTTPS بذریعہ ڈیفالٹ* منتخب کریں۔ آپ اس ایکسٹینشن کی ترتیبات کا صفحہ دیکھیں گے۔
