Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/troubleshooting.po
Languages: ar, de, es, fa, fr, id, my, pt, pt_br, ru, tr, uk, ur

source: Troubleshooting
ar: استكشاف الأخطاء وإصلاحها
de: Fehlersuche
es: Solución de problemas
fa: شناسایی و رفع ایرادها
fr: Dépannage
id: Pemecahan Masalah
my: ပြဿနာ ဖြေရှင်းခြင်း
pt: Solução de Problemas
pt_br: Solução de Problemas
ru: Устранение неполадок
tr: Sorunları gidermek
uk: Усунення несправностей
ur: خرابیوں کا سراغ لگانا

source: This section will give you some hints about what to do when different, known problems arise with Ceno and Ouinet. Please bear in mind that these are experimental projects, and that their operation is subject to a multitude of factors beyond our control, like the particular configuration and status of network infrastructure, as well as which content other users have retrieved and the characteristics of their connections.
ar: سيعطيك هذا القسم بعض التلميحات حول ما يجب القيام به عند ظهور بعض المشاكل المختلفة والمعروفة في Ceno و Ouinet. يرجى أن تضع في اعتبارك أن هذه مشاريع تجريبية، وأن تشغيلها يخضع للعديد من العوامل الخارجة عن سيطرتنا، مثل التهيئة وحالة البنية التحتية للشبكة وكذلك المحتوى الذي يسترده المستخدمون الآخرون وخصائص اتصالاتهم.
de: In diesem Abschnitt finden Sie einige Hinweise, was zu tun ist, wenn verschiedene, bekannte Probleme mit Ceno und Ouinet auftreten. Bitte bedenken Sie, dass es sich um experimentelle Projekte handelt, deren Betrieb von einer Vielzahl von Faktoren abhängt, auf die wir keinen Einfluss haben, wie z. B. die jeweilige Konfiguration und der Zustand der Netzinfrastruktur sowie die von anderen Nutzern abgerufenen Inhalte und die Eigenschaften ihrer Verbindungen.
es: Esta sección te dará algunas pistas acerca de qué hacer cuando diferentes, problemas conocidos surgen con Ceno y Ouinet. Por favor ten en mente que estos son proyectos experimentales, y que su operación está sujeta a una multitud de factores más allá de nuestro control, como la configuración particular y el estado de la infraestructura de red, como así también qué contenido han descargado otra(o)s usuaria(o)s y la característica de sus conexiones.
fr: Cette section va vous fournir des indications sur ce qu'il faut faire lors de l'apparition de problèmes déjà connus dans Ceno et Ouinet. Veuillez garder à l'esprit qu'il s'agit de projets expérimentaux et que leur fonctionnement est lié à une multitude de facteurs échappant à notre contrôle, comme la configuration particulière et l'état de l'infrastructure réseau, ainsi que le contenu récupéré par d'autres utilisateurs et les caractéristiques de leurs connexions.
id: Bagian ini akan memberi Anda beberapa petunjuk tentang apa yang harus Anda lakukan saat masalah yang berbeda dan diketahui muncul di Ceno dan Ouinet. Perlu diingat bahwa ini adalah proyek eksperimental, dan operasinya tergantung pada banyak faktor di luar kendali kami, seperti konfigurasi dan status infrastruktur jaringan tertentu, serta konten apa saja yang telah diambil oleh pengguna lain dan karakteristik koneksinya.
pt: Esta secção dará algumas dicas sobre o que fazer quando problemas diferentes e conhecidos surgem com Ceno e Ouinet. Por favor, tenha em mente que estes projetos são experimentais e que as suas operações estão sujeitas a uma multitude de fatores além do nosso controle, como a configuração específica e o estado da infraestrutura da rede, bem como qual conteúdo outros utilizadores recuperaram e as características das conexões deles.
pt_br: Esta seção dará algumas dicas sobre o que fazer quando problemas diferentes e conhecidos surgem com Ceno e Ouinet. Por favor, tenha em mente que estes projetos são experimentais e que suas operações estão sujeitas a uma multitude de fatores além do nosso controle, como a configuração específica e o estado da infraestrutura da rede, bem como qual conteúdo outros usuários recuperaram e as características das conexões deles.
ru: В данном разделе вы найдете подсказки о том, что делать при возникновении различных известных неполадок с Ceno и Ouinet. Пожалуйста, имейте в виду, что это экспериментальные проекты, и их работа зависит от множества факторов, не зависящих от нас, таких как конкретная конфигурация и состояние сетевой инфраструктуры, а также от того, какой контент загружали другие пользователи и характеристик их соединений.
tr: Bu bölümde CENO ve Ouinet ile ilgili bilinen sorunlarla karşılaştığınızda neler yapacağınızla ilgili ipuçları bulabilirsiniz. Bu projelerin deneysel olduğunu ve çalışmasında kontrolümüz dışında etkenler olabileceğini unutmayın. Bunlar ağ altyapısının durumu ve yapılandırması, diğer kullanıcıların yüklediği içerikler ve bağlantı türleri gibi bir çok etkenden kaynaklanabilir.
ur: یہ سیکشن آپ کو کچھ اشارے دے گا کہ جب Ceno اور Ouinet کے ساتھ مختلف، معلوم مسائل پیدا ہوں تو کیا کرنا ہے۔ براہ کرم ذہن میں رکھیں کہ یہ تجرباتی منصوبے ہیں، اور یہ کہ ان کا آپریشن ہمارے کنٹرول سے باہر بہت سے عوامل سے مشروط ہے، جیسے نیٹ ورک کے بنیادی ڈھانچے کی مخصوص ترتیب اور حیثیت، نیز دوسرے صارفین نے کون سا مواد بازیافت کیا ہے اور ان کے کنکشن کی خصوصیات .

source: There is no Ceno entry in the app menu
ar: لا يوجد إدخال Ceno في قائمة التطبيق
de: Es gibt keinen Ceno-Eintrag im App-Menü
es: No hay ninguna entrada Ceno en el menú de la app
fr: Il n'y a pas d'entrée Ceno dans le menu de l'application
id: Tidak ada entri Ceno di menu aplikasi
pt: Não há a entrada Ceno no menu da app
pt_br: Não há a entrada Ceno no menu do aplicativo
ru: В меню приложения нет пункта Ceno
tr: Uygulama menüsünde CENO seçeneği yok
ur: ایپ مینو میں کوئی Ceno اندراج نہیں ہے

source: The Ceno Extension may still be loading. Please be patient.
ar: ربما لا يزال ملحق Ceno قيد تحميل. يرجى التحلي بالصبر.
de: Die Ceno-Erweiterung wird möglicherweise noch geladen. Bitte haben Sie etwas Geduld.
es: La Extensión Ceno aún podría estar cargándose. Por favor sé paciente.
fr: L'extension Ceno est peut-être encore en cours de chargement. Veuillez patienter.
id: Ekstensi Ceno mungkin masih dimuat. Mohon untuk bersabar.
pt: A Extensão Ceno pode ainda estar carregando. Por favor, seja utente.
pt_br: A Extensão Ceno pode ainda estar carregando. Por favor, seja paciente.
ru: Возможно расширение Ceno все еще загружается. Потерпите немного.
tr: CENO eklentisi henüz yüklenmemiş olabilir. Lütfen bekleyin.
ur: Ceno ایکسٹینشن اب بھی لوڈ ہو رہی ہے۔ برائے مہربانی صبر کریں۔

source: All widgets are grayed-out in the *Ceno Settings* page
ar: تظهر جميع عناصر واجهة المستخدم باللون الرمادي في صفحة *إعدادات Ceno*
de: Alle Widgets sind auf der Seite *Ceno Einstellungen* ausgegraut
es: Todos los widgets están en gris en la página *Configuración de Ceno*
fr: Tous les widgets sont grisés dans la page *Paramètres Ceno*
id: Semua widget berwarna abu-abu di halaman *Pengaturan Ceno*
pt: Todos os widgets estão acinzentados na página *Configurações do Ceno*
pt_br: Todos os widgets estão acinzentados na página *Configurações do Ceno*
ru: На странице *Настройки Ceno* все виджеты выделены серым цветом
tr: *CENO ayarları* bölümündeki tüm seçenekler grileşti ve kullanılamıyor
ur: تمام ویجٹس *Ceno ترتیبات* صفحہ میں سرمئی رنگ کا ہو گا

source: The Ceno Extension has loaded, but it has not yet been able to retrieve status from Ouinet. Since it may take a moment for Ouinet to be ready, please be patient.
ar: تم تحميل ملحق Ceno، لكنه لم يتمكن بعد من استرداد الحالة من Ouinet. نظرًا لأن الأمر قد يستغرق بعض الوقت حتى يكون Ouinet جاهزًا، يرجى الانتظار.
de: Die Ceno-Erweiterung wurde geladen, konnte aber noch nicht den Status von Ouinet abrufen. Da es einen Moment dauern kann, bis Ouinet bereit ist, bitten wir Sie um etwas Geduld.
es: La Extensión Ceno se ha cargado, pero aún no ha tenido oportunidad de recibir el estado desde Ouinet. Ya que podría tomar un momento para que Ouinet esté lista, por favor sé paciente.
fr: L'extension Ceno a été chargée, mais elle n'a pas encore été en mesure de récupérer le statut de Ouinet. Étant donné que Ouinet peut prendre un moment pour être prêt, veuillez être patient.
id: Ekstensi Ceno telah dimuat, namun belum bisa mengambil status dari Ouinet. Mungkin perlu beberapa saat agar Ouinet siap, harap bersabar.
pt: A Extensão Ceno carregou, mas ainda não foi possível recuperar o estado da Ouinet. Já que pode demorar um tempo para a Ouinet estar pronta, por favor, seja utente.
pt_br: A Extensão Ceno carregou, mas ainda não foi possível recuperar o estado da Ouinet. Já que pode demorar um tempo para a Ouinet estar pronta, por favor, seja paciente.
ru: Расширение Ceno загрузилось, но оно еще не получило статус из Ouinet. Поскольку подготовка Ouinet может занять некоторое время, потерпите немного.
tr: CENO eklentisi yüklendi fakat henüz Ouinet üzerinden durum bilgilerini alamadı. Ouinet altyapısının hazır olması biraz zaman alabilir, lütfen bekleyin.
ur: Ceno ایکسٹینشن لوڈ ہو گئی ہے، لیکن یہ ابھی تک Ouinet سے اسٹیٹس بازیافت کرنے کے قابل نہیں ہے۔ چونکہ Ouinet کے تیار ہونے میں ایک لمحہ لگ سکتا ہے، براہ کرم صبر کریں۔

source: If the Settings page stays like that after more than two minutes, Ouinet may have encountered some issue while starting.
ar: إذا ظلت صفحة الإعدادات على هذا النحو بعد أكثر من دقيقتين، فقد يكون Ouinet قد واجه بعض المشاكل أثناء البدء.
de: Wenn die Einstellungsseite nach mehr als zwei Minuten immer noch so aussieht, kann es sein, dass beim Start von Ouinet ein Problem aufgetreten ist.
es: Si la página de Configuración permanece así después de más de dos minutos, Ouinet podría haber encontrado alguna dificultad mientras se iniciaba.
fa: اگر صفحه‌ی تنظیمات بعد از بیش از دو دقیقه همین‌طور باقی می‌ماند، احتمال دارد که وینت هنگام آغاز به کار دچار مشکلی شده باشد.
fr: Si la page Paramètres reste comme ça après plus de deux minutes, Ouinet a peut-être rencontré un problème lors du démarrage.
id: Jika halaman Pengaturan tetap seperti itu setelah lebih dari dua menit, Ouinet mungkin mengalami masalah saat memulai.
my: ဆက်တင်များ စာမျက်နှာသည် နှစ်မိနစ်ကျော် ကြာပြီးနောက် ထိုအတိုင်း ဆက်ဖြစ်နေပါက Ouinet ကို စတင်စဉ် ပြဿနာတစ်ခုခု ကြုံရခြင်း ဖြစ်နိုင်သည်။
pt: Se a página Configurações permanecer dessa maneira por mais que dois minutos, Ouinet pode ter encontrado algum problema durante a inicialização.
pt_br: Se a página Configurações permanecer dessa maneira por mais de dois minutos, Ouinet pode ter encontrado algum problema durante a inicialização.
ru: Если страница настроек остается в таком состоянии более двух минут, возможно, Ouinet столкнулся с какой-то проблемой при запуске.
tr: Ayarlar bölümü iki dakikadan uzun süre bu şekilde kalırsa, Ouinet başlarken bir sorun çıkmış olabilir.
uk: Якщо сторінка налаштувань залишається в такому стані більше, ніж дві хвилини, можливо, Ouinet зіткнувся з проблемою під час запуску.
ur: اگر ترتیبات کا صفحہ دو منٹ سے زیادہ کے بعد بھی ایسا ہی رہتا ہے، تو Ouinet کو شروع کرتے وقت کچھ مسئلہ درپیش ہو سکتا ہے۔

source: Try to visit some page, if possible one which is usually available. If you get an error like "Failed to retrieve the resource (after attempting all configured mechanisms)", Ceno may be experiencing some issues with general connectivity (like being unable to join the BitTorrent network). If you are on a mobile connection, try again with Wi-Fi.
ar: حاول زيارة صفحة ما تكون متاحة عادة إذا كان ذلك ممكنًا. إذا تلقيت خطأ مثل "فشل في استرداد المورد (بعد محاولة جميع الآليات التي تم تهيئتها)"، فقد يكون Ceno واجه بعض المشاكل في الاتصال العام (مثل عدم القدرة على الانضمام إلى شبكة بت تورنت). إذا كنت تستخدم اتصال المحمول، فحاول مرة أخرى باستخدام Wi-Fi.
de: Versuchen Sie, eine Seite zu besuchen, möglichst eine, die normalerweise verfügbar ist. Wenn Sie eine Fehlermeldung wie "Failed to retrieve the resource (after trying all configured mechanisms)" erhalten, kann es sein, dass Ceno Probleme mit der allgemeinen Konnektivität hat (z. B. dass es nicht in der Lage ist, dem BitTorrent-Netzwerk beizutreten). Wenn Sie über eine mobile Verbindung verfügen, versuchen Sie es erneut über Wi-Fi.
es: Intenta visitar alguna página, si es posible una que usualmente esté disponible. Si obtienes un error como "Fallo al descargar el recurso (después de intentar todos los mecanismos configurados)", Ceno podría estar experimentando algunas dificultades con la conectividad general (como ser incapaz de unirse a la red BitTorrent). Si estás sobre una conexión móvil, intenta de nuevo con Wi-Fi.
fr: Essayez de visiter une page, si possible une qui est habituellement disponible. Si vous obtenez une erreur telle que "Échec de la récupération de la ressource (après avoir essayé tous les mécanismes configurés)", Ceno peut rencontrer des problèmes de connectivité générale (comme l'impossibilité de rejoindre le réseau BitTorrent). Si vous êtes sur une connexion mobile, réessayez avec le Wi-Fi.
id: Cobalah untuk mengunjungi beberapa halaman, jika memungkinkan kunjungi yang biasanya tersedia. Jika Anda mendapatkan kesalahan seperti "Gagal mengambil sumber daya (setelah mencoba semua mekanisme yang dikonfigurasi)", Ceno mungkin mengalami beberapa masalah dengan konektivitas umum (seperti tidak dapat bergabung dengan jaringan BitTorrent). Jika Anda menggunakan koneksi seluler, cobalah lagi dengan Wi-Fi.
pt: Tente visitar alguma página, se possível uma que esteja habitualmente disponível. Se receber um erro como "Falha em recuperar o recurso (após tentar todos os mecanismos configurados)", Ceno pode encontrar alguns problemas com a conectividade em geral (como não conseguir entrar na rede BitTorrent). Se estiver numa conexão móvel, tente novamente com WiFi.
pt_br: Tente visitar alguma página, se possível uma que esteja habitualmente disponível. Se você obtiver um erro como "Falha em recuperar o recurso (após tentar todos os mecanismos configurados)", Ceno pode estar encontrando alguns problemas com a conectividade em geral (como não conseguir entrar na rede BitTorrent). Se estiver em uma conexão móvel, tente novamente com WiFi.
ru: Попробуйте посетить какую-нибудь страницу, по возможности ту, которая обычно доступна. Если вы получите ошибку типа "Не удалось загрузить ресурс (после попытки использования всех настроенных схем)", возможно, Ceno испытывает некоторые проблемы с общим подключением (например, не может присоединиться к сети BitTorrent). Если вы подключены через мобильный интернет, повторите попытку с помощью Wi-Fi.
tr: Yapabiliyorsanız genellikle ulaşabildiğiniz bir sayfayı ziyaret etmeyi deneyin. Karşılaştığınız hata iletisi "Kaynak alınamadı (tüm yapılandırılmış yöntemler denendi)" ise CENO bağlantı sorunları (BitTorrent ağına katılamama gibi) yaşıyor olabilir. Mobil veri kullanıyorsanız kablosuz ağ ile yeniden deneyin.
ur: اگر ممکن ہو تو کوئی صفحہ دیکھنے کی کوشش کریں جو عام طور پر دستیاب ہوتا ہے۔ اگر آپ کو "وسائل کو بازیافت کرنے میں ناکام (تمام ترتیب شدہ طریقہ کار کو آزمانے کے بعد)" جیسی خرابی ملتی ہے، تو Ceno کو عام رابطے کے ساتھ کچھ مسائل کا سامنا ہو سکتا ہے (جیسے BitTorrent نیٹ ورک میں شامل ہونے سے قاصر ہونا)۔ اگر آپ موبائل کنکشن پر ہیں تو Wi-Fi کے ساتھ دوبارہ کوشش کریں۔

source: If you get an error like "The proxy server is refusing connections" when visiting the page, try to stop other applications which may be offering some service to the device, then restart Ceno.
ar: إذا تلقيت خطأ مثل "الخادم الوكيل يرفض الاتصالات" عند زيارة الصفحة، فحاول إيقاف التطبيقات الأخرى التي قد تقدم بعض الخدمات للجهاز، ثم أعد تشغيل Ceno.
de: Wenn Sie beim Besuch der Seite eine Fehlermeldung wie "Der Proxyserver verweigert die Verbindung" erhalten, versuchen Sie, andere Anwendungen zu stoppen, die dem Gerät möglicherweise einen Dienst anbieten, und starten Sie Ceno neu.
es: Si obtienes un error como "El servidor proxy está rechazando conexiones" al visitar la página, intenta detener otras aplicaciones que podrían estar ofreciendo algún servicio al dispositivo, y luego reinicia Ceno.
fr: Si vous obtenez une erreur telle que "Le serveur proxy refuse les connexions" lors de la visite de la page, essayez d'arrêter d'autres applications susceptibles d'offrir un service à l'appareil, puis redémarrez Ceno.
id: Jika Anda mendapatkan kesalahan seperti "Server proksi menolak koneksi" saat mengunjungi halaman, coba hentikan aplikasi lain yang mungkin menawarkan layanan ke perangkat, lalu mulai ulang Ceno.
pt: Se obtiver um erro como "O servidor proxy recusa conexões" ao visitar a página, tente interromper outras aplicações que podem estar oferecendo algum serviço ao aparelho e, então, reinicie Ceno.
pt_br: Se obtiver um erro como "O servidor proxy está recusando conexões" ao visitar a página, tente interromper outras aplicações que podem estar oferecendo algum serviço ao dispositivo e, então, reinicie Ceno.
ru: Если при посещении страницы вы получаете ошибку типа "Прокси-сервер отказывает в подключении", попробуйте остановить другие приложения, которые могут предоставлять какие-то услуги устройству, затем перезапустите Ceno.
tr: Bir sayfayı ziyaret ettiğinizde "Vekil sunucu bağlantıları reddediyor" hata iletisini görüyorsanız, aygıtınızda çalışan diğer uygulamaları kapatıp CENO uygulamasını yeniden başlatmayı deneyin.
ur: اگر آپ کو صفحہ پر جاتے وقت "پراکسی سرور کنکشن سے انکار کر رہا ہے" جیسی خرابی ملتی ہے، تو دوسری ایپلیکیشنز کو روکنے کی کوشش کریں جو ہو سکتا ہے ڈیوائس کو کچھ سروس پیش کر رہی ہوں، پھر Ceno کو دوبارہ شروع کریں۔

source: **Technical note:** This may happen if another application is already listening on TCP ports `127.0.0.1:8077` or `127.0.0.1:8078`.
ar: **ملاحظة تقنية:** قد يحدث هذا إذا كان هناك تطبيق آخر يستمع في منافذ TCP على `127.0.0.1:8077` أو `127.0.0.1:8078`.
de: **Technischer Hinweis:** Dies kann passieren, wenn eine andere Anwendung bereits auf den TCP-Ports `127.0.0.1:8077` oder `127.0.0.1:8078` lauscht.
es: **Nota técnica:** Esto podría pasar si otra aplicación ya está escuchando sobre los puertos TCP `127.0.0.1:8077` o `127.0.0.1:8078`.
fa: **نکته‌ی فنی:** اگر نرم‌افزار دیگری از قبل در حال شنود درگاه‌های TCP یعنی `127.0.0.1:8077` یا `127.0.0.1:8078` باشد ممکن است این اتفاق بیفتد.
fr: **Note technique :** Cela peut se produire si une autre application écoute déjà sur les ports TCP `127.0.0.1:8077` ou `127.0.0.1:8078`.
id: **Catatan teknis:** Hal ini dapat terjadi jika aplikasi lain sudah mendengarkan pada porta TCP `127.0.0.1:8077` atau `127.0.0.1:8078`.
my: **နည်းပညာဆိုင်ရာ မှတ်ချက် -** အခြားအက်ပလီကေးရှင်းက TCP ပေါ့တ်များ `127.0.0.1:8077` သို့မဟုတ် `127.0.0.1:8078` တွင် နားထောင်နေပြီး ဖြစ်ပါက ဤသို့ ဖြစ်ပွားနိုင်သည်။
pt: **Nota técnica:** Isso pode acontecer caso outra aplicação já esteja ouvindo as portas TCP `127.0.0.1:8077` ou `127.0.0.1:8078`.
pt_br: **Nota técnica:** Isso pode acontecer caso outra aplicação já esteja ouvindo as portas TCP `127.0.0.1:8077` ou `127.0.0.1:8078`.
ru: **Техническое примечание:** Это может произойти, если другое приложение уже прослушивает TCP порты `127.0.0.1:8077` или `127.0.0.1:8078`.
tr: **Teknik not:** `127.0.0.1:8077` veya `127.0.0.1:8078` TCP bağlantı noktalarında çalışan başka bir uygulama varsa bu durum olabilir.
uk: **Технічна примітка:** Це може статися, якщо інша програма вже прослуховує TCP порти `127.0.0.1:8077` або `127.0.0.1:8078`.
ur: **تکنیکی نوٹ:** ایسا ہو سکتا ہے اگر کوئی اور ایپلیکیشن پہلے سے ہی TCP پورٹس `127.0.0.1:8077` یا `127.0.0.1:8078` پر سن رہی ہو۔

source: The *Ouinet client state* under *Ceno Settings* is not `started`
ar: حالة *عميل Ouinet* ضمن *إعدادات Ceno* ليست `بدأت`
de: Der *Ouinet-Client-Status* unter *Ceno-Einstellungen* ist nicht `gestartet`
es: El *Estado del cliente Ouinet* bajo *Configuraciones de Ceno* no es `started`
fr: L'état du client *Ouinet* sous *Paramètres Ceno* n'est pas "démarré"
id: Status *Klien Ouinet* di bawah *Pengaturan Ceno* tidak `dimulai`
pt: O *estado do cliente Ouinet* dentro das *Configurações do Ceno* não é `iniciado`
pt_br: O *estado do cliente Ouinet* dentro das *Configurações do Ceno* não é `iniciado`
ru: *Состояние клиента Ouinet* в *Настройки Ceno* иное, чем `started`
tr: *CENO ayarları* altındaki *Ouinet istemci durumu* `başlatıldı` olarak görünmüyor
ur: *Ceno ترتیبات* کے تحت *Ouinet کلائنٹ کی حالت* 'شروع' نہیں ہوئی ہے

source: The Ouinet client run by Ceno is finding problems starting on your device.
ar: يجد عميل Ouinet الذي يديره Ceno مشاكل في بدء التشغيل على جهازك.
de: Der von Ceno betriebene Ouinet-Client hat Probleme beim Starten auf Ihrem Gerät.
es: El cliente Ouinet ejecutado por Ceno está encontrando problemas para iniciarse en tu dispositivo.
fr: Le client Ouinet géré par Ceno a des problèmes de démarrage sur votre appareil.
id: Klien Ouinet yang dijalankan oleh Ceno menemukan masalah saat memulai perangkat Anda.
pt: O cliente Ouinet executado por Ceno encontra problemas para inicializar no seu aparelho.
pt_br: O cliente Ouinet executado por Ceno está encontrando problemas para inicializar em seu dispositivo.
ru: Используемый Ceno клиент Ouinet стокнулся с проблемами при запуске на вашем устройстве.
tr: Aygıtınızda CENO tarafından çalıştırılan Ouinet istemcisi başlatılırken sorun yaşıyor.
ur: Ceno کے ذریعے چلائے جانے والے Ouinet کلائنٹ کو آپ کے ڈیوائس پر شروع ہونے والی دشواریوں کا سامنا ہے۔
