Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/troubleshooting.po
Languages: ar, de, es, fa, fr, id, my, pt, pt_br, ru, tr, uk, ur

source: Enter the domain name of the site in the text box, as shown below. See there how you may enter several sites by separating them with spaces or newlines. Please note that entering `example.com` will also include all sites under that domain, like `www.example.com` or `x.y.example.com`.
ar: أَدْخِل اسم النطاق الخاص بالموقع في مربع النص، كما هو موضح أدناه. شاهد هناك كيف يمكنك إدخال عدة مواقع عن طريق فصلها بمسافات أو أسطر جديدة. الرجاء ملاحظة أن إدخال `example.com` سيشمل أيضًا جميع المواقع ضمن هذا المجال، مثل `www.example.com` أو `x.y.example.com`.
de: Geben Sie den Domänennamen des Standorts in das Textfeld ein, wie unten gezeigt. Dort sehen Sie, wie Sie mehrere Websites eingeben können, indem Sie sie durch Leerzeichen oder Zeilenumbrüche trennen. Bitte beachten Sie, dass die Eingabe von `example.com` auch alle Sites unter dieser Domain einschließt, wie `www.example.com` oder `x.y.example.com`.
es: Ingresa el nombre de dominio del sitio en la casilla de texto, como se muestra abajo. Mira allí cómo podrías ingresar varios sitios separándolos con espacios o nuevas líneas. Por favor advierte que ingresando `ejemplo.com` también incluirá todos los sitios bajo ese dominio, como `www.ejemplo.com` o `x.y.ejemplo.com`.
fr: Entrez le nom de domaine du site dans la zone de texte, comme indiqué ci-dessous. Voyez-y comment vous pouvez entrer plusieurs sites en les séparant par des espaces ou des retours à la ligne. Veuillez noter que la saisie de "example.com" inclura également tous les sites de ce domaine, comme "www.example.com" ou "x.y.example.com".
id: Masukkan nama domain situs di kotak teks, seperti yang ditunjukkan di bawah ini. Lihat di sana bagaimana Anda dapat memasukkan beberapa situs dengan memisahkannya dengan spasi atau baris baru. Harap diperhatikan bahwa memasukkan `contoh.com` juga akan menyertakan semua situs di bawah domain tersebut, seperti `www.contoh.com` atau `x.y.contoh.com`.
my: ဆိုက်၏ ဒိုမိန်းနာမည်ကို စာသားထည့်ရမည့်နေရာ၌ အောက်တွင်ပြထားသည့်အတိုင်း ရိုက်ထည့်ပါ။ သင့်အနေဖြင့် များစွာသော ဆိုက်များကို spaces သို့မဟုတ် စာကြောင်းအသစ်များဖြင့် ခွဲပြီး ထည့်နိုင်တာကို မြင်နိုင်ပါသည်။ `example.com`ကို ထည့်သွင်းခြင်းက ထို ဒိုမိန်းအောက်မှာရှိနေတဲ့ `www.example.com` သို့မဟုတ် `x.y.example.com`ကဲ့သို့သော ဆိုက်များအားလုံးပါဝင်သွားမှာဖြစ်ကြောင်းကို ကျေးဇူးပြုပြီး သတိပြုပါ။
pt: Insira o nome do domínio para o website na caixa de texto, como mostrado abaixo. Observe ali como pode inserir diversos websites separando-os com espaços ou novas linhas. Por favor, note que inserir `example.com` incluirá também todos os websites sob esse domínio, como `www.example.com` ou `x.y.example.com`.
pt_br: Insira o nome do domínio para o website na caixa de texto, como mostrado abaixo. Observe ali como você pode inserir diversos websites separando-os com espaços ou novas linhas. Por favor, note que inserir `example.com` incluirá também todos os websites sob esse domínio, como `www.example.com` ou `x.y.example.com`.
ru: Введите доменное имя сайта в поле ввода, как показано ниже. Вы можете ввести несколько сайтов, разделяя их пробелами или переводами на новую строку. Обратите внимание, что введя `example.com` вы также включите все сайты на этом домене, такие как`www.example.com` или `x.y.example.com`.
tr: Aşağıda gösterildiği gibi sitenin etki alanını metin alanına yazın. Birden fazla siteyi boşluk ya da yeni satır ile ayırarak yazabilirsiniz. `orneksite.com`adresini eklediğinizde o site altındaki tüm etki alanlarının da (`www.orneksite.com` veya `a.b.orneksite.com` gibi) kapsanacağını unutmayın.
uk: Введіть доменне ім’я сайту в текстове поле, як показано нижче. Подивіться, як ви можете ввести відразу кілька сайтів, розділивши їх пробілами або новими рядками. Зауважте, що введення "example.com" також включатиме всі сайти в цьому домені, наприклад, "www.example.com" або "x.y.example.com".
ur: ٹیکسٹ باکس میں سائٹ کا ڈومین نام درج کریں، جیسا کہ نیچے دکھایا گیا ہے۔ وہاں دیکھیں کہ آپ کس طرح متعدد سائٹوں کو خالی جگہوں یا نئی لائنوں سے الگ کر کے داخل کر سکتے ہیں۔ براہ کرم نوٹ کریں کہ `example.com` داخل کرنے سے اس ڈومین کے تحت تمام سائٹس بھی شامل ہوں گی، جیسے `www.example.com` یا `x.y.example.com`۔

source: When done, go back or close the tab.
ar: عند الانتهاء، عد للخلف أو أغلق علامة التبويب.
de: Wenn Sie fertig sind, gehen Sie zurück oder schließen Sie die Registerkarte.
es: Cuando termines, ve hacia atrás o cierra la pestaña.
fr: Lorsque vous avez terminé, revenez en arrière ou fermez l'onglet.
id: Setelah selesai, kembali atau tutup tab.
my: အကယ်၍ ပြီးသွားတဲ့အခါ နောက်ပြန်သွားပါ သို့မဟုတ် တက်ဘ်ကို ပိတ်ပါ။
pt: Quando terminar, volte ou feche a guia.
pt_br: Quando terminar, volte ou feche a aba.
ru: Когда закончите, вернитесь назад или закройте вкладку.
tr: Tamamladığınızda geri dönün ya da sekmeyi kapatın.
uk: Як тільки ви завершили дію, поверніться на попередню сторінку або ж закрийте вкладку.
ur: جب ہو جائے، واپس جائیں یا ٹیب بند کریں۔

source: ![Figure: Adding exceptions for HTTP-only sites](images/httpsbd-exceptions.png)
ar: ![الشكل: إضافة استثناءات لمواقع HTTP فقط](images/httpsbd-exceptions.png)
de: ![Abbildung: Hinzufügen von Ausnahmen für Seiten, die HTTPS nicht unterstützen](images/httpsbd-exceptions.png)
es: ![Figura: Agregando excepciones para sitios solo HTTP](images/httpsbd-exceptions.png)
fr: ![Figure : Ajout d'exceptions pour les sites HTTP uniquement](images/httpsbd-exceptions.png)
id: ![Gambar: Menambahkan pengecualian untuk situs khusus HTTP](images/httpsbd-exceptions.png)
my: ![ပုံ - HTTP သီးသန့်အတွက် ခြွင်းချက်ထည့်သွင်းခြင်း](images/httpsbd-exceptions.png)
pt: ![Figura: Adicionando exceções para websites unicamente HTTP](images/httpsbd-exceptions.png)
pt_br: ![Figura: Adicionando exceções para websites unicamente HTTP](images/httpsbd-exceptions.png)
ru: ![Пример: Добавление исключений для использующих только HTTP сайтов](images/httpsbd-exceptions.png)
tr: ![Görsel: Yalnızca HTTP kullanan siteler için istisna ekleme](images/httpsbd-exceptions.png)
uk: ![Рисунок: Як додати сайти як винятки, що працюють на протоколі HTTP](images/httpsbd-exceptions.png)
ur: ![تصویر: صرف HTTP سائٹس کے لیے مستثنیات شامل کرنا](images/httpsbd-exceptions.png)

source: **Note:** In the unfortunate case that a site is only accessible via HTTP, and it is also being hijacked by a censor, you will need to go to the [Settings page](settings.md), disable Origin access, and try again. Please note that this setting affects all sites, and it is not remembered by Ceno for subsequent runs. We encourage you to contact the site administrators and tell them to enable HTTPS support.
ar: **ملاحظة:** في الحالة المؤسفة التي لا يمكن فيها الوصول إلى موقع ما إلا عبر HTTP، ويتم اختراقه أيضًا من قبل رقيب، ستحتاج إلى الانتقال إلى [صفحة الإعدادات](settings.md)، وتعطيل الوصول إلى الأصل، و المحاولة مرة أخرى. يرجى ملاحظة أن هذا الإعداد يؤثر على جميع المواقع، ولا يتذكره Ceno للتشغيل اللاحق. نحن نشجعك على الاتصال بمسؤولي الموقع و أن تطلب منهم تمكين دعم HTTPS.
de: **Hinweis:** In dem unglücklichen Fall, dass eine Webseite nur über HTTP zugänglich ist und außerdem von einem Zensor gekapert wird, müssen Sie auf die [Einstellungsseite](settings.md) gehen, den Zugang zum Ursprung deaktivieren und es erneut versuchen. Bitte beachten Sie, dass sich diese Einstellung auf alle Webseiten auswirkt und dass sie von Ceno nicht für spätere Durchläufe gespeichert wird. Wir empfehlen Ihnen, die Webseitenadministratoren zu kontaktieren und ihnen mitzuteilen, sie sollen die HTTPS-Unterstützung aktivieren.
es: **Nota:** En el caso desafortunado en que un sitio solamente sea accesible vía HTTP, y también esté siendo secuestrado por un censor, necesitarás ir hacia la [página de Configuración](settings.md), deshabilitar acceso de Origen, e intentarlo de nuevo. Por favor nota que esta configuración afecta a todos los sitios, y no es recordada por Ceno en subsecuentes ejecuciones. Te alentamos a contactar a quienes administran el sitio y decirles que habiliten la funcionalidad HTTPS.
fr: **Remarque :** Dans le cas malheureux où un site n'est accessible que via HTTP, et qu'il est également piraté par un censeur, vous devrez vous rendre sur la [page des paramètres](settings.md), désactiver l'accès à Origin, et essayez à nouveau. Veuillez noter que ce paramètre affecte tous les sites et qu'il n'est pas mémorisé par Ceno pour les exécutions ultérieures. Nous vous encourageons à contacter les administrateurs du site et à leur dire d'activer le support HTTPS.
id: **Catatan:** Jika sebuah situs hanya dapat diakses melalui HTTP, dan situs tersebut juga dibajak oleh sensor, Anda harus pergi ke [Halaman Pengaturan] (settings.md), nonaktifkan akses Origin, dan coba lagi. Harap dicatat bahwa pengaturan ini memengaruhi semua situs, dan tidak akan diingat oleh Ceno untuk proses selanjutnya. Kami menganjurkan Anda untuk menghubungi administrator situs tersebut dan memberi tahu mereka untuk mengaktifkan dukungan HTTPS.
pt: **Nota:** No infeliz caso de um website apenas ser acessível via HTTP e também estar sendo sequestrado por um censor, precisará ir à [página Configurações](settings.md), desativar o acesso à Origem e tentar novamente. Por favor, observe que essa configuração afeta todos os websites e ela não é lembrada pelo Ceno em execuções subsequentes. Encorajamos a contatar os administradores do website e lhes dizer para ativar o suporte HTTPS.
pt_br: **Nota:** No infeliz caso de um website apenas ser acessível via HTTP e também estar sendo sequestrado por um censor, você precisará ir à [página Configurações](settings.md), desabilitar o acesso à Origem e tentar novamente. Por favor, observe que essa configuração afeta todos os websites e ela não é lembrada pelo Ceno em execuções subsequentes. Encorajamos você a contatar os administradores do website e dizer a eles para habilitar o suporte HTTPS.
ru: **Важно!:** В том печальном случае, когда сайт доступен только по HTTP и при этом перехватывается цензором, вам нужно будет перейти на [Страница настроек](settings.md), выключить Доступ напрямую с сайта и попробовать снова. Обратите внимание, что эта настройка действует на все сайты и не сохраняется при последующих запусках Ceno. Мы рекомендуем вам связаться с администраторами сайта и убедить их включить поддержку HTTPS.
tr: **Not:** Sitenin yalnızca HTTP ile erişilebilir olduğu ve sansürleyiciler tarafından içeriğinin değiştirildiği durumlarda, [Ayarlar bölümüne](settings.md) giderek *Kaynaktan erişim* seçeneğini kapatıp yeniden deneyin. Bu seçeneğin tüm siteleri etkilediğini ve bir sonraki açılışta CENO tarafından hatırlanmayacağını unutmayın. Site yöneticilerine ulaşarak HTTPS desteğini etkinleştirmelerini söylemenizi öneririz.
ur: **نوٹ:** بدقسمتی کی صورت میں کہ ایک سائٹ صرف HTTP کے ذریعے قابل رسائی ہے، اور اسے ایک سنسر کے ذریعے ہائی جیک بھی کیا جا رہا ہے، آپ کو [ترتیبات کے صفحہ](settings.md) پر جانے کی ضرورت ہوگی، اوریجن تک رسائی کو غیر فعال کریں، اور دوبارہ کوشش کریں۔ براہ کرم نوٹ کریں کہ یہ ترتیب تمام سائٹس پر اثر انداز ہوتی ہے، اور اسے بعد کے رنز کے لیے Ceno کے ذریعے یاد نہیں رکھا جاتا ہے۔ ہم آپ کو سائٹ کے منتظمین سے رابطہ کرنے اور HTTPS معاونت کو فعال کرنے کے لیے کہنے کی ترغیب دیتے ہیں۔

source: A page shows bogus content (like a block message)
ar: تعرض الصفحة محتوى زائفًا (مثل رسالة حظر)
de: Eine Seite zeigt gefälschte Inhalte an (z. B. eine Sperrmeldung)
es: Una página muestra contenido falso (como un mensaje bloqueado)
fr: Une page affiche un faux contenu (comme un message de blocage)
id: Halaman yang menampilkan konten palsu (seperti pesan blokir)
my: အတုအယောင် အကြောင်းအရာများကို စာမျက်နှာမှ ဖော်ပြခြင်း (ဥပမာ - ပိတ်ဆို့ခံရကြောင်း မက်ဆေ့ချ်)
pt: Uma página mostra conteúdo falso (como uma mensagem de bloqueio)
pt_br: Uma página mostra conteúdo falso (como uma mensagem de bloqueio)
ru: На странице отображается не её настоящее содержимое (например, отображается сообщение о блокировке)
tr: Bir site sayfası sahte içerik görüntülüyor (engelleme iletisi gibi)
uk: На сторінці відображається фальшивий вміст (як-от повідомлення про блокування)
ur: ایک صفحہ جعلی مواد دکھاتا ہے (جیسے بلاک پیغام)

source: This may happen when you used an old version of Ceno to visit a blocked site in the past, and someone intercepted the connection and directed it to an illegitimate server. Ceno then remembered that redirection, and now it automatically opens the latter site when trying to visit the former.
ar: قد يحدث هذا عندما تكون قد استخدمت سابقًا إصدارًا قديمًا من Ceno لزيارة موقع محظور، وقام شخص ما باعتراض الاتصال وتوجيهه إلى خادم مزيف. و تذكر Ceno إعادة التوجيه تلك، والآن أصبح يفتح تلقائيًا الموقع الأخير عند محاولة زيارة الموقع الأول.
de: Dies kann passieren, wenn Sie in der Vergangenheit eine alte Version von Ceno verwendet haben, um eine gesperrte Website zu besuchen, und jemand die Verbindung abgefangen und auf einen illegalen Server umgeleitet hat. Ceno hat sich dann diese Umleitung gemerkt und öffnet nun automatisch die letztgenannte Website, wenn Sie versuchen, die erstgenannte zu besuchen.
es: Esto puede suceder cuando usaste una versión antigua de Ceno para visitar un sitio bloqueado en el pasado, y alguien interceptó la conexión y la dirigió hacia un servidor ilegítimo. Ceno luego recordó esa redirección, y ahora abre automáticamente este último sitio cuando intentas visitar el anterior.
fr: Cela peut se produire lorsque vous avez utilisé une ancienne version de Ceno pour visiter un site bloqué dans le passé, et que quelqu'un a intercepté la connexion et l'a dirigée vers un serveur illégitime. Ceno s'est alors souvenu de cette redirection, et maintenant il ouvre automatiquement ce dernier site en essayant de visiter le premier.
id: Hal ini dapat terjadi ketika Anda menggunakan Ceno versi lama untuk mengunjungi situs yang diblokir di masa lalu dan seseorang mencegat koneksi dan mengarahkannya ke server yang tidak sah. Ceno kemudian mengingat pengalihan tersebut dan sekarang secara otomatis membuka situs yang terakhir ketika mencoba mengunjungi situs yang pertama.
pt: Isso pode acontecer quando usou uma versão antiga do Ceno para visitar um website bloqueado no passado e alguém interceptou a conexão e a direcionou para um servidor ilegítimo. Ceno, então, lembrou-se desse redirecionamento e agora automaticamente abre o último website ao tentar visitar o primeiro.
pt_br: Isso pode acontecer quando você usou uma versão antiga do Ceno para visitar um website bloqueado no passado e alguém interceptou a conexão e a direcionou para um servidor ilegítimo. Ceno, então, lembrou desse redirecionamento e agora automaticamente abre o último website ao tentar visitar o primeiro.
ru: Это может происходить если ранее вы использовали более старую версию Ceno для доступа к заблокированному сайту, а кто-то перехватил соединение и направил его на подставной сервер. Тогда Ceno запомнил это перенаправление и теперь автоматически открывает подставной сайт при попытке посетить оригинальный.
tr: Siteye erişmek için daha önce eski bir CENO sürümü kullanmış ve bağlantınıza birisi tarafından karışılarak yanlış sunucuya yönlendirilmiş olabilirsiniz. CENO bu yönlendirmeyi hatırlayarak kendiliğinden önceki siteye erişmeye çalıştığınızda yanlış yönlendirilen siteyi açıyor olabilir.
ur: ایسا اس وقت ہو سکتا ہے جب آپ نے ماضی میں کسی بلاک شدہ سائٹ پر جانے کے لیے Ceno کا پرانا ورژن استعمال کیا ہو، اور کسی نے کنکشن کو روک کر اسے کسی ناجائز سرور پر بھیج دیا ہو۔ Ceno کو پھر اس ری ڈائریکشن کو یاد آیا، اور اب یہ خود بخود مؤخر الذکر سائٹ کو کھولتا ہے جب سابقہ کو دیکھنے کی کوشش کی جاتی ہے۔

source: One way to fix this issue is to clear Ceno's normal browsing cache by choosing *Settings* in the app's main menu, then *Clear private data*, and disabling all boxes but *Cache* before tapping on *Clear data*.
ar: يمكن إصلاح هذه المشكلة عن طريق مسح ذاكرة التخزين المؤقت للتصفح العادي لـ Ceno وذلك باختيار *الإعدادات* في القائمة الرئيسية للتطبيق، ثم *مسح البيانات الخاصة*، وتعطيل جميع المربعات غير *ذاكرة التخزين المؤقت* قبل النقر على *مسح البيانات*.
de: Eine Möglichkeit, dieses Problem zu beheben, besteht darin, den normalen Browser-Cache von Ceno zu löschen, indem Sie im Hauptmenü der App *Einstellungen* wählen, dann *Private Daten löschen*, und alle Kästchen außer *Cache* deaktivieren, bevor Sie auf *Daten löschen* tippen.
es: Una manera de solucionar esta dificultad es limpiar el caché normal de navegación de Ceno eligiendo *Configuración* en el menú principal de la app, luego *Limpiar datos privados*, y deshabilitar todas las casillas excepto *Caché* antes de pulsar sobre *Limpiar datos*.
fr: Une façon de résoudre ce problème consiste à vider le cache de navigation normal de Ceno en choisissant *Paramètres* dans le menu principal de l'application, puis *Effacer les données privées*, et en désactivant toutes les cases sauf *Cache* avant d'appuyer sur *Effacer les données*.
id: Salah satu cara untuk mengatasi masalah ini adalah dengan menghapus tembolok penjelajahan normal Ceno dengan memilih *Pengaturan* di menu utama aplikasi, lalu *Hapus data pribadi*, dan menonaktifkan semua kotak kecuali *Tembolok* sebelum mengetuk *Hapus data*.
pt: Uma forma de consertar esse problema é limpar o cache de navegação normal do Ceno escolhendo *Configurações* no menu principal da app, depois clicando em *Limpar dados privados* e desativando todas as caixas exceto *Cache* antes de tocar em *Limpar dados*.
pt_br: Uma forma de consertar esse problema é limpar o cache de navegação normal do Ceno escolhendo *Configurações* no menu principal do aplicativo, depois clicando em *Limpar dados privados* e desabilitando todas as caixas exceto *Cache* antes de tocar em *Limpar dados*.
ru: Это можно исправить очистив обычный кэш Ceno, открыв *Параметры* в главном меню приложения, выбрав *Удалить мои данные* и сняв все галочки кроме *Кэш* перед выбором *Удалить данные*.
tr: Bu sorunu çözmek için uygulama ana menüsünden *Ayarlar* bölümüne gidip *Kişisel verileri temizle* üzerine dokunarak CENO'nun normal gezinme ön belleğini temizleyebilirsiniz.
ur: اس مسئلے کو حل کرنے کا ایک طریقہ یہ ہے کہ ایپ کے مین مینو میں *ترتیبات* کو منتخب کرکے Ceno کے عام براؤزنگ کیش کو صاف کریں، پھر *نجی ڈیٹا کو صاف کریں*، اور *ڈیٹا کو صاف کریں* پر دبانے سے پہلے *کیش* کے علاوہ تمام باکسز کو غیر فعال کریں۔

source: Please note that Ceno version 1.3.0 and newer avoid that hijacking of newly visited sites by always using HTTPS, as explained in the previous section.
ar: يرجى ملاحظة أن إصدار Ceno 1.3.0 والإصدارات الأحدث تتجنب هذه القرصنة للمواقع التي تمت زيارتها حديثًا باستخدام HTTPS دائمًا، كما هو موضح في القسم السابق.
de: Bitte beachten Sie, dass Ceno Version 1.3.0 und neuer dieses Hijacking von neu besuchten Seiten verhindert, indem es immer HTTPS verwendet, wie im vorherigen Abschnitt erklärt.
es: Por favor ten en cuenta que las versiones 1.3.0 y posteriores de Ceno evitan el secuestro de sitios visitados recientemente empleando siempre HTTPS, como se explicó en la sección previa.
fr: Veuillez noter que la version 1.3.0 et les versions ultérieures de Ceno évitent le piratage des sites nouvellement visités en utilisant toujours HTTPS, comme expliqué dans la section précédent.
id: Harap dicatat bahwa Ceno versi 1.3.0 dan yang lebih baru bisa menghindari pembajakan situs yang baru dikunjungi dengan selalu menggunakan HTTPS, seperti yang dijelaskan di bagian sebelumnya.
pt: Por favor, observe que as versões 1.3.0 e posteriores do Ceno evitam o sequestro de websites recentemente visitados pelo uso perene de HTTPS, como explicado na secção anterior.
pt_br: Por favor, observe que as versões 1.3.0 e posteriores do Ceno evitam o sequestro de websites recentemente visitados pelo uso perene de HTTPS, como explicado na seção anterior.
ru: Обратите внимание что начиная с версии 1.3.0 Ceno избегает подобного перехвата впервые посещаемых сайтов благодаря исключительному использованию HTTPS, как мы описали ранее.
tr: Önceki bölümde de anlatıldığı gibi, 1.3.0 ve üzeri CENO sürümleri yeni ziyaret edilen sitelere yapılan bağlantıların ele geçirilmesini önlemek için her zaman HTTPS kullanır.
ur: براہ کرم نوٹ کریں کہ Ceno ورژن 1.3.0 اور اس سے نئے ورژن ہمیشہ HTTPS استعمال کرکے نئی وزٹ کی گئی سائٹس کو ہائی جیک کرنے سے بچتے ہیں، جیسا کہ پچھلے حصے میں بیان کیا گیا ہے۔

source: Others cannot retrieve content seeded by my device
ar: لا يمكن للآخرين استرداد المحتوى الموزع من جهازي
de: Andere können die von meinem Gerät gesendeten Inhalte nicht abrufen
es: Otros no pueden descargar contenido sembrado por mi dispositivo
fa: دیگران نمی‌توانند محتوای بذرپاشی‌شده توسط دستگاه مرا بازیابی کنند
fr: Les autres ne peuvent pas récupérer le contenu créé par mon appareil
id: Orang lain tidak dapat mengambil konten yang disebarkan oleh perangkat saya
my: အခြားစက်များသည် ကျွန်ုပ်၏ စက်က တင်ပို့ထားသော အကြောင်းအရာကို ပြန်မထုတ်နိုင်ပါ
pt: Outras pessoas não conseguem recuperar conteúdo semeado pelo meu aparelho
pt_br: Outras pessoas não conseguem recuperar conteúdo semeado pelo meu dispositivo
ru: Пользователи не могут получить контент, раздаваемый моим устройством
tr: Aygıtımdan gönderilen içerik başkaları tarafından alınamıyor
uk: Користувачі не можуть отримати вміст, що роздається моїм пристроєм
ur: دوسرے میرے ڈیوائس کے ذریعے سیڈ کردہ مواد کو بازیافت نہیں کر سکتے ہیں
