Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/troubleshooting.po
Languages: ar, de, es, fa, fr, id, my, pt, pt_br, ru, tr, uk, ur

source: Your device has a working connection to the network, i.e. your normal Web browser is able to open some Web sites. Ceno and Ouinet cannot work when all network connectivity is shut down (although users may still find a common Wi-Fi access point to do device-to-device sharing).
ar: تأكد أن اتصال جهازك بالشبكة يعمل، أي أن متصفح الويب العادي لديك قادر على فتح بعض مواقع الويب. لا يمكن أن يعمل Ceno و Ouinet عندما يتم إغلاق جميع اتصالات الشبكة (على الرغم من ذلك يمكن للمستخدمين أن يجدوا نقطة وصول Wi-Fi مشتركة للقيام بالمشاركة من جهاز إلى جهاز).
de: Ihr Gerät hat eine funktionierende Verbindung zum Netz, d. h. Ihr normaler Webbrowser kann einige Websites öffnen. Ceno und Ouinet können nicht funktionieren, wenn alle Netzwerkverbindungen abgeschaltet sind (obwohl die Benutzer immer noch einen gemeinsamen Wi-Fi-Zugangspunkt finden können, um die gemeinsame Nutzung von Geräten zu ermöglichen).
es: Tu dispositivo tiene una conexión funcional a la red, por ejemplo tu navegador Web normal es capaz de abrir algunos sitios Web. Ceno y Ouinet no pueden funcionar cuando toda la conectividad de red está cortada (aunque la(o)s usuaria(o)s aún podrían encontrar un punto de acceso Wi-Fi común para compartir de dispositivo a dispositivo).
fr: Votre appareil dispose d'une connexion fonctionnelle au réseau, c'est-à-dire que votre navigateur Web normal est capable d'ouvrir certains sites Web. Ceno et Ouinet ne peuvent pas fonctionner lorsque toute la connectivité réseau est fermée (bien que les utilisateurs puissent toujours trouver un point d'accès Wi-Fi commun pour effectuer le partage d'appareil à appareil).
id: Perangkat Anda memiliki koneksi ke jaringan, misalnya peramban web Anda dapat membuka beberapa situs web. Ceno dan Ouinet tidak dapat berfungsi ketika semua konektivitas jaringan dimatikan (meskipun pengguna masih dapat menemukan titik akses Wi-Fi yang umum untuk berbagi perangkat ke perangkat).
pt: O seu aparelho tem uma conexão funcional com a rede, isto é, o seu navegador Web comum é capaz de abrir alguns websites. Ceno e Ouinet não conseguem funcionar quando toda a conectividade de rede está cortada (apesar de utilizadores ainda poderem encontrar um ponto de acesso WiFi em comum para fazer partilhamento de aparelho para aparelho).
pt_br: Seu dispositivo tem uma conexão funcional com a rede, isto é, seu navegador Web comum é capaz de abrir alguns websites. Ceno e Ouinet não conseguem funcionar quando toda a conectividade de rede está cortada (apesar de usuários ainda poderem encontrar um ponto de acesso WiFi em comum para fazer compartilhamento de dispositivo para dispositivo).
ru: Ваше устройство имеет рабочее подключение к сети, т.е. ваш обычный веб-браузер может открывать веб-сайты. Ceno и Ouinet не могут работать, если все сетевые подключения отключены (хотя пользователи могут найти общую точку доступа Wi-Fi для распространения контента от устройства к устройству напрямую).
tr: İnternet bağlantınızın çalıştığından emin olun, yani normalde kullandığınız tarayıcı, sayfaları yükleyebiliyor olmalı. CENO ve Ouinet tüm ağ bağlantıları kapatıldığında çalışamaz (kullanıcılar yine de aygıttan aygıta paylaşım için ortak bir ağ bulabilirler).
ur: آپ کے ڈیوائس کا نیٹ ورک کے ساتھ کام کرنے والا کنکشن ہے، یعنی آپ کا عام ویب براؤزر کچھ ویب سائٹس کھولنے کے قابل ہے۔ تمام نیٹ ورک کنیکٹیویٹی بند ہونے پر Ceno اور Ouinet کام نہیں کر سکتے ہیں (حالانکہ صارفین اب بھی ڈیوائس ٹو ڈیوائس شیئرنگ کرنے کے لیے ایک عام Wi-Fi رسائی پوائنٹ تلاش کر سکتے ہیں)۔

source: If that is the case, it is worth explaining what may be happening for all access mechanisms to fail, to give you an idea of your chances for getting content using Ceno.
ar: إذا كان الأمر كذلك، من المهم شرح ما قد يحدث لتفشل جميع آليات الوصول، لإعطائك فكرة عن فرصك في الحصول على المحتوى باستخدام Ceno.
de: Wenn dies der Fall ist, lohnt es sich zu erklären, was passieren kann, damit alle Zugriffsmechanismen fehlschlagen, um Ihnen eine Vorstellung davon zu geben, wie Ihre Chancen stehen, mit Ceno an Inhalte zu gelangen.
es: Si ese es el caso, vale la pena explicar qué podría estar pasando para que todos los mecanismos de acceso fallen, para darte una idea de las posibilidades que tienes de obtener contenido usando Ceno.
fr: Si tel est le cas, il vaut la peine d'expliquer ce qui peut se passer si tous les mécanismes d'accès échouent, pour vous donner une idée de vos chances d'obtenir du contenu en utilisant Ceno.
id: Jika itu masalahnya, ada baiknya menjelaskan apa yang mungkin terjadi sehingga menyebabkan semua mekanisme akses gagal, untuk memberi Anda gambaran tentang peluang Anda untuk mendapatkan konten menggunakan Ceno.
pt: Se é o caso, vale a pena explicar o que pode estar acontecendo para que todos os mecanismos de acesso estejam falhando, para que tenha uma ideia das suas chances em obter conteúdo através de Ceno.
pt_br: Se esse é o caso, vale a pena explicar o que pode estar acontecendo para que todos os mecanismos de acesso estejam falhando, para que você tenha uma ideia de suas chances em obter conteúdo usando o Ceno.
ru: В таком случае стоит объяснить, что может произойти, чтобы все механизмы доступа не сработали, чтобы дать вам представление о ваших шансах на получение контента с помощью Ceno.
tr: Durum buysa, tüm erişim yöntemlerinin başarısız olmasına neyin neden olduğunu açıklamak CENO kullanarak içerik alma olasılığınızla ilgili bir fikriniz olmasını sağlayabilir.
ur: اگر ایسا ہے تو، یہ وضاحت کرنے کے قابل ہے کہ رسائی کے تمام طریقہ کار کے ناکام ہونے کے لیے کیا ہو رہا ہے، تاکہ آپ کو Ceno کا استعمال کرتے ہوئے مواد حاصل کرنے کے امکانات کا اندازہ ہو سکے۔

source: Origin access
ar: الوصول للأصل
de: Zugang zum Ursprung
es: Acceso al origen
fa: دسترسی به اصل
fr: Accès à l'origine
id: Akses server asal
my: မူလ ဝင်ရောက်သုံးစွဲခွင့်
pt: Acesso à origem
pt_br: Acesso à origem
ru: Исходный доступ
tr: Kaynaktan erişim
uk: Вихідний доступ
ur: اصل رسائی

source: Your Ceno Browser cannot directly reach the content's origin server. Either the server is having some difficulties itself (e.g. it is down or under some attack), or someone is interfering with your connection to it.
ar: لا يمكن لمتصفح Ceno الخاص بك الوصول مباشرة إلى الخادم الأصلي للمحتوى. إما أن الخادم يواجه بعض الصعوبات (على سبيل المثال، معطل أو يتعرض لهجوم ما)، أو أن شخصًا ما يتدخل في اتصالك به.
de: Ihr Ceno Browser kann den Ursprungsserver des Inhalts nicht direkt erreichen. Entweder hat der Server selbst Schwierigkeiten (z. B. ist er ausgefallen oder wird angegriffen), oder jemand stört Ihre Verbindung zu ihm.
es: Tu Navegador Ceno no puede alcanzar directamente el contenido del servidor de origen. O bien el servidor está teniendo algunas dificultades por sí mismo (ej.: está caído o bajo algún ataque), o alguien está interfiriendo con tu conexión a él.
fr: Votre navigateur Ceno ne peut pas atteindre directement le serveur d'origine du contenu. Soit le serveur rencontre lui-même des difficultés (par exemple, il est en panne ou subit une attaque), soit quelqu'un interfère avec votre connexion.
id: Peramban Ceno Anda tidak dapat secara langsung menjangkau server asal suatu konten. Bisa jadi server itu sendiri sedang mengalami masalah (misalnya sedang down atau diserang), atau ada yang mengganggu koneksi Anda ke server tersebut.
pt: O seu Navegador Ceno não pode alcançar diretamente o conteúdo do servidor de origem. Ou o servidor está, ele mesmo, enfrentando dificuldades (por exemplo, caiu ou está sob ataque), ou alguém interfere com a sua conexão com ele.
pt_br: Seu Navegador Ceno não pode alcançar diretamente o conteúdo do servidor de origem. Ou o servidor está, ele mesmo, enfrentando dificuldades (por exemplo, caiu ou está sob ataque), ou alguém está interferindo em sua conexão com ele.
ru: Ваш Браузер Ceno не может напрямую связаться с исходным сервером контента. Либо сервер сам испытывает какие-то трудности (например, не работает или подвергается атаке), либо кто-то мешает вашему подключению к нему.
tr: CENO Browser içeriğin kaynak sunucusuna doğrudan erişemiyor. Sunucuda teknik sorunlar (bakım ya da saldırı) olabileceği gibi birisi bağlantınıza karışıyor da olabilir.
ur: آپ کا Ceno براؤزر براہ راست مواد کے اصل سرور تک نہیں پہنچ سکتا۔ یا تو سرور کو خود کچھ دشواریوں کا سامنا ہے (مثلاً یہ نیچے ہے یا کسی حملے کی زد میں ہے)، یا کوئی اس سے آپ کے کنکشن میں مداخلت کر رہا ہے۔

source: This is the main use case for Ceno and the other mechanisms should compensate for it.
ar: هذه هي حالة الاستخدام الرئيسية لـ Ceno ويجب أن تعوضها الآليات الأخرى.
de: Dies ist der Hauptanwendungsfall für Ceno, und die anderen Mechanismen sollten dies kompensieren.
es: Este es el caso principal de uso para Ceno y los otros mecanismos deberían compensar por él.
fr: C'est le principal cas d'utilisation de Ceno et les autres mécanismes devraient le compenser.
id: Ini adalah kasus penggunaan utama untuk Ceno dan mekanisme lainnya harus mengimbanginya.
pt: Este é o principal caso de uso do Ceno e os outros mecanismos devem compensá-lo.
pt_br: Este é o principal caso de uso do Ceno e os outros mecanismos devem compensá-lo.
ru: Ceno создан для решения именно таких проблем, поэтому другие способы доступа должны помочь с этим.
tr: Asıl CENO kullanım durumu budur ve diğer yöntemler bu sorunu çözmelidir.
ur: یہ Ceno کے لیے استعمال کا بنیادی معاملہ ہے اور دیگر طریقہ کار کو اس کی تلافی کرنی چاہیے۔

source: Proxy/Injector access
ar: وصول الوكيل / الحاقن
de: Proxy-/Injektor-Zugang
es: Acceso al Proxy/Inyector
fa: دسترسی به پروکسی/انژکتور
fr: Accès proxy/injecteur
id: Akses Proksi/Injektor
my: ပရောက်စီ/ထိုးသွင်းဖိုင် ဝင်ရောက်သုံးစွဲခွင့်
pt: Acesso ao proxy/injetor
pt_br: Acesso ao proxy/injetor
ru: Доступ к прокси/инъектору
tr: Vekil sunucu veya içerik ekleyici erişimi
uk: Доступ до проксі/інʼєктора
ur: پراکسی/انجیکٹر تک رسائی

source: Someone is interfering with your connection to Internet addresses in the injector swarm. Since this is expected to happen eventually as Ceno (and Ouinet) gain traction, Ceno resorts to reaching injectors via other clients acting as bridges.
ar: يتدخل شخص ما في اتصالك بعناوين الإنترنت في سرب الحقن. نظرًا لأنه من المتوقع أن يحدث هذا مع اكتساب Ceno (و Ouinet) جاذبية أكثر، يلجأ Ceno إلى الوصول إلى الحاقنات عبر عملاء آخرين يعملون كجسور.
de: Jemand stört Ihre Verbindung zu Internetadressen im Injektorschwarm. Da damit zu rechnen ist, dass dies mit zunehmender Verbreitung von Ceno (und Ouinet) geschehen wird, greift Ceno darauf zurück, die Injektoren über andere Clients zu erreichen, die als Brücken fungieren.
es: Alguien está interfiriendo con tu conexión a direcciones de Internet en el enjambre de inyectores. Ya que esto se espera que pase eventualmente en la medida en que Ceno (y Ouinet) se popularicen, Ceno recurre a alcanzar a los inyectores a través de otra(o)s clientes actuando como puentes.
fr: Quelqu'un interfère avec votre connexion aux adresses Internet dans l'essaim d'injecteurs. Étant donné que cela devrait se produire éventuellement à mesure que Ceno (et Ouinet) gagne du terrain, Ceno recourt à atteindre les injecteurs via d'autres clients agissant comme des ponts.
id: Seseorang mengganggu koneksi Anda ke alamat internet dalam kumpulan injektor. Hal ini diperkirakan pada akhirnya akan terjadi ketika Ceno (dan Ouinet) mendapatkan daya tarik, Ceno menggunakan cara untuk menjangkau para injektor melalui klien lain yang bertindak sebagai jembatan.
pt: Alguém interfere com a sua conexão com os endereços de Internet no enxame de injetores. Já que se espera que esse problema aconteça eventualmente, conforme Ceno (e Ouinet) se popularizem, Ceno recorre ao alcance dos injetores através de outros clientes agindo como pontes.
pt_br: Alguém está interferindo na sua conexão com os endereços de Internet no enxame de injetores. Já que se espera que esse problema aconteça eventualmente, conforme Ceno (e Ouinet) se popularizem, Ceno recorre ao alcance dos injetores através de outros clientes agindo como pontes.
ru: Кто-то вмешивается в ваше подключение к интернет-адресам из списка инъекторов. Мы ожидаем, что рано или поздно это может произойти, поскольку Ceno и Ouinet набирают обороты, и поэтому Ceno прибегает к доступу к инъекторам через других клиентов, выступающих в роли мостов.
tr: Birisi içerik ekleyici havuzundaki adreslere olan bağlantınıza karışıyor olabilir. CENO ilgi gördükçe bu durum yaşanabilir. CENO içerik ekleyicilere erişmek için köprü olarak çalışan diğer istemcilere başvurur.
ur: کوئی انجیکٹر بھیڑ میں انٹرنیٹ پتوں سے آپ کے کنکشن میں مداخلت کر رہا ہے۔ چونکہ Ceno (اور Ouinet) کے گرفت حاصل کرنے کے بعد ایسا ہونے کی توقع ہے، Ceno پل کے طور پر کام کرنے والے دوسرے کلائنٹس کے ذریعے انجیکٹر تک پہنچنے کا سہارا لیتا ہے۔

source: There are different reasons for Ceno being unable to reach such clients:
ar: هناك أسباب مختلفة لعدم تمكن Ceno من الوصول إلى هؤلاء العملاء:
de: Dass Ceno diese Clients nicht erreichen kann, hat verschiedene Gründe:
es: Hay razones diferentes para que Ceno no sea capaz de alcanzar tales clientes:
fr: Il existe différentes raisons pour lesquelles Ceno n'est pas en mesure d'atteindre ces clients :
id: Ada beberapa alasan mengapa Ceno tidak dapat menjangkau klien-klien tersebut:
pt: Há diferentes razões para o Ceno não conseguir alcançar tais clientes:
pt_br: Há diferentes razões para o Ceno não conseguir alcançar tais clientes:
ru: Существуют различные причины, по которым Ceno не может связаться с такими клиентами:
tr: Bu istemcilere CENO ile erişilememesinin farklı nedenleri olabilir:
ur: Ceno کے ایسے کلائنٹس تک پہنچنے میں ناکام ہونے کی مختلف وجوہات ہیں:

source: No other client is reachable by you. If only a few Ouinet clients are online, it is entirely possible that none of them are in a network that can be reached from the outside. This should become less likely as Ceno and Ouinet get popular and more clients with diverse connectivity come online.
ar: لا يمكنك الوصول إلى أي عميل آخر. إذا كان عدد قليل من عملاء Ouinet متصلين بالإنترنت، فمن المحتمل تمامًا ألا يكون أي منهم في شبكة يمكن الوصول إليها من الخارج. يجب أن يصبح هذا أقل احتمالية بما أن Ceno و Ouinet يكتسبان شهرة ويزداد عدد العملاء الذين لديهم اتصال متنوع عبر الإنترنت.
de: Kein anderer Client ist für Sie erreichbar. Wenn nur wenige Ouinet-Clients online sind, ist es durchaus möglich, dass sich keiner von ihnen in einem Netzwerk befindet, das von außen erreichbar ist. Dies sollte unwahrscheinlicher werden, je beliebter Ceno und Ouinet werden und je mehr Clients mit unterschiedlicher Konnektivität online gehen.
es: Ningún otra(o) cliente es alcanzable por ti. Si solamente unos pocos clientes Ouinet están en línea, es por completo posible que ninguna(o) de ella(o)s esté en una red que pueda ser alcanzada desde el exterior. Esto debería tornarse menos probable a medida que Ceno y Ouinet se popularicen y más clientes con conectividad diversa aparezcan en línea.
fr: Aucun autre client n'est joignable par vous. Si seuls quelques clients Ouinet sont en ligne, il est tout à fait possible qu'aucun d'entre eux ne se trouve dans un réseau joignable de l'extérieur. Cela devrait devenir moins probable à mesure que Ceno et Ouinet deviennent populaires et que de plus en plus de clients avec une connectivité diversifiée se connectent.
id: Tidak ada klien lain yang dapat dijangkau oleh Anda. Jika hanya beberapa klien Ouinet yang aktif secara daring, sangat mungkin tidak ada satu pun dari mereka yang berada dalam jaringan yang dapat dijangkau dari luar. Hal ini seharusnya menjadi lebih kecil kemungkinannya ketika Ceno dan Ouinet menjadi populer dan lebih banyak klien dengan konektivitas yang aktif.
pt: Nenhum outro cliente é alcançável por si. Se apenas alguns clientes Ouinet estiverem online, é totalmente possível que nenhum deles esteja numa rede que possa ser alcançada a partir do exterior. Esse cenário deverá se tornar menos provável à medida que Ceno e Ouinet se tornarem populares e mais clientes com conectividade diversificada ficarem online.
pt_br: Nenhum outro cliente é alcançável por você. Se apenas alguns clientes Ouinet estiverem online, é totalmente possível que nenhum deles esteja em uma rede que possa ser alcançada a partir do exterior. Esse cenário deverá se tornar menos provável à medida que Ceno e Ouinet se tornarem populares e mais clientes com conectividade diversificada ficarem online.
ru: Ни один другой клиент не является для вас доступным. Если только несколько клиентов Ouinet сейчас онлайн, вполне возможно, что ни один из них не находится в сети, доступной извне. Это должно стать менее вероятным по мере роста популярности Ceno и Ouinet и появления большего числа клиентов с различными возможностями подключения.
tr: Erişebileceğiniz başka bir istemci olmaması. Yalnızca birkaç Ouinet istemcisi çevrim içi ise hiçbiri dışarıdan erişilebilen bir ağda bulunmuyor olabilir. CENO ve Ouinet yaygınlaştıkça ve yüksek kapasiteli bağlantıları olan diğer istemciler çevrim içi oldukça bu durumun olasılığı azalır.
ur: کوئی دوسرا کلائنٹ آپ تک نہیں پہنچ سکتا۔ اگر صرف چند Ouinet کلائنٹس آن لائن ہیں، تو یہ مکمل طور پر ممکن ہے کہ ان میں سے کوئی بھی ایسے نیٹ ورک میں نہ ہو جس تک باہر سے پہنچا جا سکے۔ اس کا امکان کم ہونا چاہئے کیونکہ Ceno اور Ouinet مقبول ہو جاتے ہیں اور متنوع کنیکٹیویٹی والے زیادہ سے زیادہ کلائنٹ آن لائن آتے ہیں۔

source: The extreme case here is that connections between Ouinet clients are detected as such by a censor and blocked. This is quite unlikely (since it may entail blocking all BitTorrent traffic) and currently beyond what Ouinet supports, but we plan to make it more resistant against these attacks.
ar: أسوء حالة هنا هي أن الاتصالات بين عملاء Ouinet يتم اكتشافها من قبل الرقيب ويتم حظرها. هذا غير مرجح تمامًا (لأنه قد يستلزم حظر حركة مرور بت تورنت بالكامل) و يتجاوز قدرات Ouinet، لكننا نخطط لجعله أكثر مقاومة ضد هذه الهجمات.
de: Der Extremfall ist, dass Verbindungen zwischen Ouinet-Clients von einem Zensor als solche erkannt und blockiert werden. Dies ist recht unwahrscheinlich (da es dazu führen kann, dass der gesamte BitTorrent-Verkehr blockiert wird) und geht derzeit über das hinaus, was Ouinet unterstützt, aber wir planen, es widerstandsfähiger gegen solche Angriffe zu machen.
es: El caso extremo aquí es que las conexiones entre clientes Ouinet sean detectadas como tales por un censor y sean bloqueadas. Esto es bastante improbable (ya que podría implicar bloquear todo el tráfico de BitTorrent) y por el momento es más allá de lo que soporta Ouinet, pero planeamos hacerla más resistente contra estos ataques.
fa: مورد افراطی در این‌جا حالتی است که اتصالات بین سرویس‌گیرندگان وینت به‌وسیله‌ی یک سنسور تشخیص داده شوند و مسدود گردند. این کاملاً نامحتمل است (چون این می‌تواند انسداد کل ترافیک بیت‌تورنت را در پی آورد) و در حال حاضر فراسوی آن حدی است که وینت پشتیبانی‌اش می‌کند، اما ما بنا داریم آن را در برابر این حمله‌ها مقاوم‌تر سازیم.
fr: Le cas extrême ici est que les connexions entre clients Ouinet sont détectées comme telles par un censeur et bloquées. C'est assez peu probable (car cela peut impliquer de bloquer tout le trafic BitTorrent) et actuellement au-delà de ce que Ouinet prend en charge, mais nous prévoyons de le rendre plus résistant contre ces attaques.
id: Kasus ekstrim di sini adalah saat koneksi antara klien Ouinet terdeteksi oleh sensor dan diblokir. Hal ini sangat tidak mungkin (karena mungkin akan memblokir semua lalu lintas BitTorrent) dan ini di luar kemampuan Ouinet, tetapi kami berencana untuk membuatnya lebih tahan terhadap serangan ini.
my: လွန်ကဲသော ကိစ္စရပ်တွင် Ouinet လက်ခံစက်များအကြား ချိတ်ဆက်မှုများကို စိစစ်ရေးအဖွဲ့က ထိုသို့ ရှာဖွေထောက်လှမ်းပြီး ပိတ်ဆို့နိုင်သည်။ ယင်းသည် (BitTorrent အသွားအလာအားလုံးကို ပိတ်ဆို့ရန် မရှိမဖြစ် လိုအပ်နိုင်သောကြောင့်) ဖြစ်နိုင်ခြေ မရှိသည့်အပြင် လက်ရှိတွင် Ouinet က ပံ့ပိုးနိုင်သည်ထက် ပိုနေသော်လည်း ကျွန်ုပ်တို့သည် ဤတိုက်ခိုက်မှုများကို ပိုမိုဒဏ်ခံနိုင်အောင် ပြုလုပ်ရန် အစီအစဉ် ရှိသည်။
pt: O caso extremo aqui é o de as conexões entre clientes Ouinet serem identificadas como tais por um censor e então bloqueadas. Esta situação é bem improvável (pois ela poderia implicar um bloqueio de todo o tráfego BitTorrent) e, atualmente, está além do suportado pela Ouinet. Mas planeamos torná-la mais resistente a estes ataques.
pt_br: O caso extremo aqui é o de as conexões entre clientes Ouinet serem identificadas como tais por um censor e então bloqueadas. Esta situação é bem improvável (pois ela poderia implicar um bloqueio de todo o tráfego BitTorrent) e, atualmente, está além do suportado pela Ouinet. Mas nós planejamos torná-la mais resistente a estes ataques.
ru: В самом плохом случае, соединения между клиентами Ouinet могут определяться цензором и блокироваться. Это довольно маловероятно (поскольку может повлечь за собой блокировку всего трафика BitTorrent) и в настоящее время выходит за рамки возможностей Ouinet, но мы планируем сделать сеть более устойчивой к таким атакам.
tr: Buradaki sıradışı durum Ouinet istemcilerinin arasındaki bağlantıların sansürleyiciler tarafından fark edilip engellenmiş olmasıdır. Bu durumun olma olasılığı azdır (çünkü tüm BitTorrent trafiğinin engellenmesini gerektirebilir) ve Ouinet kapsamı dışındadır. Ancak bu tarz saldırılara daha dayanıklı olmayı planlıyoruz.
uk: У найгіршому випадку, зʼєднання між клієнтами Ouinet ідентифікуються цензором і блокуються. Це досить малоймовірний сценарій (оскільки може призвести до блокування всього трафіку BitTorrent) і в даний час виходить за рамки можливостей Ouinet, але ми плануємо зробити мережу більш стійкою до таких атак.
ur: یہاں انتہائی معاملہ یہ ہے کہ Ouinet کلائنٹس کے درمیان روابط کا پتہ سنسر کے ذریعہ لگایا جاتا ہے اور اسے بلاک کردیا جاتا ہے۔ اس کا امکان بہت کم ہے (کیونکہ اس میں تمام BitTorrent ٹریفک کو روکنا شامل ہوسکتا ہے) اور فی الحال اس سے آگے جو Ouinet کی حمایت کرتا ہے، لیکن ہم اسے ان حملوں کے خلاف مزید مزاحم بنانے کا ارادہ رکھتے ہیں۔
