Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/troubleshooting.po
Languages: ar, de, es, fa, fr, id, my, pt, pt_br, ru, tr, uk, ur

source: First, make sure that your device is still seeding the content by going to the [*Ceno Settings* page](settings.md), only leaving the *Shared by other Ceno users* source box checked, then accessing that content again: it should load (at least partially), and tapping the Ceno address bar icon should only show non-zero values under *Shared by other Ceno users* or *Shared by you*.
ar: أولاً، تأكد من أن جهازك لا يزال يقوم ببث المحتوى من خلال الانتقال إلى [صفحة *إعدادات Ceno*](settings.md)، مع ترك مربع المصدر *تم مشاركته بواسطة مستخدمي Ceno الآخرين* فقط محددًا، ثم حاول الوصول إلى هذا المحتوى مرة أخرى: يجب أن يتم التحميل (جزئيًا على الأقل)، عند النقر على رمز Ceno في شريط العنوان يجب أن تظهر فقط قيم غير الصفر في *تم مشاركته بواسطة مستخدمي Ceno الآخرين* أو *تم مشاركته بواسطتك*.
de: Vergewissern Sie sich zunächst, dass Ihr Gerät die Inhalte immer noch weiterleitet, indem Sie die Seite [*Ceno-Einstellungen*](settings.md) aufrufen, nur das Kästchen *Freigegeben von anderen Ceno-Benutzern* markieren und dann erneut auf diese Inhalte zugreifen: Sie sollten (zumindest teilweise) geladen werden, und wenn Sie auf das Ceno-Adressleistensymbol tippen, sollten unter *Freigegeben von anderen Ceno-Benutzern* oder *Freigegeben von Ihnen* nur Werte ungleich Null angezeigt werden.
es: Primero, asegúrate de que tu dispositivo aún está sembrando el contenido yendo hacia la [página de *Configuración de Ceno*](settings.md), dejando marcada solamente la casilla *Compartido por otra(o)s usuaria(o)s de Ceno*, y accediendo luego a ese contenido de nuevo: debería cargarse (al menos parcialmente), y pulsando el icono Ceno en la barra de direcciones solamente debería mostrar valores no nulos bajo *Compartido por otros usuarios de Ceno* o *Compartido por ti*.
fr: Tout d'abord, assurez-vous que votre appareil est toujours en train d'ensemencer le contenu en accédant à la [*page Paramètres Ceno*](settings.md), en ne laissant que la case source *Partagé par d'autres utilisateurs Ceno* cochée, puis en accédant à nouveau à ce contenu : il devrait se charger (au moins partiellement), et appuyer sur l'icône de la barre d'adresse Ceno ne devrait afficher que des valeurs non nulles sous *Partagé par d'autres utilisateurs Ceno* ou *Partagé par vous*.
id: Pertama, pastikan bahwa perangkat Anda masih menyebarkan konten dengan membuka halaman [*Pengaturan Ceno* (settings.md), hanya membiarkan kotak sumber *Dibagikan oleh pengguna Ceno lainnya* dicentang, lalu akses lagi konten tersebut: konten tersebut seharusnya dimuat (setidaknya sebagian) dan mengetuk ikon bilah alamat Ceno hanya akan menampilkan nilai bukan nol di bawah *Dibagikan oleh pengguna Ceno lainnya* atau *Dibagikan oleh Anda*.
pt: Primeiro, certifique-se de que o seu aparelho ainda semea o conteúdo indo à [página *Configurações do Ceno*](settings.md), deixando marcada apenas a caixa source *Partilhado por outros utilizadores Ceno* e então acedendo esse conteúdo novamente: ele deve carregar (ao menos parcialmente) e tocar no ícone da barra de endereço do Ceno deve mostrar apenas valores diferentes de zero em *Partilhado por outros utilizadores Ceno* ou *Partilhado por si*.
pt_br: Primeiro, certifique-se de que seu dispositivo ainda está semeando o conteúdo indo à [página *Configurações do Ceno*](settings.md), deixando marcada apenas a caixa source *Compartilhado por outros usuários Ceno* e então acessando esse conteúdo novamente: ele deve carregar (ao menos parcialmente) e tocar no ícone da barra de endereço do Ceno deve mostrar apenas valores diferentes de zero em *Compartilhado por outros usuários Ceno* ou *Compartilhado por você*.
ru: Во-первых, убедитесь что ваше устройство все еще раздает контент. Для этого перейдите на страницу [*Настройки Ceno*](settings.md), оставьте отмеченным только флажок *Предоставлено другими пользователями Ceno*, а затем снова попытайтесь загрузить контент: он должен загрузиться (хотя бы частично), а нажатие на ярлык Ceno рядом с адресной строкой должно показать ненулевые значения только в разделах *Предоставлено другими пользователями Ceno* или *Предоставлено вами*.
tr: Öncelikle [*CENO ayarları* bölümüne](settings.md) gidip yalnızca *Diğer CENO kullanıcılarının paylaşımlarından* seçeneğinin açık bırakarak aygıtınızın içerikleri gönderdiğinden emin olun ve içeriğe yeniden erişmeyi deneyin. İçerik yüklendiğinde (bir parçası da olsa) CENO adres çubuğu simgesine dokunduğunuzda *Diğer CENO kullanıcılarının paylaşımlarından* ya da *Sizin paylaşımlarınızdan* bölümünde sıfırdan farklı değerler görmelisiniz.
ur: سب سے پہلے، یقینی بنائیں کہ آپ کا آلہ اب بھی [*Ceno ترتیبات* صفحہ](settings.md) پر جا کر مواد کو سیڈ کر رہا ہے، صرف *دوسرے Ceno صارفین کے ذریعے اشتراک کردہ۔* سورس باکس کو نشان زد چھوڑ کر، پھر اس مواد تک دوبارہ رسائی حاصل کریں: اسے لوڈ ہونا چاہیے (کم از کم جزوی طور پر)، اور Ceno ایڈریس بار کے دبانے سے صرف *دوسرے Ceno صارفین کے ذریعے اشتراک کردہ* یا *آپ کے ذریعہ اشتراک کردہ* کے تحت غیر صفر اقدار دکھائی جانی چاہئیں۔

source: If the content does not load, it could be that Ceno has already removed it, since it automatically cleans up stale content (older than a week by default) from your local cache. Enable the *Via the Ceno network (public)* source in the Settings page and access the content again. Please allow a couple of minutes to pass for the device to announce the content in the distributed cache index. Make *Shared by other Ceno users* the only checked box again and access the content once more; if it still does not load, it may be that the particular content is not deemed safe for sharing by Ouinet.
ar: إذا لم يتم تحميل المحتوى، فمن المحتمل أن يكون Ceno قد أزاله، لأنه يقوم تلقائيًا بتنظيف المحتوى القديم (افتراضيًا الأقدم من أسبوع) من ذاكرة التخزين المؤقت المحلية. قم بتمكين مصدر *عبر شبكة Ceno (العامة)* في صفحة الإعدادات ثم قم بالوصول إلى المحتوى مرة أخرى. يُرجى السماح بمرور دقيقتين ليتمكن الجهاز من الإعلان عن المحتوى في فهرس ذاكرة التخزين المؤقت الموزعة. اجعل *تم مشاركته بواسطة مستخدمي Ceno الآخرين* المربع الوحيد المحدد مرة أخرى و قم بالوصول إلى المحتوى مرة أخرى؛ إذا لم يتم تحميله بعد، فقد يكون المحتوى المعين غير آمن لمشاركته بواسطة Ouinet.
de: Wenn der Inhalt nicht geladen wird, kann es sein, dass Ceno ihn bereits entfernt hat, da es veraltete Inhalte (standardmäßig älter als eine Woche) automatisch aus dem lokalen Cache löscht. Aktivieren Sie die Quelle *Über das Ceno-Netzwerk (öffentlich)* auf der Seite Einstellungen und greifen Sie erneut auf die Inhalte zu. Bitte lassen Sie einige Minuten vergehen, bis das Gerät den Inhalt im verteilten Cache-Index bekannt gibt. Aktivieren Sie erneut das Kontrollkästchen *Freigegeben von anderen Ceno-Benutzern* und greifen Sie erneut auf den Inhalt zu; falls er immer noch nicht geladen wird, kann es sein, dass der betreffende Inhalt von Ouinet als nicht sicher für die Freigabe eingestuft wird.
es: Si el contenido no se carga, podría ser que Ceno ya lo haya eliminado, ya que limpia automáticamente al contenido obsoleto (en forma predeterminada, más de una semana de antigüedad) de tu caché local. Habilita la fuente *Vía la red Ceno (pública)* en la página Configuración y accede al contenido de nuevo. Por favor espera un par de minutos para que el dispositivo anuncie el contenido en el índice de la caché distribuida. De nuevo, haz de *Compartido por otros usuarios de Ceno* la única casilla marcada, y accede al contenido una vez más; si aún no se carga, podría ser que ese contenido en particular no es determinado como seguro para compartir por Ouinet.
fr: Si le contenu ne se charge pas, il se peut que Ceno l'ait déjà supprimé, car il nettoie automatiquement le contenu obsolète (plus d'une semaine par défaut) de votre cache local. Activez la source *Via le réseau Ceno (public)* dans la page Paramètres et accédez à nouveau au contenu. Veuillez patienter quelques minutes pour que l'appareil annonce le contenu de l'index de cache distribué. Faites de nouveau *Partagé par d'autres utilisateurs Ceno* la seule case cochée et accédez à nouveau au contenu ; s'il ne se charge toujours pas, il se peut que le contenu particulier ne soit pas considéré comme sûr pour le partage par Ouinet.
id: Jika konten tidak dimuat, mungkin saja Ceno telah menghapusnya, karena secara otomatis Ceno membersihkan konten yang sudah basi (lebih dari seminggu secara bawaan) dari tembolok lokal Anda. Aktifkan sumber *Melalui jaringan Ceno (publik)* di halaman Pengaturan dan akseslah konten itu lagi. Tunggu beberapa menit agar perangkat menginformasikan bahwa konten ada dalam indeks tembolok terdistribusi. Jadikan *Dibagikan oleh pengguna Ceno lainnya* sebagai satu-satunya kotak yang dicentang dan akses konten tersebut sekali lagi; jika masih tidak dimuat, mungkin konten tertentu tidak dianggap aman untuk dibagikan oleh Ouinet.
pt: Se o conteúdo não carregar, pode ser que o Ceno já o tenha removido, pois ele automaticamente limpa conteúdo obsoleto (mais antigo que uma semana, por padrão) do seu cache local. Ative a source *Via rede do Ceno (pública)* na página de Configurações e acesse o conteúdo novamente. Por favor, espere alguns minutos se passarem para que o aparelho anuncie o conteúdo no índex do cache distribuído. Torne *Partilhado por outros utilizadores Ceno* a única caixa marcada novamente e acesse o conteúdo mais uma vez. Se ele ainda não carregar, pode ser que esse conteúdo em particular não seja considerado seguro para partilhamento pela Ouinet.
pt_br: Se o conteúdo não carregar, pode ser que o Ceno já o tenha removido, pois ele automaticamente limpa conteúdo obsoleto (mais antigo que uma semana, por padrão) do seu cache local. Ative a source *Via rede do Ceno (pública)* na página de Configurações e acesse o conteúdo novamente. Por favor, espere alguns minutos se passarem para que o dispositivo anuncie o conteúdo no índex do cache distribuído. Torne *Compartilhado por outros usuários Ceno* a única caixa marcada novamente e acesse o conteúdo mais uma vez. Se ele ainda não carregar, pode ser que esse conteúdo em particular não seja considerado seguro para compartilhamento pela Ouinet.
ru: Если контент не загружается, возможно, Ceno уже удалил его, поскольку он автоматически очищает устаревший контент (по умолчанию старше недели) из вашего локального кэша. Включите режим *Публичной сети Ceno* на странице настроек и снова получите доступ к контенту. Пожалуйста, дайте устройству пару минут, чтобы анонсировать контент в индексе распределенного кэша. Снова установите флажок *Размещено другими пользователями Ceno* и снова попытайтесь загрузить контент; если он по-прежнему не загружается, возможно, Ouinet не считает данный контент безопасным для общего доступа.
tr: İçerik yüklenmezse, CENO eski içerikleri (varsayılan ayar bir haftadan eski) yerel ön bellekten kendiliğinden temizlediği için zaten silmiş olabilir. Ayarlar sayfasından *CENO ağı üzerinden (herkese açık)* seçeneğini açın ve içeriğe yeniden erişmeye çalışın. Aygıtınızın dağıtılmış ön bellek dizinlerinde içeriği duyurması için bir kaç dakika bekleyin. Yalnızca *Diğer CENO kullanıcılarının paylaşımlarından* seçeneğini yeniden açın ve içeriğe bir kez daha erişmeye çalışın. Yine yüklenmezse içerik Ouinet tarafından paylaşılmak üzere güvenli bulunmamış olabilir.
ur: اگر مواد لوڈ نہیں ہوتا ہے، تو یہ ہو سکتا ہے کہ Ceno نے اسے پہلے ہی ہٹا دیا ہو، کیونکہ یہ آپ کے مقامی کیش سے خود بخود پرانا مواد (بطور ایک ہفتہ پرانا) صاف کر دیتا ہے۔ ترتیبات کے صفحے میں *بذریعہ Ceno نیٹ ورک (عوامی)* ماخذ کو فعال کریں اور مواد تک دوبارہ رسائی حاصل کریں۔ تقسیم شدہ کیش انڈیکس میں مواد کا اعلان کرنے کے لیے براہ کرم ڈیوائس کو چند منٹ گزرنے دیں۔ *دوسرے Ceno صارفین کے ذریعے اشتراک کردہ* کو دوبارہ سے واحد نشان زد باکس بنائیں اور ایک بار پھر مواد تک رسائی حاصل کریں۔ اگر یہ اب بھی لوڈ نہیں ہوتا ہے، تو ہو سکتا ہے کہ مخصوص مواد کو Ouinet کے ذریعے اشتراک کرنے کے لیے محفوظ نہ سمجھا جائے۔

source: If the previous step works, but another device with only the *Shared by other Ceno users* source enabled still shows "Failed to retrieve the resource…", there are two possible scenarios. If both devices are in the same network (e.g. on the same Wi-Fi access point), it could be that the network does not allow direct communication between devices connected to it. This happens in some public Wi-Fi networks, so try using a private one.
ar: إذا نجحت الخطوة السابقة، ولكن هناك جهاز آخر و الذي تم تمكين مصدر *تمت مشاركته بواسطة مستخدمي Ceno الآخرين* فيه لا يزال يعرض "فشل استرداد المورد..."، فهناك سيناريوهان محتملان. إذا كان كلا الجهازين في نفس الشبكة (على سبيل المثال على نفس نقطة وصول Wi-Fi)، فمن المحتمل أن الشبكة لا تسمح بالاتصال المباشر بين الأجهزة المتصلة بها. يحدث هذا في بعض شبكات Wi-Fi العامة، لذا حاول استخدام شبكة خاصة.
de: Wenn der vorherige Schritt funktioniert, aber ein anderes Gerät, bei dem nur die Quelle *Freigegeben von anderen Ceno-Benutzern* aktiviert ist, immer noch "Fehler beim Abrufen der Ressource..." anzeigt, gibt es zwei mögliche Szenarien. Wenn sich beide Geräte im selben Netzwerk befinden (z. B. am selben Wi-Fi-Zugangspunkt), könnte es sein, dass das Netzwerk keine direkte Kommunikation zwischen den angeschlossenen Geräten zulässt. Dies ist in einigen öffentlichen Wi-Fi-Netzwerken der Fall, versuchen Sie also, ein privates Netzwerk zu verwenden.
es: Si el paso previo funciona, pero otro dispositivo solamente con la fuente *Compartido por otra(o)s usuaria(o)s de Ceno* habilitada aún indica "Fallo al descargar el recurso…", hay dos escenarios posibles. Si ambos dispositivos están en la misma red (ej.: sobre el mismo punto de acceso Wi-Fi), podría ser que la red no permita la comunicación directa entre dispositivos conectados a ella. Esto pasa en algunas redes Wi-Fi públicas, por lo que intenta utilizar una privada.
fr: Si l'étape précédente fonctionne, mais qu'un autre appareil avec uniquement la source *Partagé par d'autres utilisateurs Ceno* activée affiche toujours "Échec de récupération de la ressource…", il y a deux scénarios possibles. Si les deux appareils sont sur le même réseau (par exemple sur le même point d'accès Wi-Fi), il se peut que le réseau ne permette pas la communication directe entre les appareils qui y sont connectés. Cela se produit sur certains réseaux Wi-Fi publics, essayez donc d'en utiliser un privé.
id: Jika langkah sebelumnya berhasil, tetapi perangkat lain yang hanya mengaktifkan sumber *Dibagikan oleh pengguna Ceno lainnya* masih menunjukkan "Gagal mengambil sumber daya...", ada dua skenario yang mungkin terjadi. Jika kedua perangkat berada dalam jaringan yang sama (misalnya pada titik akses Wi-Fi yang sama), mungkin saja jaringan tersebut tidak mengizinkan komunikasi langsung ke sesama perangkat yang terhubung dengannya. Hal ini terjadi pada beberapa jaringan Wi-Fi publik, jadi cobalah untuk menggunakan jaringan pribadi.
pt: Se a etapa anterior funcionar, mas outro aparelho com apenas a source *Partilhado por outros utilizadores Ceno* ativada ainda exibir "Falha em recuperar o recurso…", há dois cenários possíveis. Se ambos os aparelhos estão na mesma rede (por exemplo, no mesmo ponto de acesso WiFi), pode ser que a rede não permita comunicações diretas entre aparelhos lhe conectados. Isso acontece em algumas redes WiFi públicas, então tente usar uma privada.
pt_br: Se a etapa anterior funcionar, mas outro dispositivo com apenas a source *Compartilhado por outros usuários Ceno* ativada ainda exibir "Falha em recuperar o recurso…", há dois cenários possíveis. Se ambos os dispositivos estão na mesma rede (por exemplo, no mesmo ponto de acesso WiFi), pode ser que a rede não permita comunicações diretas entre dispositivos conectados a ela. Isso acontece em algumas redes WiFi públicas, então tente usar uma privada.
ru: Если предыдущий шаг работает, но другое устройство, на котором включен только режим *Предоставлено другими пользователями Ceno*, по-прежнему показывает сообщение "Не удалось загрузить ресурс...", возможны два сценария. Если оба устройства находятся в одной сети (например, на одной точке доступа Wi-Fi), может оказаться, что сеть не разрешает прямой обмен данными между подключенными к ней устройствами. Это происходит в некоторых публичных сетях Wi-Fi, поэтому попробуйте использовать частную сеть.
tr: Önceki adım çalışıyor fakat kaynak olarak *Diğer CENO kullanıcılarının paylaşımlarından* seçeneği açık olan başka bir aygıtta "Kaynak alınamadı..." hatası görüntüleniyorsa iki olasılık vardır. İki aygıtta aynı ağda olabilir (aynı kablosuz ağa bağlanmış) ya da ağ, bağlanan aygıtların aralarında doğrudan iletişim kurmalarına izin vermiyor olabilir. Herkese açık kablosuz ağlarda bu durum görülebilir, özel bir ağ kullanmayı deneyin.
ur: اگر پچھلا مرحلہ کام کرتا ہے، لیکن دوسرا ڈیوائس جس میں صرف *دوسرے Ceno صارفین کے ذریعہ اشتراک کردہ* ذریعہ فعال ہے پھر بھی ظاہر کرتا ہے کہ "وسائل کو بازیافت کرنے میں ناکام…"، دو ممکنہ منظرنامے ہیں۔ اگر دونوں ڈیوائسز ایک ہی نیٹ ورک میں ہیں (مثال کے طور پر ایک ہی Wi-Fi رسائی پوائنٹ پر)، تو یہ ہو سکتا ہے کہ نیٹ ورک اس سے منسلک ڈیوائسز کے درمیان براہ راست مواصلت کی اجازت نہ دے۔ یہ کچھ عوامی Wi-Fi نیٹ ورکس میں ہوتا ہے، لہذا ایک نجی Wi-Fi کو استعمال کرنے کی کوشش کریں۔

source: If the devices are in different networks, it could be due to a variety of reasons. One of them is that the network of the first device does not allow incoming connections: if you open its *Ceno Settings* page, under *Reachability status* it should say *reachable* or *likely reachable*. Otherwise seeding may not be possible from that network as it is.
ar: إذا كان الجهازين في شبكات مختلفة، فقد يرجع ذلك إلى عدة أسباب. أحدها هو أن شبكة الجهاز الأول لا تسمح بالاتصالات الواردة: إذا فتحت صفحة *إعدادات Ceno*، يجب أن تكون الحالة *يمكن الوصول إليها* أو *يمكن الوصول إليها على الأرجح* ضمن قائمة *حالة قابلية الوصول*. وإلا فقد لا يكون التوزيع ممكنًا من تلك الشبكة كما هي.
de: Wenn sich die Geräte in verschiedenen Netzen befinden, kann das verschiedene Gründe haben. Einer davon ist, dass das Netzwerk des ersten Geräts keine eingehenden Verbindungen zulässt: Wenn Sie die Seite *Ceno Einstellungen* öffnen, sollte unter *Erreichbarkeitsstatus* *erreichbar* oder *wahrscheinlich erreichbar* stehen. Andernfalls kann es sein, dass das Seeding von diesem Netzwerk aus nicht möglich ist.
es: Si los dispositivos están en diferentes redes, podría ser debido a una variedad de razones. Una de ellas es que la red del primer dispositivo no permite conexiones entrantes: si abres su página *Configuración de Ceno*, bajo *Estado de alcanzabilidad* debería decir *alcanzable* o *probablemente alcanzable*. De otro modo el sembrado podría no ser posible desde esa red tal como está.
fr: Si les appareils se trouvent dans des réseaux différents, cela peut être dû à diverses raisons. L'un d'eux est que le réseau du premier appareil n'autorise pas les connexions entrantes : si vous ouvrez sa page *Paramètres Ceno*, sous *État d'accessibilité*, il devrait indiquer *accessible* ou *probablement accessible*. Sinon, l'ensemencement peut ne pas être possible à partir de ce réseau tel qu'il est.
id: Jika perangkat berada di jaringan yang berbeda, hal ini bisa disebabkan oleh berbagai alasan. Salah satunya adalah jaringan perangkat pertama tidak mengizinkan koneksi masuk: jika Anda membuka halaman *Pengaturan Ceno*, di bawah *Status keterjangkauan*, seharusnya tertulis *dapat dijangkau* atau *kemungkinan dapat dijangkau*. Jika tidak, penyebaran konten mungkin tidak dapat dilakukan dari jaringan tersebut.
pt: Se os aparelhos estão em redes diferentes, pode ser devido a uma gama de razões. Uma delas é a rede do primeiro aparelho não permitir conexões ingressantes: se abrir a página *Configurações do Ceno*, em *Estado de acessibilidade* deve constar *alcançável* ou *provavelmente alcançável*. Caso contrário, pode não ser possível semear dessa rede tal como ela está.
pt_br: Se os dispositivos estão em redes diferentes, pode ser devido a uma gama de razões. Uma delas é a rede do primeiro dispositivo não permitir conexões ingressantes: se você abrir a página *Configurações do Ceno*, em *Estado de acessibilidade* deve constar *alcançável* ou *provavelmente alcançável*. Caso contrário, pode não ser possível semear dessa rede tal como ela está.
ru: Если устройства находятся в разных сетях, причин может быть несколько. Одна из них — сеть первого устройства не разрешает входящие соединения: если вы откроете его страницу *Настройки CENO*, в разделе *Статус доступности* должно быть написано *доступно* или *вероятно доступно*. В противном случае передача данных из этой сети невозможна.
tr: Aygıtlar farklı ağlarda ise sorunun bir kaç nedeni olabilir. Bu nedenlerden biri, ilk aygıtın ağının gelen bağlantıları engellemesi olabilir, *CENO ayarları* bölümünde *Erişilebilirlik durumu* için *Erişilebilir* ya da *Erişilebilir olmalı* yazmalıdır. Yoksa bu şekliyle o ağ üzerinden gönderim yapılamaz.
ur: اگر ڈیوائسز مختلف نیٹ ورکس میں ہیں، تو یہ مختلف وجوہات کی وجہ سے ہو سکتا ہے۔ ان میں سے ایک یہ ہے کہ پہلے ڈیوائس کا نیٹ ورک آنے والے رابطوں کی اجازت نہیں دیتا: اگر آپ اس کا *Ceno ترتیبات* صفحہ کھولتے ہیں، تو *رسائی کی حیثیت* کے تحت اسے *قابل رسائی* یا *ممکنہ طور پر قابل رسائی* کہنا چاہیے۔ بصورت دیگر اس نیٹ ورک سے سيڈنگ ممکن نہیں جیسا کہ یہ ہے۔
