Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/troubleshooting.po
Languages: ar, de, es, fa, fr, id, my, pt, pt_br, ru, tr, uk, ur

source: When you launch Ceno, the state may read `starting` for a few seconds; this is normal. However, if the state remains `starting` for too long, it may be a signal of serious connectivity issues that preclude the application from reaching the BitTorrent network. Please check your network connection and try restarting Ceno. If you have a working connection but the state remains `starting`, please contact us (especially if the state was `started` in some previous run).
ar: عند تشغيل Ceno، قد تقرأ الحالة `بدء` لبضع ثوان؛ هذا امر طبيعي. ومع ذلك، إذا ظلت الحالة `بدء` لفترة طويلة، فقد تكون إشارة إلى وجود مشاكل جدية في الاتصال تمنع التطبيق من الوصول إلى شبكة بت تورنت. يرجى التحقق من اتصالك بالشبكة ومحاولة إعادة تشغيل Ceno. إذا كان لديك اتصال يعمل ولكن الحالة لا تزال `بدء`، فالرجاء الاتصال بنا (خاصة إذا كانت الحالة `بدأت` في تشغيل سابق).
de: Wenn Sie Ceno starten, kann der Status einige Sekunden lang "Starting" lauten; das ist normal. Wenn der Status jedoch zu lange auf "Start" bleibt, kann dies ein Zeichen für ernsthafte Verbindungsprobleme sein, die verhindern, dass die Anwendung das BitTorrent-Netzwerk erreicht. Bitte überprüfen Sie Ihre Netzwerkverbindung und versuchen Sie, Ceno neu zu starten. Wenn Sie eine funktionierende Verbindung haben, aber der Status "starting" bleibt, kontaktieren Sie uns bitte (insbesondere wenn der Status "started" in einem früheren Lauf war).
es: Cuando ejecutas Ceno, el estado podría indicar `starting` por unos segundos, esto es normal. Sin embargo, si el estado permanece en `starting` por demasiado tiempo, podría ser una señal de dificultades serias de conectividad que evitan que la aplicación alcance a la red BitTorrent. Por favor, comprueba tu conexión de red e intenta reiniciar Ceno. Si tienes una conexión funcional, pero el estado permanece en `starting`, por favor contáctanos (sobre todo si el estado fue `started` en ejecuciones anteriores).
fr: Lorsque vous lancez Ceno, l'état peut indiquer "démarrage" pendant quelques secondes ; c'est normal. Cependant, si l'état reste "démarrage" trop longtemps, cela peut être le signe de graves problèmes de connectivité qui empêchent l'application d'atteindre le réseau BitTorrent. Veuillez vérifier votre connexion réseau et essayez de redémarrer Ceno. Si vous avez une connexion qui fonctionne mais que l'état reste "démarrage", veuillez nous contacter (surtout si l'état était "démarré" lors d'une exécution précédente).
id: Ketika Anda meluncurkan Ceno, status mungkin akan terbaca `memulai` selama beberapa detik; ini adalah hal yang normal. Namun, jika statusnya tetap `memulai` terlalu lama, mungkin ini merupakan tanda adanya masalah konektivitas serius yang menghalangi aplikasi untuk menjangkau jaringan BitTorrent. Silakan periksa koneksi jaringan Anda dan coba mulai ulang Ceno. Jika Anda memiliki koneksi yang berfungsi tetapi statusnya tetap `memulai`, silakan hubungi kami (terutama jika statusnya `memulai` pada beberapa proses sebelumnya).
pt: Quando abre Ceno, o estado pode indicar `a inicializar` por alguns segundos, esse comportamento é normal. No entanto, se o estado permanece `a inicializar` por muito tempo, pode ser um sinal de sérios problemas de conectividade que impedem a aplicação de alcançar a rede BitTorrent. Por favor, verifique a sua conexão de rede e tente reiniciar Ceno. Se tem uma conexão funcional mas o estado permanece `inicializando`, por favor fale conosco (especialmente se o estado já foi `iniciado` em alguma execução anterior).
pt_br: Quando você abre Ceno, o estado pode indicar `inicializando` por alguns segundos, esse comportamento é normal. No entanto, se o estado permanece `inicializando` por muito tempo, pode ser um sinal de sérios problemas de conectividade que impedem a aplicação de alcançar a rede BitTorrent. Por favor, verifique a sua conexão de rede e tente reiniciar Ceno. Se você tem uma conexão funcional mas o estado permanece `inicializando`, por favor fale conosco (especialmente se o estado já foi `iniciado` em alguma execução anterior).
ru: При запуске Ceno, на несколько секунд может отображаться сообщение `starting`, это нормально. Однако если состояние `starting` будет продолжительное время, это может быть признаком серьёзных проблем с подключением, которые предотвращают доступ приложения к сети BitTorrent. Пожалуйста, проверьте соединение и попробуйте перезапустить Ceno. Если соединение в порядке, но состояние по-прежнему отображает `starting`, тогда, пожалуйста, свяжитесь с нами (особенно если в предыдущих запусках состояние было `started`).
tr: CENO başlatıldığında durum bir kaç saniyeliğine `başlatılıyor` olarak görünebilir. Uzun süre `başlatılıyor` olarak kalırsa, uygulamanın BitTorrent ağına erişimini engelleyen bağlantı sorunları olabilir. İnternetiniz çalışıyorsa ve durum `başlatılıyor` olarak kalıyorsa, lütfen bize ulaşın (özellikle bir önceki başlatmanızda durum `başlatıldı` olarak kaldıysa).
ur: جب آپ Ceno لانچ کرتے ہیں، تو حالت چند سیکنڈ کے لیے 'شروع ہو رہا ہے' پڑھ سکتی ہے۔ یہ عام ہے. تاہم، اگر حالت بہت دیر تک 'شروع ہو رہا ہے' رہتی ہے، تو یہ کنیکٹیویٹی کے سنگین مسائل کا اشارہ ہو سکتا ہے جو ایپلیکیشن کو BitTorrent نیٹ ورک تک پہنچنے سے روکتا ہے۔ براہ کرم اپنا نیٹ ورک کنکشن چیک کریں اور Ceno کو دوبارہ شروع کرنے کی کوشش کریں۔ اگر آپ کے پاس ورکنگ کنکشن ہے لیکن حالت 'شروع ہو رہا ہے' بنی ہوئی ہے، تو براہ کرم ہم سے رابطہ کریں (خاص طور پر اگر حالت کسی پچھلے رن میں 'شروع ہو رہا ہے' ہوئی تھی)۔

source: One possible reason for not being able to get into BitTorrent (more so when you run Ceno for the first time), is that the default bootstrap servers used by the Ouinet client are blocked or unreachable. In that case you may want to try providing Ceno with extra BitTorrent bootstrap servers in the [Settings page](settings.md). You can ask us if you do not know of any such server. After setting the extra bootstraps, please restart the application. If the problem persists, contact us.
ar: أحد الأسباب المحتملة لعدم القدرة على الوصول إلى بت تورنت (بالأخص عند تشغيل Ceno لأول مرة)، هو أن خوادم التمهيد الافتراضية التي يستخدمها عميل Ouinet محظورة أو لا يمكن الوصول إليها. في هذه الحالة، قد ترغب في محاولة تزويد Ceno بخوادم تمهيد تشغيل إضافية من بت تورنت في [صفحة الإعدادات](settings.md). يمكنك أن تسألنا إذا كنت لا تعرف أي خادم من هذا القبيل. بعد ضبط التمهيد الإضافي، يرجى إعادة تشغيل التطبيق. إذا استمرت المشكلة، اتصل بنا.
de: Ein möglicher Grund dafür, dass Sie nicht in der Lage sind, auf BitTorrent zuzugreifen (vor allem, wenn Sie Ceno zum ersten Mal starten), ist, dass die vom Ouinet-Client verwendeten Standard-Bootstrap-Server blockiert oder unerreichbar sind. In diesem Fall sollten Sie versuchen, Ceno auf der Seite [Einstellungen](settings.md) zusätzliche BitTorrent-Bootstrap-Server zur Verfügung zu stellen. Sie können uns fragen, wenn Sie keinen solchen Server kennen. Nachdem Sie die zusätzlichen Bootstraps eingestellt haben, starten Sie bitte die Anwendung neu. Wenn das Problem weiterhin besteht, kontaktieren Sie uns.
es: Un motivo de no poder conectarse a la red BitTorrent (sobre todo al ejecutar Ceno por primera vez), es que los servidores por defecto de arranque usados por Ouinet estén bloqueados o no sean alcanzables. En ese caso puedes intentar proporcionar a Ceno servidores extra de arranque de BitTorrent en la [página de Configuración}(settings.md). Puedes consultar si no conoces ninguno de tales servidores. Tras establecer los servidores extra, reinicia la aplicación. Si el problema persiste, por favor contáctanos.
fr: Une raison possible pour ne pas pouvoir accéder à BitTorrent (plus encore lorsque vous exécutez Ceno pour la première fois), est que les serveurs d'amorçage par défaut utilisés par le client Ouinet sont bloqués ou inaccessibles. Dans ce cas, vous pouvez essayer de fournir à Ceno des serveurs de démarrage BitTorrent supplémentaires dans la [page Paramètres] (settings.md). Vous pouvez nous demander si vous ne connaissez pas un tel serveur. Après avoir défini les bootstraps supplémentaires, veuillez redémarrer l'application. Si le problème persiste, contactez-nous.
id: Salah satu alasan yang mungkin untuk tidak dapat masuk ke BitTorrent (terlebih ketika Anda menjalankan Ceno untuk pertama kalinya), adalah karena server bootstrap bawaan yang digunakan oleh klien Ouinet diblokir atau tidak dapat dijangkau. Dalam hal ini, Anda mungkin ingin mencoba menyediakan Ceno dengan server bootstrap BitTorrent tambahan di [Halaman Pengaturan] (settings.md). Anda dapat bertanya kepada kami jika Anda tidak mengetahui adanya server tersebut. Setelah mengatur bootstrap tambahan, silakan mulai ulang aplikasi. Jika masalah masih berlanjut, hubungi kami.
pt: Uma possível razão para não conseguir entrar no BitTorrent (principalmente ao executar Ceno pela primeira vez), é que os servidores bootstrap padrão usados pelo cliente Ouinet estão bloqueados ou inalcançáveis. Nesse caso, pode querer tentar oferecer ao Ceno servidores bootstrap BitTorrent adicionais na [página Configurações](settings.md). Pode nos perguntar caso não conheça nenhum servidor do tipo. Após configurar os bootstraps adicionais, por favor, reinicie a aplicação. Se o problema persistir, fale conosco.
pt_br: Uma possível razão para não conseguir entrar no BitTorrent (principalmente ao executar Ceno pela primeira vez), é que os servidores bootstrap padrão usados pelo cliente Ouinet estão bloqueados ou inalcançáveis. Nesse caso, você pode querer tentar oferecer ao Ceno servidores bootstrap BitTorrent adicionais na [página Configurações](settings.md). Você pode nos perguntar caso não conheça nenhum servidor do tipo. Após configurar os bootstraps adicionais, por favor, reinicie a aplicação. Se o problema persistir, fale conosco.
ru: Одной из возможных причин невозможности получить доступ к BitTorrent (тем более, когда вы запускаете Ceno в первый раз) является то, что загрузочные серверы по умолчанию, используемые клиентом Ouinet, заблокированы или недоступны. В этом случае вы можете попробовать предоставить Ceno дополнительные загрузочные серверы BitTorrent на [Странице настроек](settings.md). Если вы не знаете ни одного из таких серверов, можете спросить у нас. После установки дополнительных загрузчиков перезапустите приложение. Если проблема не устранена, свяжитесь с нами.
tr: BitTorrent ağına giremiyorsanız (özellikle ilk kez CENO çalıştırdığınızda), Ouinet istemcisinin kullandığı varsayılan ön yükleme sunucuları engellenmiş veya erişilemiyor olabilir. Ayarlar bölümünden CENO için ek BitTorrent ön yükleme sunucuları eklemeniz gerekebilir. Böyle bir sunucu bilmiyorsanız bize sorabilirsiniz. Ek ön yükleyiciler ayarlandıktan sonra, uygulamayı yeniden başlatın. Sorun sürerse, bizimle görüşün.
ur: BitTorrent میں جانے کے قابل نہ ہونے کی ایک ممکنہ وجہ (جب آپ پہلی بار Ceno چلاتے ہیں) تو یہ ہے کہ Ouinet کلائنٹ کے ذریعے استعمال ہونے والے ڈیفالٹ بوٹسٹریپ سرورز بلاک یا ناقابل رسائی ہیں۔ اس صورت میں آپ Ceno کو اضافی BitTorrent بوٹسٹریپ سرور فراہم کرنے کی کوشش کر سکتے ہیں [ترتیبات کا صفحہ](settings.md)۔ اگر آپ ایسے کسی سرور کے بارے میں نہیں جانتے تو آپ ہم سے پوچھ سکتے ہیں۔ اضافی بوٹسٹریپس سیٹ کرنے کے بعد، براہ کرم ایپلیکیشن کو دوبارہ شروع کریں۔ اگر مسئلہ برقرار رہتا ہے تو ہم سے رابطہ کریں۔

source: If you ever see some other state, there may be some internal error in the Ouinet client. Please report the issue to us.
ar: إذا رأيت أي حالة أخرى، فقد يكون هناك خطأ داخلي في عميل Ouinet. الرجاء إبلاغنا عن المشكلة.
de: Wenn Sie einen anderen Status sehen, liegt möglicherweise ein interner Fehler im Ouinet-Client vor. Bitte melden Sie das Problem an uns.
es: Si ves algún otro estado, podría haber algún error interno en el cliente Ouinet. Por favor infórmanos sobre esta dificultad.
fr: Si jamais vous voyez un autre état, il peut y avoir une erreur interne dans le client Ouinet. Veuillez nous signaler le problème.
id: Jika Anda melihat status lain, mungkin ada beberapa kesalahan internal pada klien Ouinet. Silakan laporkan masalah ini kepada kami.
pt: Se alguma vez vir um outro estado, pode haver um erro interno no cliente Ouinet. Por favor, relate-nos o problema.
pt_br: Se alguma vez você vir um outro estado, pode haver um erro interno no cliente Ouinet. Por favor, relate o problema para nós.
ru: Если в какой-то момент появится другое состояние, это может означать внутреннюю ошибку клиента Ouinet. Пожалуйста, сообщите нам об этом.
tr: Farklı bir durum yaşıyorsanız, Ouinet istemcinizin kendisinde bir sorun olabilir. Lütfen sorunu bize bildirin.
ur: اگر آپ کو کبھی کوئی دوسری حالت نظر آتی ہے تو، Ouinet کلائنٹ میں کچھ اندرونی خرابی ہو سکتی ہے۔ براہ کرم ہمیں اس مسئلے کی اطلاع دیں۔

source: Accessing some content shows "Failed to retrieve the resource"
ar: يُظهِر الوصول إلى بعض المحتوى "فشل استرداد المورد"
de: Beim Zugriff auf bestimmte Inhalte wird "Fehler beim Abrufen der Ressource" angezeigt
es: Al acceder a algún contenido aparece "Fallo al descargar el recurso"
fa: دسترسی به محتوایی خاص پیغام «بازیابی منبع ناموفق بود» را نشان می‌دهد
fr: L'accès à certains contenus affiche "Impossible de récupérer la ressource"
id: Saat mengakses beberapa konten muncul "Gagal mengambil sumber daya"
my: အချို့အကြောင်းအရာကို ဝင်ရောက်သုံးစွဲရာတွင် "ရင်းမြစ်ကို ပြန်ထုတ်၍ မရနိုင်ပါ" ကို ပြသသည်
pt: Aceder algum conteúdo retorna "Falha em recuperar o recurso"
pt_br: Acessar algum conteúdo retorna "Falha em recuperar o recurso"
ru: При доступе к контенту появляется сообщение "Не удалось загрузить ресурс"
tr: Bazı içeriklere erişirken "Kaynak alınamadı" hata iletisi görüntüleniyor
uk: Під час доступу до вмісту зʼявляється повідомлення «Не вдалося завантажити ресурс»
ur: کچھ مواد تک رسائی سے پتہ چلتا ہے کہ "وسائل کی بازیافت میں ناکام"

source: This means that Ceno tried all available mechanisms to access the content, but none of them succeeded.
ar: هذا يعني أن Ceno جرب جميع الآليات المتاحة للوصول إلى المحتوى، لكن لم ينجح أي منها.
de: Das bedeutet, dass Ceno alle verfügbaren Mechanismen ausprobiert hat, um auf den Inhalt zuzugreifen, aber keiner von ihnen war erfolgreich.
es: Esto significa que Ceno intentó todos los mecanismos disponibles para acceder al contenido, pero ninguno tuvo éxito.
fr: Cela signifie que Ceno a essayé tous les mécanismes disponibles pour accéder au contenu, mais aucun n'a réussi.
id: Hal ini berarti bahwa Ceno mencoba semua mekanisme yang tersedia untuk mengakses konten, tetapi tidak ada yang berhasil.
pt: Isso significa que o Ceno tentou todos os mecanismos disponíveis para aceder o conteúdo, mas nenhum deles obteve sucesso.
pt_br: Isso significa que o Ceno tentou todos os mecanismos disponíveis para acessar o conteúdo, mas nenhum deles obteve sucesso.
ru: Это означает, что Ceno испробовал все доступные схемы для получения доступа к контенту, но ни одна из них не увенчалась успехом.
tr: Bu durumda, CENO içeriğe erişmek için tüm yöntemleri denemiş ancak hepsi başarısız olmuştur.
ur: اس کا مطلب ہے کہ Ceno نے مواد تک رسائی کے لیے تمام دستیاب طریقہ کار آزمائے، لیکن ان میں سے کوئی بھی کامیاب نہیں ہوا۔

source: You should make sure that the following requirements are fulfilled for Ceno to work:
ar: يجب عليك التأكد من استيفاء المتطلبات التالية لكي يعمل Ceno:
de: Sie sollten sicherstellen, dass die folgenden Anforderungen erfüllt sind, damit Ceno arbeiten kann:
es: Deberías asegurarte de que los siguientes requerimientos sean cumplidos para que Ceno funcione:
fr: Vous devez vous assurer que les conditions suivantes sont remplies pour que Ceno fonctionne :
id: Anda harus memastikan bahwa persyaratan berikut ini dipenuhi agar Ceno dapat bekerja:
pt: Deve certificar-se de que os seguintes requisitos foram preenchidos para o Ceno funcionar:
pt_br: Você deve certificar-se de que os seguintes requisitos foram preenchidos para o Ceno funcionar:
ru: Вы должны убедиться, что для работы Ceno выполняются следующие требования:
tr: CENO çalıştırmak için şu gereksinimlerin sağlandığından emin olun:
ur: آپ کو یہ یقینی بنانا چاہیے کہ Ceno کے کام کرنے کے لیے درج ذیل تقاضے پورے کیے گئے ہیں:

source: You are running a recent version of Ceno Browser. Obsolete versions may not be able to communicate with newer injectors or other clients. Check the [installation instructions](install.md) to know where to get new versions.
ar: تأكد أنك تقوم بتشغيل إصدار حديث من متصفح Ceno. قد لا تتمكن الإصدارات القديمة من التواصل مع أجهزة الحقن الأحدث أو العملاء الآخرين. تحقق من [تعليمات التثبيت](install.md) لمعرفة كيفية الحصول على الإصدارات الجديدة.
de: Sie verwenden eine aktuelle Version von Ceno Browser. Veraltete Versionen sind möglicherweise nicht in der Lage, mit neueren Injektoren oder anderen Clients zu kommunizieren. Schauen Sie in den [Installationsanweisungen](install.md) nach, um zu erfahren, wo Sie neue Versionen erhalten können.
es: Estás ejecutando una versión reciente del Navegador Ceno. Las obsoletas podrían no ser capaces de comunicarse con inyectores más nuevos u otros clientes. Comprueba las [instrucciones de instalación](install.md) para saber dónde obtener nuevas versiones.
fr: Vous utilisez une version récente du navigateur Ceno. Les versions obsolètes peuvent ne pas être en mesure de communiquer avec les nouveaux injecteurs ou d'autres clients. Consultez les [instructions d'installation] (install.md) pour savoir où obtenir les nouvelles versions.
id: Anda menjalankan versi terbaru dari Peramban Ceno. Versi lama mungkin tidak dapat berkomunikasi dengan injektor yang lebih baru atau klien lain. Periksa [petunjuk pemasangan] (install.md) untuk mengetahui di mana Anda bisa mendapatkan versi terbaru.
pt: Está a executar uma versão recente do Navegador Ceno. Versões obsoletas podem não ser capazes de comunicar com injetores mais novos ou com outros clientes. Verifique as [instruções de instalação](install.md) para saber onde obter novas versões.
pt_br: Você está executando uma versão recente do Navegador Ceno. Versões obsoletas podem não ser capazes de se comunicar com injetores mais novos ou com outros clientes. Verifique as [instruções de instalação](install.md) para saber onde obter novas versões.
ru: Вы используете последнюю версию Браузера Ceno. Устаревшие версии могут не работать с новыми инъекторами или другими клиентами. Проверьте [руководство по установке](install.md), чтобы узнать, где получить новые версии.
tr: Güncel bir CENO Browser sürümünü kullandığınızdan emin olun. Eski sürümler diğer istemcilerle veya yeni içerik ekleyicilerle iletişim kuramayabilir. Yeni sürümleri nasıl edinebileceğinizi [kurulum yönergeleri](install.md) bölümünden öğrenebilirsiniz.
ur: آپ Ceno براؤزر کا حالیہ ورژن چلا رہے ہیں۔ متروک ورژن نئے انجیکٹرز یا دوسرے کلائنٹس کے ساتھ بات چیت کرنے کے قابل نہیں ہوسکتے ہیں۔ یہ جاننے کے لیے کہ نئے ورژن کہاں سے حاصل کیے جائیں [انسٹالیشن ہدایات](install.md) کو چیک کریں۔

source: All access mechanisms in the [Settings page](settings.md) are enabled. Otherwise Ceno will not be able to circumvent some connectivity issues when accessing content.
ar: تأكد أنه تم تمكين جميع آليات الوصول في [صفحة الإعدادات](settings.md). وإلا فلن يتمكن Ceno من التحايل على بعض مشاكل الاتصال عند الوصول إلى المحتوى.
de: Alle Zugriffsmechanismen auf der Seite [Einstellungen](settings.md) sind aktiviert. Andernfalls ist Ceno nicht in der Lage, einige Verbindungsprobleme beim Zugriff auf Inhalte zu umgehen.
es: Todos los mecanismos de acceso en la [página de Configuración](settings.md) están habilitados. De otra manera, Ceno no será capaz de eludir algunas dificultades de conectividad al acceder contenido.
fr: Tous les mécanismes d'accès de la [page Paramètres] (settings.md) sont activés. Sinon, Ceno ne pourra pas contourner certains problèmes de connectivité lors de l'accès au contenu.
id: Semua mekanisme akses di [Halaman Pengaturan] (settings.md) diaktifkan. Jika tidak, Ceno tidak dapat menghindari beberapa masalah konektivitas saat mengakses konten.
pt: Todos os mecanismos de acesso na [página Configurações](settings.md) estão ativados. De outra forma, Ceno não conseguirá contornar alguns problemas de conectividade ao aceder o conteúdo.
pt_br: Todos os mecanismos de acesso na [página Configurações](settings.md) estão ativados. De outra forma, Ceno não conseguirá contornar alguns problemas de conectividade ao acessar o conteúdo.
ru: Все схемы доступа на странице [Настройки](settings.md) включены. В противном случае Ceno не сможет обойти некоторые проблемы с доступом к контенту.
tr: [Ayarlar bölümündeki](settings.md) tüm erişim yöntemlerinin açık olduğundan emin olun. Yoksa CENO içeriğe erişirken bazı bağlantı sorunlarını aşamaz.
ur: [ترتیبات کے صفحہ](settings.md) میں رسائی کے تمام طریقہ کار فعال ہیں۔ بصورت دیگر Ceno مواد تک رسائی کے وقت کنیکٹوٹی کے کچھ مسائل کو دور نہیں کر سکے گا۔
