Repository: censorship-no/ceno-docs
Catalog: user-manual/*/browser/troubleshooting.po
Languages: ar, de, es, fa, fr, id, my, pt, pt_br, ru, tr, uk, ur

source: **Technical note:** If your device reports *undecided* reachability and you can change the configuration of the access point, you may create a permanent port forwarding rule towards your client. See [here](bridging.md) for further instructions.
ar: **ملاحظة تقنية:** إذا أبلغ جهازك عن حالة إمكانية الوصول كـ *لم يتم تحديدها* وبإمكانك تغيير تهيئة نقطة الوصول، يمكنك إنشاء قاعدة إعادة توجيه منفذ دائمة تجاه العميل. انظر [هنا](bridging.md) لمزيد من التعليمات.
de: **Technischer Hinweis:** Wenn Ihr Gerät *unentschiedene* Erreichbarkeit meldet und Sie die Konfiguration des Zugangspunkts ändern können, können Sie eine permanente Portweiterleitungsregel für Ihren Client erstellen. Siehe [hier](bridging.md) für weitere Anweisungen.
es: **Nota técnica:** Si tu dispositivo reporta alcanzabilidad *no decidida* y puedes cambiar la configuración del punto de acceso, podrías crear una regla permanente de redireccionamiento de un puerto hacia tu cliente. Mira [aquí](bridging.md) para más instrucciones.
fa: **نکته‌ی فنی:** اگر دستگاه‌تان در مورد دسترس‌پذیری وضعیت *تصمیم‌ناپذیر*ی را گزارش می‌کند و شما می‌توانید تنظیم نقطه‌ی دسترسی را تغییر دهید، می‌توانید یک درگاه دائم به‌روی قواعد پیش‌برنده به‌سوی سرویس‌گیرنده‌تان بسازید. برای راهنمایی‌های بیشتر [این‌جا](bridging.md) را ببینید.
fr: **Note technique :** Si votre appareil signale une accessibilité *indécise* et que vous pouvez modifier la configuration du point d'accès, vous pouvez créer une règle de redirection de port permanente vers votre client. Voir [ici](bridging.md) pour plus d'instructions.
id: **Catatan teknis:** Jika perangkat Anda melaporkan jangkauan *tidak pasti* dan Anda dapat mengubah konfigurasi titik akses, Anda dapat membuat aturan penerusan porta permanen ke klien Anda. Lihat [di sini] (bridging.md) untuk petunjuk lebih lanjut.
my: **နည်းပညာဆိုင်ရာ မှတ်ချက်-** သင့်စက်သည် *ဆုံးဖြတ်မထားသော* ရောက်ရှိနိုင်မှုကို အစီရင်ခံပြီး သင်သည် ဝင်ရောက်သုံးစွဲမှု ပွိုင့်၏ စီစဉ်သတ်မှတ်မှုကို ပြောင်းလဲနိုင်ပါက သင်သည် သင့်လက်ခံစက်ထံ အမြဲတမ်း ပေါ့တ် တစ်ဆင့်ပို့ခြင်း စည်းကမ်းကို ဖန်တီးနိုင်သည်။ နောက်ထပ် လမ်းညွှန်ချက်များအတွက် [ဤနေရာတွင်](bridging.md) ကြည့်ပါ။
pt: **Nota técnica:** Se o seu aparelho relata acessibilidade *não decidida* e é possível modificar a configuração do ponto de acesso, pode criar uma regra permanente de redirecionamento de porta na direção do seu cliente. Veja [aqui](bridging.md) para maiores instruções.
pt_br: **Nota técnica:** Se o seu dispositivo relata acessibilidade *não decidida* e é possível modificar a configuração do ponto de acesso, você pode criar uma regra permanente de redirecionamento de porta na direção do seu cliente. Veja [aqui](bridging.md) para maiores instruções.
ru: **Техническое примечание:** Если ваше устройство сообщает о *неопределенной* доступности и вы можете изменить конфигурацию точки доступа, вы можете создать постоянное правило переадресации портов для вашего клиента. Более подробные инструкции см. [здесь](bridging.md).
tr: **Teknik not:** Aygıtınızın erişilebilirliği *Kararlaştırılmamış* olarak görüntüleniyorsa ve kablosuz ağ yapılandırmasını değiştirebiliyorsanız, istemcinize kalıcı bir yönlendirme oluşturabilirsiniz. Ayrıntılı yönergeler için [buraya](bridging.md) bakın.
uk: **Технічна примітка:** Якщо Ваш пристрій повідомляє про *невизначену* доступність і Ви здатні змінити конфігурацію точки доступу, Ви можете створити постійне правило переадресації портів для Вашого клієнта. Докладніші інструкції дивіться [тут](bridging.md).
ur: **تکنیکی نوٹ:** اگر آپ کا ڈیوائس*غیر فیصلہ کن* رسائی کی اطلاع دیتا ہے اور آپ رسائی پوائنٹ کی ترتیب کو تبدیل کر سکتے ہیں، تو آپ اپنے کلائنٹ کے لیے ایک مستقل پورٹ فارورڈنگ اصول بنا سکتے ہیں۔ مزید ہدایات کے لیے [یہاں](bridging.md) دیکھیں۔

source: [HTTPS by default]: https://github.com/Rob--W/https-by-default
ar: [HTTPS افتراضيًا]: https://github.com/Rob--W/https-by-default
tr: [Varsayılan olarak HTTPS]: https://github.com/Rob--W/https-by-default

source: If problems still persist, please report them to [cenoers@equalitie.org](mailto:cenoers@equalitie.org). We will try to help you with them.
es: Si los problemas aún persisten, por favor repórtalos a [cenoers@equalitie.org](mailto:cenoers@equalitie.org). Intentaremos ayudarte con ellos.
ur: اگر مسائل اب بھی برقرار رہتے ہیں، تو براہ کرم ان کی اطلاع [cenoers@equalitie.org](mailto:cenoers@equalitie.org) پر دیں۔ ہم آپ کی ان کے ساتھ مدد کرنے کی کوشش کریں گے۔

source: If problems still persist, please report them to [cenoers@equalit.ie](mailto:cenoers@equalit.ie). We will try to help you with them.
fa: اگر مشکلات هنوز پابرجا بودند، لطفاً آن‌ها را به نشانی [cenoers@equalit.ie](mailto:cenoers@equalit.ie) گزارش کنید. ما تلاش خواهیم کرد تا در حل آن‌ها به شما یاری رسانیم.
fr: Si des problèmes persistent, veuillez les signaler à [cenoers@equalit.ie](mailto:cenoers@equalit.ie). Nous essaierons de vous aider avec eux.
my: ပြဿနာ ဆက်ရှိနေသေးပါက ကျေးဇူးပြု၍ ၎င်းတို့ကို [cenoers@equalit.ie](mailto:cenoers@equalit.ie) ထံ သတင်းပို့ပါ။ ကျွန်ုပ်တို့သည် သင့်အား ၎င်းတို့နှင့် ပတ်သက်၍ ကူညီရန် ကြိုးစားပါမည်။
uk: Якщо Ви й досі стикаєтеся з проблемами, будь ласка, повідомте про них за адресою [cenoers@equalit.ie](mailto:cenoers@equalit.ie). Ми спробуємо допомогти Вам у вирішенні цих проблем.

source: This section will give you some hints about what to do when different, known problems arise with CENO and Ouinet. Please bear in mind that these are experimental projects, and that their operation is subject to a multitude of factors beyond our control, like the particular configuration and status of network infrastructure, as well as which content other users have retrieved and the characteristics of their connections.
fa: این بخش سرنخ‌هایی را به شما در این‌باره ارائه خواهد داد که چه باید کرد وقتی مشکلات مختلف و معین با سنو و وینت سربرمی‌آورند. لطفاً به یاد داشته باشید که این‌ها پروژه‌هایی آزمایشی‌اند، و این‌که عملکردشان تابع کثرتی از عوامل فراسوی کنترل ماست، مثل تنظیمات خاص و جایگاه زیرساخت شبکه، و نیز این‌که چه محتوایی را کاربران دیگر بازیابی کرده‌اند و ویژگی‌های سرشت‌نمای ارتباطات و اتصالات آن‌ها.
my: ဤအပိုင်းတွင် CENO နှင့် Ouinet သုံးရာတွင် ကွဲပြားသော၊ သိပြီးဖြစ်သည့် ပြဿနာများ ပေါ်ပေါက်ချိန်တွင် ဘာလုပ်ရမည်နှင့် ပတ်သက်ပြီး သင့်အား အကြံဉာဏ်အချို့ ပေးပါမည်။ ၎င်းတို့သည် စမ်းသပ်ဆဲ ပရောဂျက်များ ဖြစ်ပြီး ၎င်းတို့၏ လည်ပတ်မှုသည် ကျွန်ုပ်တို့၏ ထိန်းချုပ်မှုအောက်တွင် မရှိသော တိကျသည့် စီစဉ်သတ်မှတ်မှုနှင့် ကွန်ရက် အခြေခံအဆောက်အအုံ၏ အခြေအနေအပြင် အခြားသုံးစွဲသူများက မည်သည့်အကြောင်းအရာကို ပြန်ထုတ်ထားကြောင်းနှင့် ၎င်းတို့ ချိတ်ဆက်မှုများ၏ လက္ခဏာရပ်များကဲ့သို့ အကြောင်းခြင်းရာများစွာပေါ် မူတည်ကြောင်း ကျေးဇူးပြု၍ မှတ်သားထားပါ။
uk: У цьому розділі Ви знайдете поради, що необхідно робити при виникненні різноманітних несправностей із CENO та Ouinet. Будь ласка, майте на увазі, що це експериментальні проєкти, і їхня робота залежить від багатьох факторів, що залежать не тільки від нас, зокрема конфігурації та стану мережевої інфраструктури, від того, який вміст завантажували інші користувачі та характеристики їхніх зʼєднань.

source: There is no CENO entry in the app menu
fa: در منوی نرم‌افزار مدخل سنو وجود ندارد
my: အက်ပ် မီနူးတွင် CENO ကို ထည့်ထားခြင်း မရှိပါ
uk: У меню програми немає пункту CENO

source: The CENO Extension may still be loading. Please be patient.
fa: افزونه‌ی سنو شاید هنوز در حال بارگذاری باشد. لطفاً بردبار باشید.
my: CENO အဆက်သည် တင်နေဆဲ ဖြစ်နိုင်သည်။ ကျေးဇူးပြု၍ စိတ်ရှည်ပါ။
uk: Можливо, розширення CENO все ще завантажується. Зачекайте.

source: All widgets are grayed-out in the *CENO Settings* page
fa: همه‌ی ابزارک‌ها در صفحه‌ی *تنظیمات سنو* طوسی شده‌اند
my: *CENO ဆက်တင်များ* စာမျက်နှာတွင် ဝစ်ဂျက်အားလုံးသည် အရောင်မှိန်နေသည်
uk: На сторінці *Налаштування CENO* всі віджети виділені сірим кольором

source: The CENO Extension has loaded, but it has not yet been able to retrieve status from Ouinet. Since it may take a moment for Ouinet to be ready, please be patient.
fa: افزونه‌ی سنو بارگذاری شده است، اما هنوز نتوانسته جایگاه و شأن‌اش را از وینت بازیابی کند. از آن‌جا که این آماده‌شدن یرای وینت شاید دیری به طول انجامد، لطفاً بردبار باشید.
my: CENO အဆက်ကို တင်ပြီးသော်လည်း ၎င်းသည် Ouinet မှ အခြေအနေကို ပြန်မထုတ်နိုင်သေးပါ။ Ouinet အနေနှင့် အသင့်ဖြစ်ရန် အချိန်အနည်းငယ် ကြာနိုင်သောကြောင့် ကျေးဇူးပြု၍ စိတ်ရှည်ပါ။
uk: Розширення CENO вже завантажилося, але воно ще не набуло статусу від Ouinet. Оскільки підготовка Ouinet може зайняти якийсь час, будь ласка, зачекайте.

source: Try to visit some page, if possible one which is usually available. If you get an error like "Failed to retrieve the resource (after attempting all configured mechanisms)", CENO may be experiencing some issues with general connectivity (like being unable to join the BitTorrent network). If you are on a mobile connection, try again with Wi-Fi.
fa: سعی کنید از صفحه‌ای بازدید کنید، در صورت امکان صفحه‌ای که معمولاً در دسترس است. اگر پیغام خطایی مثل «بازیابیِ منبع ناموفق بود (پس از تلاش برای انجام همه‌ی سازوکارهای تنظیم‌شده)» دریافت کردید، سنو شاید در رابطه با اتصال عمومی دچار مشکلاتی شود (مثل ناتوانی در پیوستن به شبکه‌ی بیت‌تورنت). اگر از اتصال به اینترنت همراه استفاده می‌کنید، این بار با وای‌فای از نو تلاش کنید.
my: စာမျက်နှာတစ်ခုခုကို ဝင်ကြည့်ရန် ကြိုးစားပါ၊ ဖြစ်နိုင်ပါက အများအားဖြင့် ရရှိနိုင်သော စာမျက်နှာကို ဝင်ကြည့်ပါ။ "စီစဉ်သတ်မှတ်ထားသော စက်ကိရိယာအားလုံးကို ကြိုးစားပြီးနောက်) ရင်းမြစ်ကို ပြန်ထုတ်၍ မရနိုင်ပါ" ကဲ့သို့ အမှားကို သင် ရရှိပါက CENO သည် (BitTorrent ကွန်ရက်တွင် မပါဝင်နိုင်ခြင်းကဲ့သို့) ယေဘုယျ ချိတ်ဆက်နိုင်မှုတွင် ပြဿနာအချို့ ကြုံရခြင်း ဖြစ်နိုင်သည်။ သင်သည် မိုဘိုင်း ချိတ်ဆက်မှုကို အသုံးပြုနေပါက Wi-Fi သုံး၍ ထပ်မံ ကြိုးစားကြည့်ပါ။
uk: Спробуйте відвідати одну зі сторінок сайту, бажано ту, яка зазвичай Вам доступна. Якщо Ви отримаєте помилку типу «Не вдалося завантажити ресурс (після спроби використання всіх налаштованих схем)», можливо, CENO має деякі проблеми зі загальним підключенням (наприклад, не може приєднатися до мережі BitTorrent). Якщо Ви підключені через мобільний інтернет, спробуйте знову за допомогою Wi-Fi.

source: If you get an error like "The proxy server is refusing connections" when visiting the page, try to stop other applications which may be offering some service to the device, then restart CENO.
fa: اگر پیغام خطایی مانند «سرور پروکسی اتصال‌ها را نمی‌پذیرد» را در هنگام بازدید از صفحه دریافت کردید، سعی کنید نرم‌افزارهای دیگری را که خدمات مشابهی به دستگاه‌تان ارائه می‌دهند متوقف کنید، و سپس سنو را از نو راه‌اندازی کنید.
my: သင်သည် စာမျက်နှာသို့ ဝင်ကြည့်စဉ် "ပရောက်စီ ဆာဗာသည် ချိတ်ဆက်မှုများကို ငြင်းပယ်နေသည်" ကဲ့သို့ အမှားကို ရရှိပါက စက်အား ဝန်ဆောင်မှု ပေးနေနိုင်သော အခြားအက်ပလီကေးရှင်းများကို ရပ်တန့်ရန် ကြိုးစားပြီးနောက် CENO ကို ပြန်လည်စတင်ပါ။
uk: Якщо при відвідуванні сторінки Ви отримуєте помилку типу «Проксі-сервер відмовляє в підключенні», спробуйте зупинити інші програми, що працюють на пристрої, а потім перезапустіть CENO.

source: The *Ouinet client state* under *CENO Settings* is not `started`
my: CENO ဆက်တင်တွင်ရှိသော *Ouinet သုံးစွဲသူ အခြေအနေ*ကို မစတင်ရသေးပါ
uk: *Стан клієнта Ouinet* в *налаштуваннях CENO* – не `запущений`

source: The Ouinet client run by CENO is finding problems starting on your device.
my: Ouinet သုံးစွဲသူမှ CENO ကို စတင်အလုပ်လုပ်လိုက်သည်နှင့် သင့်စက်ပစ္စည်းတွင် ပြဿနာများကို စတင်ရှာဖွေပါသည်။
uk: Клієнт Ouinet, який працює через CENO, виявляє проблеми під час запуску на Вашому пристрої.

source: When you launch CENO, the state may read `starting` for a few seconds; this is normal. However, if the state remains `starting` for too long, it may be a signal of serious connectivity issues that preclude the application from reaching the BitTorrent network. Please check your network connection and try restarting CENO. If you have a working connection but the state remains `starting`, please contact us.
my: CENO ကို စတင်လိုက်သောအခါ `စတင်ခြင်း` အဆင့်တွင် စက္ကန့်အနည်းငယ်ရှိနေခြင်းက ပုံမှန်ဖြစ်ပါသည်။ အကယ်၍များ `စတင်ခြင်း` အဆင့်တွင် အတော်ကြာနေပါက ချိတ်ဆက်မှုတွင် ပြဿနာတစ်ခုခုရှိနေတာဖြစ်နိုင်ပါတယ်၊ BitTorrent ကွန်ရက်ကို ရောက်ရှိဖို့အတွက် အပ်ပလီကေးရှင်းကို တားမြစ်တဲ့ ချိတ်ဆက်မှု ပြဿနာမျိုးတွေဖြစ်နိုင်ပါသည်။ ကျေးဇူးပြုပြီး သင့် ကွန်ရက်ချိတ်ဆက်မှုကို စစ်ဆေးပါ၊ ပြီးနောက်မှ CENO ကို ပြန်လည်စတင်ကြည့်ပါ။ အကယ်၍ သင့်တွင် အလုပ်လုပ်တဲ့ ကွန်ရက်ချိတ်ဆက်မှုရှိပေမယ့် `စတင်ခြင်း` အဆင့်တွင်သာရှိနေပါက ကျေးဇူးပြုပြီး ကျွန်ုပ်တို့ကို ဆက်သွယ်ပေးပါ။

source: If you see some other state, there may be some internal error in the Ouinet client. Please report the issue to us.
my: အကယ်၍ အခြားသောအခြေအနေတွေကိုရောက်ရှိခြင်းကို မြင်သောအခါ Ouinet သုံးစွဲသူတွင် စက်တွင်းပြဿနာတစ်ခုခုရှိနေတာ ဖြစ်နိုင်ပါသည်။ ‌ကျေးဇူးပြုပြီး ကျွန်ုပ်တို့ကို ပြဿနာအကြောင်း ပြောပြပေးပါ။

source: This means that CENO tried all available mechanisms to access the content, but none of them succeeded.
fa: این یعنی سنو تمام سازوکارهای موجود برای دسترسی به آن محتوا را امتحان کرده است، اما هیچ‌یک از آن‌ها موفق نبوده‌اند.
my: ဆိုလိုသည်မှာ CENO သည် အကြောင်းအရာကို ဝင်ရောက်သုံးစွဲရန် ရရှိနိုင်သော စက်ကိရိယာအားလုံးကို ကြိုးစားခဲ့သော်လည်း တစ်ခုမျှ မအောင်မြင်ခဲ့ပါ။
uk: Це означає, що CENO випробував усі доступні механізми аби отримати доступ до вмісту, але жоден із них не спрацював.

source: You should make sure that the following requirements are fulfilled for CENO to work:
fa: برای آن‌که سنو درست کار کند باید مطمئن شوید که این پیش‌نیازها برآورده شده‌اند:
my: သင်သည် CENO အလုပ်လုပ်စေရန် အောက်ပါ လိုအပ်ချက်များကို ပြည့်မီကြောင်း သေချာအောင် ပြုလုပ်ရမည်-
uk: Ви повинні переконатися, що для роботи CENO виконуються такі вимоги:

source: You are running a recent version of CENO Browser. Obsolete versions may not be able to communicate with newer injectors or other clients. Check the [installation instructions](install.md) to know where to get new versions.
my: သင်သည် CENO ဘရောက်ဇာ၏ မကြာမီက ဗားရှင်းဖြင့် လုပ်ဆောင်နေသည်။ ဗားရှင်း အဟောင်းများသည် ပိုသစ်သော ထိုးသွင်းဖိုင်များ သို့မဟုတ် အခြားလက်ခံစက်များနှင့် ဆက်သွယ်၍ ရနိုင်မည် မဟုတ်ပါ။ ဗားရှင်းအသစ်များကို မည်သည့်နေရာမှ ရယူနိုင်မည်ကို သိရန် [ထည့်သွင်းမှု လမ်းညွှန်ချက်များ](install.md) ကို စစ်ဆေးပါ။
uk: Ви використовуєте останню версію браузера CENO. Застарілі версії можуть не працювати з новими інʼєкторами або іншими клієнтами. Перевірте [посібник зі встановлення](install.md), щоб дізнатися, де отримати нові версії.

source: All access mechanisms in the [Settings page](settings.md) are enabled. Otherwise CENO will not be able to circumvent some connectivity issues when accessing content.
fa: تمام سازوکارهای دسترسی در [صفحه‌ی تنظیمات](settings.md) فعال شده و به کار افتاده‌اند. در غیر این صورت سنو نخواهد توانست برخی مشکلات مربوط به اتصال را در هنگام دسترسی به محتوا دور بزند.
my: [ဆက်တင်များ စာမျက်နှာ](settings.md) ရှိ ဝင်ရောက်သုံးစွဲခွင့် စက်ကိရိယာအားလုံးကို ဖွင့်ထားသည်။ မဖွင့်ထားပါက CENO သည် အကြောင်းအရာကို ဝင်ရောက်သုံးစွဲစဉ် ချိတ်ဆက်မှု ပြဿနာအချို့ကို ရှောင်ရှားနိုင်မည် မဟုတ်ပါ။
uk: Усі механізми доступу на сторінці [Налаштування](settings.md) включені. В іншому випадку CENO не зможе оминути деякі проблеми з доступом до вмісту.

source: Your device has a working connection to the network, i.e. your normal Web browser is able to open some Web sites. CENO and Ouinet cannot work when all network connectivity is shut down (although users may still find a common Wi-Fi access point to do device-to-device sharing).
fa: دستگاه شما یک ارتباط کارآ با شبکه دارد، یعنی مرورگر وب معمولی شما می‌تواند برخی از وب‌سایت‌ها را باز کند. سنو و وینت نمی‌توانند در حالتی کار کنند که اتصال شبکه به‌تمامی قطع شده باشد (هرچند کاربران باز شاید بتوانند یک نقطه‌ی دسترسی مشترک وای‌فای برای اشتراک‌گذاری دستگاه‌-به‌-دستگاه بیابند).
my: သင့်စက်တွင် အလုပ်လုပ်နေသည့် ကွန်ရက်သို့ ချိတ်ဆက်မှု ရှိသည်။ ဆိုလိုသည်မှာ သင်၏ ပုံမှန် ဝက်ဘ် ဘရောက်ဇာသည် ဝက်ဘ်ဆိုက်အချို့ကို ဖွင့်နိုင်ရမည်။ (သုံးစွဲသူများသည် စက်အချင်းချင်း မျှဝေမှု ပြုလုပ်ရန် ဘုံဖြစ်သော Wi-Fi ဝင်ရောက်သုံးစွဲခွင့် ပွိုင့်ကို ရှာတွေ့နိုင်သေးသော်လည်း) CENO နှင့် Ouinet သည် ကွန်ရက် ချိတ်ဆက်မှုအားလုံးကို ပိတ်ထားချိန်တွင် အလုပ် မလုပ်နိုင်ပါ။
uk: Ваш пристрій має підключення до мережі, тобто Ваш звичайний веб-браузер може відкривати сайти. CENO та Ouinet не можуть працювати, якщо всі мережеві підключення відключені (хоча користувачі можуть знайти загальну точку доступу Wi-Fi для поширення вмісту від пристрою до пристрою безпосередньо).

source: If that is the case, it is worth explaining what may be happening for all access mechanisms to fail, to give you an idea of your chances for getting content using CENO.
fa: اگر مسئله این است، بد نیست توضیح دهیم که چه اتفاقی ممکن است بیفتد که باعث شود تمام سازوکارهای دسترسی ناکام بمانند، تا شما بتوانید تصوری از فرصت‌هایی پیدا کنید که برای دریافت محتوا با استفاده از سنو دارید.
my: ဤကိစ္စရပ်တွင် ဝင်ရောက်ရယူခွင့် ယန္တရားများအားလုံး ဘာကြောင့် မအောင်မြင်ရခြင်းဖြစ်နိုင်ကြောင်း ရှင်းပြသင့်သည်။ သို့မှသာ သင်သည် CENO ကို အသုံးပြု၍ အကြောင်းအရာ ရယူရာတွင် အောင်မြင်နိုင်ခြေကို သိရှိမည်ဖြစ်သည်။
uk: У такому випадку варто пояснити, що може статися, коли всі механізми доступу виходять із ладу, щоб дати Вам уявлення про Ваші шанси отримати вміст за допомогою CENO.

source: Your CENO Browser cannot directly reach the content's origin server. Either the server is having some difficulties itself (e.g. it is down or under some attack), or someone is interfering with your connection to it.
fa: مرورگر سنوی شما نمی‌تواند مستقیماً به سرور اصلی محتوا دست پیدا کند. خواه خود سرور دچار مشکلاتی شود (مثلاً سرور پایین آمده یا مورد هجوم قرار گرفته باشد)، خواه کسی در اتصال شما به آن اخلال ایجاد کند.
my: သင့် CENO ဘရောက်ဇာသည် အကြောင်းအရာ၏ မူလ ဆာဗာသို့ တိုက်ရိုက် မရောက်ရှိနိုင်ပါ။ ဆာဗာကိုယ်တိုင်တွင် အခက်အခဲအချို့ ရှိနေသည် (ဥပမာ- ဆာဗာကျနေသည် သို့မဟုတ် တိုက်ခိုက်ခံရသည်) သို့မဟုတ် တစ်စုံတစ်ယောက်က ဆာဗာသို့ သင်၏ ချိတ်ဆက်မှုကို ကြားဝင် နှောင့်ယှက်နေသည်။
uk: Ваш браузер CENO не може безпосередньо звʼязатися з вихідним сервером вмісту. Або ж у сервера є якісь проблеми (наприклад, він не працює або зазнає атаки), або хтось заважає Вам підключитися до нього.

source: This is the main use case for CENO and the other mechanisms should compensate for it.
fa: این مورد کاربرد اصلی برای سنو است و سازوکارهای دیگر باید آن را جبران کنند.
my: ယင်းသည် CENO အတွက် အဓိက သုံးစွဲမှု ကိစ္စရပ် ဖြစ်ပြီး အခြားစက်ကိရိယာများက ၎င်းကို ဖြည့်ဆည်းပေးသင့်သည်။
uk: CENO створено для вирішення таких проблем, тому інші механізми доступу повинні допомогти з цим.

source: Someone is interfering with your connection to Internet addresses in the injector swarm. Since this is expected to happen eventually as CENO (and Ouinet) gain traction, CENO resorts to reaching injectors via other clients acting as bridges.
my: တစ်စုံတစ်ယောက်က ထိုးသွင်းစက်စာရင်းရှိ အင်တာနက် လိပ်စာများသို့ သင်၏ ချိတ်ဆက်မှုကို ကြားဝင်နှောင့်ယှက်နေသည်။ CENO (နှင့် Ouinet) အားကောင်းလာသည်နှင့်အမျှ နောက်ဆုံးတွင် ဤသို့ဖြစ်လာနိုင်ကြောင်း မျှော်လင့်ထားသည့်အတွက် CENO သည် ပေါင်းကူးများအဖြစ် ဆောင်ရွက်သော အခြားလက်ခံစက်များမှတစ်ဆင့် ထိုးသွင်းဖိုင်များသို့ ရောက်ရှိအောင် ကြိုးစားသည်။
uk: Хтось втручається у Ваше підключення до Інтернет-адрес зі списку інʼєкторів. Рано чи пізно це мало б статися, адже CENO (як і Ouinet) стають все більш помітними, і тому CENO вдається до доступу до інʼєкторів через інших клієнтів, що виступають у ролі мостів.

source: There are different reasons for CENO being unable to reach such clients:
my: CENO သည် ထိုလက်ခံစက်များသို့ မရောက်ရှိနိုင်သည့် ကွဲပြားသော အကြောင်းရင်းများ ရှိသည်-
uk: Існують різні причини, через які CENO не може звʼязатися з такими клієнтами:

source: No other client is reachable by you. If only a few Ouinet clients are online, it is entirely possible that none of them are in a network that can be reached from the outside. This should become less likely as CENO and Ouinet get popular and more clients with diverse connectivity come online.
my: သင်သည် အခြားမည်သည့် လက်ခံစက်ထံသို့မျှ မရောက်ရှိနိုင်ပါ။ Ouinet လက်ခံစက် အနည်းငယ်သာ အွန်လိုင်းတွင် ရှိနေလျှင် ၎င်းတို့သည် ပြင်ပမှ ရောက်ရှိနိုင်သော ကွန်ရက်တွင် ရှိမနေခြင်း ဖြစ်နိုင်သည်။ CENO နှင့် Ouinet ကို လူကြိုက်များလာပြီး ကွဲပြားသော ချိတ်ဆက်နိုင်မှုဖြင့် ပိုများသော လက်ခံစက်များ အွန်လိုင်းတွင် ရှိလာသောအခါ ၎င်းသည် ဖြစ်နိုင်ခြေ နည်းလာနိုင်သည်။
uk: Жоден інший клієнт недоступний для Вас. Якщо тільки невелика кількість клієнтів Ouinet зараз у мережі, цілком можливо, що жоден з них не перебуває в мережі, що доступна ззовні. Ця ситуація буде менш імовірною зі зростанням популярності CENO та Ouinet та появи більшої кількості клієнтів з різними можливостями підключення.

source: This can happen when all traffic leaving or entering the country you are in is interrupted. CENO would resort in this case to getting and using the content from the distributed cache, even if it is stale.
fa: این می‌تواند هنگامی پیش آید که تمام ترافیک در حال خروج از کشور یا در حال ورود به کشور محل سکونت‌تان قطع گردد. سنو در این مورد به گرفتن و به‌کاربردن محتوا از انبار توزیع‌شده پناه می‌جوید، حتی اگر این انبار کهنه باشد.
my: ယင်းသည် သင်ရှိနေသော နိုင်ငံမှ ထွက်ခွာသော သို့မဟုတ် ၎င်းသို့ ဝင်ရောက်သော အသွားအလာ အားလုံးကို ကြားဝင်နှောင့်ယှက်သည့်အချိန်တွင် ဖြစ်ပွားနိုင်သည်။ ဤကိစ္စရပ်တွင် CENO သည် ဖြန့်ချိထားသော ယာယီသိမ်းဆည်းထားသည့် မှတ်ဉာဏ်မှ အကြောင်းအရာသည် ခေတ်မမီတော့သည့်တိုင်အောင် ၎င်းကို ရယူပြီး သုံးစွဲပါလိမ့်မည်။
uk: Це може статися, коли весь трафік, що виходить або входить до країни, де Ви перебуваєте, перерваний. У цьому випадку CENO отримує і використовує вміст із розподіленого кешу, навіть якщо він застарів.

source: Again, as CENO and Ouinet become more popular, the chances increase that there are at least a few clients that do have some kind of access to international sites. Even if access is precarious, a single Ouinet client able to inject some content into the country could suffice to enable it to spread (over the distributed cache) without further need to access the outside world.
fa: یک بار دیگر، همان‌طور که سنو و وینت محبوب‌تر می‌شوند، این شانس‌ها افزایش می‌یابند که دست‌کم چند سرویس‌گیرنده در میان باشند که از نوعی دسترسی به سایت‌های بین‌المللی برخوردار باشند. حتی اگر دسترسی مشروط باشد، یک سرویس‌گیرنده‌ی واحد وینت که قادر به تزریق محتوایی به‌درون کشور است برای تواناساختن آن به گسترش (روی انبار توزیع‌شده) بدون هیچ نیاز دیگر به دسترسی به جهان بیرونی کفایت خواهد کرد.
my: ထပ်မံ၍ CENO နှင့် Ouinet ပိုမိုလူကြိုက်များလာသည်နှင့်အမျှ နိုင်ငံတကာ ဆိုက်များသို့ ဝင်ရောက်သုံးစွဲခွင့် အမျိုးအစားတစ်ခုခု ရှိသော လက်ခံစက်အနည်းငယ် အနည်းဆုံး ရှိနိုင်ခြေ မြင့်တက်လာသည်။ ဝင်ရောက်သုံးစွဲခွင့်က စိတ်မချရသည့်တိုင်အောင် နိုင်ငံတွင်းသို့ အကြောင်းအရာ အချို့ကို ထိုးသွင်းနိုင်သည့် Ouinet လက်ခံစက်တစ်ခုသည် ပြင်ပကမ္ဘာသို့ ထပ်မံ ဝင်ရောက်သုံးစွဲခွင့် မလိုအပ်ဘဲ (ဖြန့်ချိထားသော ယာယီသိမ်းဆည်းထားသည့် မှတ်ဉာဏ်ကို သုံး၍) ၎င်းကို ဖြန့်ဝေရန် လုံလောက်နိုင်သည်။
uk: Знову ж таки, у міру зростання популярності CENO та Ouinet, збільшується ймовірність того, що для вас є хоча б кілька клієнтів, що мають доступ до міжнародних сайтів. Навіть якщо доступ нестабільний, буде достатньо одного клієнта Ouinet, який передає вміст у країну, щоб цей вміст поширювався (через розподілений кеш) без подальшого доступу до зовнішнього світу.
